{"image_path": "data/images/000000158227.jpg", "query": "What is the subject of this image?", "caption": "A child has a baseball helmet and a bat. A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. Bats are flying mammals of the order Chiroptera (). With their forelimbs adapted as wings, they are the only mammals capable of true and sustained flight. A helmet is a form of protective gear worn to protect the head. More specifically, a helmet complements the skull in protecting the human brain.", "faiss_indices": [113, 82, 4]}
{"image_path": "data/images/000000557672.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A woman walking down a street holding an orange umbrella. An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain. A street is a public thoroughfare in a city, town or village, typically lined with buildings on one or both sides. Streets often include pavements (sidewalks), pedestrian crossings, and sometimes amenities like streetlights or benches. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [111, 71, 99]}
{"image_path": "data/images/000000049761.jpg", "query": "What is happening in this image?", "caption": "Wild zebra and wildebeest grazing near a watering hole. Zebras (US: , UK: ) (subgenus Hippotigris) are African equines with distinctive black-and-white striped coats. There are three living species: Grévy's zebra (Equus grevyi), the plains zebra (E. A hole is an opening in or through a particular medium, usually a solid body. Holes occur through natural and artificial processes, and may be useful for various purposes, or may represent a problem needing to be addressed in many fields of engineering.", "faiss_indices": [80, 3, 33]}
{"image_path": "data/images/000000005529.jpg", "query": "What does this picture show?", "caption": "A person with green skis skiing down a big hill. A hill is a landform that extends above the surrounding terrain. It often has a distinct summit, and is usually applied to peaks which are above elevation compared to the relative landmass, though not as prominent as mountains. Skis are runners, attached to the user's feet, designed to glide over snow. Typically employed in pairs, skis are attached to ski boots with ski bindings, with either a free, lockable, or partially secured heel. A person (pl.: people or persons, depending on context) is a being who has certain capacities or attributes such as reason, morality, consciousness or self-consciousness, and being a part of a culturally established form of social relations such as kinship, ownership of property, or legal responsibility. The defining features of personhood and, consequently, what makes a person count as a person, differ widely among cultures and contexts.\nIn addition to the question of personhood, of what makes a being count as a person to begin with, there are further questions about personal identity and self: both about what makes any particular person that particular person instead of another, and about what makes a person at one time the same person as they were or will be at another time despite any intervening changes.\nThe plural form \"people\" is often used to refer to an entire nation or ethnic group (as in \"a people\"), and this was the original meaning of the word; it subsequently acquired its", "faiss_indices": [251, 322, 132]}
{"image_path": "data/images/000000011051.jpg", "query": "What can be seen here?", "caption": "Girl looks back as she fixes flower on boy's suit A girl is a young female human, usually a child or an adolescent. While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture. A suit, also called a lounge suit, business suit, dress suit, or formal suit, is a set of clothes comprising a suit jacket and trousers of identical textiles generally worn with a collared dress shirt, necktie, and dress shoes. A skirt suit is similar, but with a matching skirt instead of trousers.", "faiss_indices": [101, 282, 199]}
{"image_path": "data/images/000000227491.jpg", "query": "What is happening in this image?", "caption": "A female skier sits down on a bench eating a bagel. A bagel (Yiddish: בײגל, romanized: beygl; Polish: bajgiel [ˈbajɡʲɛl] ; also spelled beigel) is a bread roll originating in the Jewish communities of Poland. Bagels are traditionally made from yeasted wheat dough that is shaped by hand into a torus or ring, briefly boiled in water, and then baked. Skiing is the use of skis to glide on snow for basic transport, a recreational activity, or a competitive winter sport. Many types of competitive skiing events are recognized by the International Olympic Committee (IOC), and the International Ski and Snowboard Federation (FIS).", "faiss_indices": [68, 66, 205]}
{"image_path": "data/images/000000119641.jpg", "query": "Can you describe the scene?", "caption": "Many tourists riding on elephants in a river Elephants are the largest living land animals. Three living species are currently recognised: the African bush elephant (Loxodonta africana), the African forest elephant (L. Tourism is travel for pleasure, and the commercial activity of providing and supporting such travel. UN Tourism defines tourism more generally, in terms which go \"beyond the common perception of tourism as being limited to holiday activity only\", as people \"travelling to and staying in places outside their usual environment for not more than one consecutive year for leisure and not less than 24 hours, business and other purposes\". A river is a natural stream of fresh water that flows on land or inside caves towards another body of water at a lower elevation, such as an ocean, lake, or another river. A river may run dry before reaching the end of its course if it runs out of water, or only flow during certain seasons.", "faiss_indices": [32, 248, 106]}
{"image_path": "data/images/000000344059.jpg", "query": "What can be seen here?", "caption": "Two giraffes eat from a tall food post in their enclosure. The giraffe is a large African hoofed mammal belonging to the genus Giraffa. It is the tallest living terrestrial animal and the largest ruminant on Earth. Enclosure or inclosure is a term, used in English landownership, that refers to the appropriation of \"waste\" or \"common land\", enclosing it, and by doing so depriving commoners of their traditional rights of access and usage. Agreements to enclose land could be either through a formal or informal process.", "faiss_indices": [38, 272, 66]}
{"image_path": "data/images/000000503855.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A park with yellow umbrellas on the grass and onlookers in the background. A park is an area of natural, semi-natural or planted space set aside for human enjoyment and recreation or for the protection of wildlife or natural habitats. Urban parks are green spaces set aside for recreation inside towns and cities. Poaceae ( poh-AY-see-e(y)e), also called Gramineae ( grə-MIN-ee-e(y)e), is a large and nearly ubiquitous family of monocotyledonous flowering plants commonly known as grasses. It includes the cereal grasses, bamboos, the grasses of natural grassland and species cultivated in lawns and pasture. An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain.", "faiss_indices": [316, 111, 71]}
{"image_path": "data/images/000000376093.jpg", "query": "Tell me what's going on in the photo.", "caption": "A group of young people eat pizzas and drink from pitchers. In baseball, the pitcher is the player who throws (\"pitches\") the baseball from the pitcher's mound toward the catcher to begin each play, with the goal of retiring a batter, who attempts to either make contact with the pitched ball or draw a walk. In the numbering system used to record defensive plays, the pitcher is assigned the number 1. A group is a number of persons or things that are located, gathered, or classed together. Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [52, 278, 17]}
{"image_path": "data/images/000000406417.jpg", "query": "Provide a description of this image.", "caption": "Three boys dressed in jeans and ties pose. Tie has two principal meanings:\n\nTie (draw), a finish to a competition with identical results, particularly sports\nNecktie, a long piece of cloth worn around the neck or shoulders\nTie or TIE may also refer to: Jeans are a type of trousers made from denim or dungaree cloth. Often the term \"jeans\" refers to a particular style of trousers, called \"blue jeans\", with the addition of copper pocket rivets added by Jacob W. A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [107, 255, 170]}
{"image_path": "data/images/000000348012.jpg", "query": "Provide a description of this image.", "caption": "Scissors are resting on a roll of clear tape. Scissors are hand-operated shearing tools. A pair of scissors consists of a pair of blades pivoted so that the sharpened edges slide against each other when the handles (bows) opposite to the pivot are closed.", "faiss_indices": [265, 273, 13]}
{"image_path": "data/images/000000274219.jpg", "query": "What does this picture show?", "caption": "A man wearing a jacket and  a bow tie. Tie has two principal meanings:\n\nTie (draw), a finish to a competition with identical results, particularly sports\nNecktie, a long piece of cloth worn around the neck or shoulders\nTie or TIE may also refer to: A jacket is a garment for the upper body, usually extending below the hips. A jacket typically has sleeves and fastens in the front or slightly on the side. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father.", "faiss_indices": [13, 180, 87]}
{"image_path": "data/images/000000296969.jpg", "query": "Tell me what's going on in the photo.", "caption": "a group of giraffes standing around by some trees A group is a number of persons or things that are located, gathered, or classed together. The giraffe is a large African hoofed mammal belonging to the genus Giraffa. It is the tallest living terrestrial animal and the largest ruminant on Earth. In botany, a tree is a perennial plant with an elongated stem, or trunk, usually supporting branches and leaves. In some usages, the definition of a tree may be narrower, e.g., including only woody plants with secondary growth, only plants that are usable as lumber, or only plants above a specified height.", "faiss_indices": [272, 38, 144]}
{"image_path": "data/images/000000478420.jpg", "query": "Summarize the visual elements in this picture.", "caption": "two lady's wearing long dresses and carrying baskest Lady is a term for a woman who behaves in a polite way. Once used to describe only women of a high social class or status, the female counterpart of lord, now it may refer to any adult woman, as gentleman can be used for men. A dress (also known as a frock or a gown) is a one-piece outer garment that is worn on the torso, hangs down over the legs, and is primarily worn by women or girls. Dresses often consist of a bodice attached to a skirt.", "faiss_indices": [118, 199, 297]}
{"image_path": "data/images/000000312421.jpg", "query": "Tell me what's going on in the photo.", "caption": "Suitcase with stickers outside on table in city. A city is a human settlement of a substantial size. The term \"city\" has different meanings around the world and in some places the settlement can be very small. A suitcase is a form of baggage. It is a rectangular container with a handle and is typically used to carry one's clothes and other belongings while traveling. A sticker is a type of  label: a piece of printed paper, plastic, vinyl, or other material with temporary or permanent pressure sensitive adhesive on one side. It can be used for decoration or for functional purposes, depending on the situation.\nStickers can come in many different shapes and sizes and also vary widely in color and design.", "faiss_indices": [140, 242, 111]}
{"image_path": "data/images/000000080057.jpg", "query": "Tell me what's going on in the photo.", "caption": "A teddy bear sitting in front of toy wooden shapes. A shape is a graphical representation of an object's form or its external boundary, outline, or external surface. It is distinct from other object properties, such as color, texture, or material type.\nIn geometry, shape excludes information about the object's position, size, orientation and chirality.\nA figure is a representation including both shape and size (as in, e.g., figure of the Earth).\nA plane shape or plane figure is constrained to lie on a plane, in contrast to solid 3D shapes.\nA two-dimensional shape or two-dimensional figure (also: 2D shape or 2D figure) may lie on a more general curved surface (a two-dimensional space).", "faiss_indices": [239, 119, 9]}
{"image_path": "data/images/000000578489.jpg", "query": "Explain the contents of the image.", "caption": "Several children watch while a girl in a pink sweatshirt plays with a Wii remote while another person with a little girl on their lap snuggle in a chair in the background. A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. A sweatshirt is a long-sleeved pullover shirt or jacket fashioned out of thick, usually cotton, cloth material. Sweatshirts are almost exclusively casual attire and hence not as formal as some sweaters. A chair is a type of seat, typically designed for one person and consisting of one or more legs, a flat or slightly angled seat and a back-rest. It may be made of wood, metal, or synthetic materials, and may be padded or upholstered in various colors and fabrics.\nChairs vary in design. A girl is a young female human, usually a child or an adolescent. While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture.", "faiss_indices": [181, 226, 22]}
{"image_path": "data/images/000000137950.jpg", "query": "Explain the contents of the image.", "caption": "A plane flies through the sky above some trees. Plane most often refers to:\n\nAero- or airplane, a powered, fixed-wing aircraft\nPlane (geometry), a flat, 2-dimensional surface\nPlane (mathematics), generalizations of a geometrical plane\nPlane or planes may also refer to: The sky is an unobstructed view upward from the surface of the Earth. It includes the atmosphere and outer space. In botany, a tree is a perennial plant with an elongated stem, or trunk, usually supporting branches and leaves. In some usages, the definition of a tree may be narrower, e.g., including only woody plants with secondary growth, only plants that are usable as lumber, or only plants above a specified height.", "faiss_indices": [203, 16, 323]}
{"image_path": "data/images/000000294855.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A metal bucket with a bottle of booze sticking out of it. A bucket is typically a watertight, vertical cylinder or truncated cone or square, with an open top and a flat bottom that is attached to a semicircular carrying handle called the bail.\nA bucket is usually an open-top container. In contrast, a pail can have a top or lid and is a shipping container. A bottle is a narrow-necked container made of an impermeable material (such as glass, plastic or aluminium) in various shapes and sizes that stores and transports liquids. Its mouth, at the bottling line, can be sealed with an internal stopper, an external bottle cap, a closure, or induction sealing.", "faiss_indices": [103, 97, 291]}
{"image_path": "data/images/000000410496.jpg", "query": "What does this picture show?", "caption": "A tennis player competes with a large crowd watching. A crowd is as a group of people that have gathered for a common purpose or intent. Examples are a demonstration, a sports event, or a looting (classified in sociology as an acting crowd).", "faiss_indices": [235, 229, 226]}
{"image_path": "data/images/000000468925.jpg", "query": "Provide a description of this image.", "caption": "banana pieces placed on beacon and sausage on a white plate A beacon is an intentionally conspicuous device designed to attract attention to a specific location. A common example is the lighthouse, which draws attention to a fixed point that can be used to navigate around obstacles or into port. A sausage is a type of meat product usually made from ground meat—often pork, beef, or poultry—along with salt, spices and other flavourings. Other ingredients, such as grains or breadcrumbs, may be included as fillers or extenders.\nWhen used as an uncountable noun, the word sausage can refer to the loose sausage meat, which can be used loose, formed into patties, or stuffed into a casing.", "faiss_indices": [328, 45, 96]}
{"image_path": "data/images/000000068078.jpg", "query": "Summarize the visual elements in this picture.", "caption": "The dog was standing in the bathroom near the sink and toilet. A sink (also known as basin in the UK) is a bowl-shaped plumbing fixture for washing hands, dishwashing, and other purposes. Sinks have a tap (faucet) that supplies hot and cold water and may include a spray feature to be used for faster rinsing. A toilet is a piece of sanitary hardware that collects human waste (urine and feces) and sometimes toilet paper, usually for disposal. Flush toilets use water, while dry or non-flush toilets do not. A bathroom is a room in which people wash their bodies or parts thereof. It can contain one or more of the following plumbing fixtures: a shower, a bathtub, a bidet, and a sink (also known as a wash basin in the United Kingdom). The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers.", "faiss_indices": [306, 320, 270]}
{"image_path": "data/images/000000050896.jpg", "query": "What is the subject of this image?", "caption": "There is a big bowl of oranges on the counter. The orange, also called sweet orange to distinguish it from the bitter orange (Citrus × aurantium), is the fruit of a tree in the family Rutaceae. Botanically, this is the hybrid Citrus × sinensis, between the pomelo (Citrus maxima) and the mandarin orange (Citrus reticulata). A bowl is a typically round dish or container generally used for preparing, serving, storing, or consuming food. The interior of a bowl is characteristically shaped like a spherical cap, with the edges and the bottom, forming a seamless curve.", "faiss_indices": [139, 72, 76]}
{"image_path": "data/images/000000153510.jpg", "query": "Explain the contents of the image.", "caption": "A close shot of a unique looking plate of food. Food is any substance consumed by an organism for nutritional support. Food is usually of plant, animal, or fungal origin and contains essential nutrients such as carbohydrates, fats, proteins, vitamins, or minerals.", "faiss_indices": [59, 131, 66]}
{"image_path": "data/images/000000489764.jpg", "query": "What is the subject of this image?", "caption": "A woman and a man playing a video game in the living room A game is a structured type of play usually undertaken for entertainment or fun, and sometimes used as an educational tool. Many games are also considered to be work (such as professional players of spectator sports or video games) or art (such as games involving an artistic layout such as mahjong, solitaire, or some video games).\nGames have a wide range of occasions, reflecting both the generality of its concept and the variety of its play. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. In a building or a ship, a room is any enclosed space within a number of walls to which entry is possible only via a door or other dividing structure. The entrance connects it to either a passageway, another room, or the outdoors. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [226, 181, 330]}
{"image_path": "data/images/000000146155.jpg", "query": "What can be seen here?", "caption": "Two men, one holding a baby, enjoy some wine at a wine bar. In common terminology, a baby is the very young offspring of adult human beings, while infant (from the Latin word infans, meaning 'baby' or 'child') is a formal or specialised synonym. The terms may also be used to refer to juveniles of other organisms. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. Wine is an alcoholic drink made from fermented fruit. Yeast consumes the sugar in the fruit and converts it to ethanol and carbon dioxide, releasing heat in the process.", "faiss_indices": [244, 284, 155]}
{"image_path": "data/images/000000044260.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A collection of apples growing on a tree. In botany, a tree is a perennial plant with an elongated stem, or trunk, usually supporting branches and leaves. In some usages, the definition of a tree may be narrower, e.g., including only woody plants with secondary growth, only plants that are usable as lumber, or only plants above a specified height. An apple is a round, edible fruit produced by an apple tree (Malus spp.). Fruit trees of the orchard or domestic apple (Malus domestica), the most widely grown in the genus, are cultivated worldwide.", "faiss_indices": [126, 194, 221]}
{"image_path": "data/images/000000402774.jpg", "query": "Can you describe the scene?", "caption": "Lady walking on sidewalk in the rain with an umbrella over her head. An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain. Lady is a term for a woman who behaves in a polite way. Once used to describe only women of a high social class or status, the female counterpart of lord, now it may refer to any adult woman, as gentleman can be used for men. A head is the part of an organism which usually includes the ears, brain, forehead, cheeks, chin, eyes, nose, and mouth, each of which aid in various sensory functions such as sight, hearing, smell, and taste. Some very simple animals may not have a head, but many bilaterally symmetric forms do, regardless of size. A sidewalk (North American English),\n\n \npavement (British English, South African English), or footpath (Irish English, Indian English, Australian English, New Zealand English) is a path along the side of a road. Usually constructed of concrete, pavers, brick, stone, or asphalt, it is designed for pedestrians. Rain is a form of precipitation where water droplets that have condensed from atmospheric water vapor fall under gravity. Rain is a major component of the water cycle and is responsible for depositing most of the fresh water on the Earth.", "faiss_indices": [99, 111, 71]}
{"image_path": "data/images/000000508602.jpg", "query": "Can you describe the scene?", "caption": "The white bird is standing on the roof of a car. A car, or an automobile, is a motor vehicle with wheels. Most definitions of cars state that they run primarily on roads, seat one to eight people, have four wheels, and mainly transport people rather than cargo. Birds are a group of warm-blooded vertebrates constituting the class Aves, characterised by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton. Birds live worldwide and range in size from the 5.5 cm (2.2 in) bee hummingbird to the 2.8 m (9 ft 2 in) common ostrich. A roof (pl.: roofs or rooves) is the top covering of a building, including all materials and constructions necessary to support it on the walls of the building or on uprights, providing protection against rain, snow, sunlight, extremes of temperature, and wind. A roof is part of the building envelope.\nThe characteristics of a roof are dependent upon the purpose of the building that it covers, the available roofing materials and the local traditions of construction and wider concepts of architectural design and practice, and may also be governed by local or national legislation.", "faiss_indices": [184, 24, 114]}
{"image_path": "data/images/000000161781.jpg", "query": "What can be seen here?", "caption": "A woman in gear skiing down a snowy slope A gear or gearwheel is a rotating machine part typically used to transmit rotational motion and/or torque by means of a series of teeth that engage with compatible teeth of another gear or other part. The teeth can be integral saliences or cavities machined on the part, or separate pegs inserted into it. In mathematics, the slope or gradient of a line is a number that describes the direction of the line on a plane. Often denoted by the letter m, slope is calculated as the ratio of the vertical change to the horizontal change (\"rise over run\") between two distinct points on the line, giving the same number for any choice of points. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [322, 251, 132]}
{"image_path": "data/images/000000447314.jpg", "query": "Explain the contents of the image.", "caption": "A mother and child fly a kite in a grassy field, with a tower in the background. A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. A mother is the female parent of a child. A woman may be considered a mother by virtue of having given birth, by raising a child who may or may not be her biological offspring, or by supplying her ovum for fertilisation in the case of gestational surrogacy.\nA biological mother is the female genetic contributor to the creation of the infant, through sexual intercourse or egg donation. A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag forces. A kite consists of wings, tethers and anchors. A tower is a tall structure, taller than it is wide, often by a significant factor. Towers are distinguished from masts by their lack of guy-wires and are therefore, along with tall buildings, self-supporting structures.\nTowers are specifically distinguished from buildings in that they are built not to be habitable but to serve other functions using the height of the tower.", "faiss_indices": [26, 268, 209]}
{"image_path": "data/images/000000255912.jpg", "query": "What is the subject of this image?", "caption": "Meat sandwich on a roll with greens on a plate. A sandwich is a dish typically consisting variously of meat, cheese, sauces, and vegetables used as a filling between slices of bread, or placed atop a slice of bread; or, more generally, any dish in which bread serves as a container or wrapper for another food type, and allows it to be a finger food. The sandwich began as a portable, convenient food in the Western world, though over time it has become prevalent worldwide.\nThere has been social media debate over the precise definition of sandwich, specifically whether a hot dog or open sandwich can be categorized as such.", "faiss_indices": [59, 10, 102]}
{"image_path": "data/images/000000010764.jpg", "query": "What is happening in this image?", "caption": "A catcher in white uniform during a baseball game. Catcher is a position in baseball and softball. When a batter takes their turn to hit, the catcher crouches behind home plate, in front of the (home) umpire, and receives the ball from the pitcher. A uniform is a variety of costume worn by members of an organization while usually participating in that organization's activity. Modern uniforms are most often worn by armed forces and paramilitary organizations such as police, emergency services, security guards, in some workplaces and schools, and by inmates in prisons. A game is a structured type of play usually undertaken for entertainment or fun, and sometimes used as an educational tool. Many games are also considered to be work (such as professional players of spectator sports or video games) or art (such as games involving an artistic layout such as mahjong, solitaire, or some video games).\nGames have a wide range of occasions, reflecting both the generality of its concept and the variety of its play.", "faiss_indices": [82, 4, 113]}
{"image_path": "data/images/000000334555.jpg", "query": "What does this picture show?", "caption": "There is a cow in the middle of a busy road A road is a thoroughfare used primarily for movement of traffic. Roads differ from streets, whose primary use is local access. Cattle (Bos taurus) are large, domesticated, bovid ungulates widely kept as livestock. They are prominent modern members of the subfamily Bovinae and the most widespread species of the genus Bos.", "faiss_indices": [150, 200, 67]}
{"image_path": "data/images/000000414261.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A baby bear that is laying on a rock. That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe. Rock most often refers to:\n\nRock (geology), a naturally occurring solid aggregate of minerals or mineraloids\nRock music, a genre of popular music\nRock or Rocks may also refer to: Bears are carnivoran mammals of the family Ursidae (). They are classified as caniforms, or doglike carnivorans.", "faiss_indices": [119, 239, 155]}
{"image_path": "data/images/000000407574.jpg", "query": "What is happening in this image?", "caption": "Bunch of bananas hanging in an open air market stall. A banana is an elongated, edible fruit – botanically a berry – produced by several kinds of large treelike herbaceous flowering plants in the genus Musa. In some countries, cooking bananas are called plantains, distinguishing them from dessert bananas.", "faiss_indices": [45, 328, 194]}
{"image_path": "data/images/000000017905.jpg", "query": "Explain the contents of the image.", "caption": "A man standing next to a light and a sign. A sign is an object, quality, event, or entity whose presence or occurrence indicates the probable presence or occurrence of something else. A natural sign bears a causal relation to its object—for instance, thunder is a sign of storm, or medical symptoms a sign of disease. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. Light, visible light, or visible radiation is electromagnetic radiation that can be perceived by the human eye. Visible light spans the visible spectrum and is usually defined as having wavelengths in the range of 400–700 nanometres (nm), corresponding to frequencies of 750–420 terahertz.", "faiss_indices": [275, 51, 35]}
{"image_path": "data/images/000000317433.jpg", "query": "What does this picture show?", "caption": "A man behind farm equipment pulled by horses Equipment most commonly refers to a set of tools or other objects commonly used to achieve a particular objective. Different jobs require different kinds of equipment. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. The horse (Equus ferus caballus) is a domesticated, one-toed, hoofed mammal. It belongs to the taxonomic family Equidae and is one of two extant subspecies of Equus ferus.", "faiss_indices": [165, 241, 81]}
{"image_path": "data/images/000000135902.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A red and yellow train at station under a glass roof. A roof (pl.: roofs or rooves) is the top covering of a building, including all materials and constructions necessary to support it on the walls of the building or on uprights, providing protection against rain, snow, sunlight, extremes of temperature, and wind. A roof is part of the building envelope.\nThe characteristics of a roof are dependent upon the purpose of the building that it covers, the available roofing materials and the local traditions of construction and wider concepts of architectural design and practice, and may also be governed by local or national legislation. A train (from Old French trahiner, from Latin trahere, \"to pull, to draw\") is a series of connected vehicles that run along a railway track and transport people or freight. Trains are typically pulled or pushed by locomotives (often known simply as \"engines\"), though some are self-propelled, such as multiple units or railcars.", "faiss_indices": [313, 51, 162]}
{"image_path": "data/images/000000167353.jpg", "query": "Explain the contents of the image.", "caption": "The grandfather clock is many years old and worn. A clock or chronometer is a device that measures and displays time. The clock is one of the oldest human inventions, meeting the need to measure intervals of time shorter than the natural units such as the day, the lunar month, and the year.", "faiss_indices": [161, 14, 301]}
{"image_path": "data/images/000000112378.jpg", "query": "What is the subject of this image?", "caption": "a table covered with banansas and a coconut", "faiss_indices": [217, 328, 45]}
{"image_path": "data/images/000000013546.jpg", "query": "Can you describe the scene?", "caption": "A boy riding his skateboard on a ledge in a park. A skateboard is a type of sports equipment used for skateboarding. It is usually made of a specially designed 7–8-ply maple plywood deck and has polyurethane wheels attached to the underside by a pair of skateboarding trucks.\nThe skateboard moves by pushing with one foot while the other foot remains balanced on the board, or by pumping one's legs in structures such as a bowl or half pipe. A park is an area of natural, semi-natural or planted space set aside for human enjoyment and recreation or for the protection of wildlife or natural habitats. Urban parks are green spaces set aside for recreation inside towns and cities. A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [2, 22, 316]}
{"image_path": "data/images/000000474021.jpg", "query": "Provide a description of this image.", "caption": "A couple of guys playing on the nintendo wii at a gathering. The Wii ( WEE) is a home video game console developed and marketed by Nintendo. It was released on November 19, 2006, in North America, and in December 2006 for most other regions of the world.", "faiss_indices": [181, 226, 211]}
{"image_path": "data/images/000000159311.jpg", "query": "What can be seen here?", "caption": "A pair of zebra's leaning over eating grass in a field. Poaceae ( poh-AY-see-e(y)e), also called Gramineae ( grə-MIN-ee-e(y)e), is a large and nearly ubiquitous family of monocotyledonous flowering plants commonly known as grasses. It includes the cereal grasses, bamboos, the grasses of natural grassland and species cultivated in lawns and pasture. Zebras (US: , UK: ) (subgenus Hippotigris) are African equines with distinctive black-and-white striped coats. There are three living species: Grévy's zebra (Equus grevyi), the plains zebra (E.", "faiss_indices": [3, 33, 80]}
{"image_path": "data/images/000000530854.jpg", "query": "Tell me what's going on in the photo.", "caption": "Several different opened umbrellas all located near each other. An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain.", "faiss_indices": [71, 111, 130]}
{"image_path": "data/images/000000546626.jpg", "query": "Tell me what's going on in the photo.", "caption": "The cell phone is next to a pear, a mug, and a bottle of tea. A telephone, colloquially referred to as a phone, is a telecommunications device that enables two or more users to conduct a conversation when they are too far apart to be easily heard directly. A telephone converts sound, typically and most efficiently the human voice, into electronic signals that are transmitted via cables and other communication channels to another telephone which reproduces the sound to the receiving user. A bottle is a narrow-necked container made of an impermeable material (such as glass, plastic or aluminium) in various shapes and sizes that stores and transports liquids. Its mouth, at the bottling line, can be sealed with an internal stopper, an external bottle cap, a closure, or induction sealing. Tea is an aromatic beverage prepared by pouring hot or boiling water over cured or fresh leaves of Camellia sinensis, an evergreen shrub native to East Asia which probably originated in the borderlands of south-western China and northern Myanmar. Tea is also made, but rarely, from the leaves of Camellia taliensis. A mug is a type of cup, a drinking vessel usually intended for hot drinks such as: coffee, hot chocolate, or tea. Mugs usually have handles and hold a larger amount of fluid than other types of cups such as teacups or coffee cups. Pears are fruits produced and consumed around the world, growing on a tree and are harvested in late summer into mid-autumn. The pear tree and shrub are a species of genus Pyrus , in the family Rosaceae, bearing the pomaceous fruit of the same name.", "faiss_indices": [20, 231, 48]}
{"image_path": "data/images/000000176857.jpg", "query": "What is the subject of this image?", "caption": "A group of women siting around a cat as they pet it. In Modern English, they is a third-person pronoun relating to a grammatical subject. The cat (Felis catus), also referred to as the domestic cat or house cat, is a small domesticated carnivorous mammal. It is the only domesticated species of the family Felidae. A group is a number of persons or things that are located, gathered, or classed together. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [182, 192, 5]}
{"image_path": "data/images/000000223738.jpg", "query": "Describe everything visible in the image.", "caption": "People watching a player swing a baseball bat. Bats are flying mammals of the order Chiroptera (). With their forelimbs adapted as wings, they are the only mammals capable of true and sustained flight. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [113, 82, 4]}
{"image_path": "data/images/000000208208.jpg", "query": "What can be seen here?", "caption": "A view of mountains out of an airplane window. A window is an opening in a wall, door, roof, or vehicle that allows the exchange of light and may also allow the passage of sound and sometimes air. Modern windows are usually glazed or covered in some other transparent or translucent material, a sash set in a frame in the opening; the sash and frame are also referred to as a window. A mountain is an elevated portion of the Earth's crust, generally with steep sides that show significant exposed bedrock. Although definitions vary, a mountain may differ from a plateau in having a limited summit area, and is usually higher than a hill, typically rising at least 300 metres (980 ft) above the surrounding land.", "faiss_indices": [130, 203, 323]}
{"image_path": "data/images/000000414510.jpg", "query": "Explain the contents of the image.", "caption": "A man is talking on his phone next to a fallen bicycle. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A bicycle, also called a pedal cycle, bike, push-bike or cycle, is a human-powered or motor-assisted, pedal-driven, single-track vehicle, with two wheels attached to a frame, one behind the other. A bicycle rider is called a cyclist, or bicyclist.\nBicycles were introduced in the 19th century in Europe. A telephone, colloquially referred to as a phone, is a telecommunications device that enables two or more users to conduct a conversation when they are too far apart to be easily heard directly. A telephone converts sound, typically and most efficiently the human voice, into electronic signals that are transmitted via cables and other communication channels to another telephone which reproduces the sound to the receiving user.", "faiss_indices": [20, 286, 220]}
{"image_path": "data/images/000000092124.jpg", "query": "Summarize the visual elements in this picture.", "caption": "Bathroom with orange shower and mirror/cabinet curtains A bathroom is a room in which people wash their bodies or parts thereof. It can contain one or more of the following plumbing fixtures: a shower, a bathtub, a bidet, and a sink (also known as a wash basin in the United Kingdom). A curtain is a piece of cloth or other material intended to block or obscure light, air drafts, or (in the case of a shower curtain) water.\nCurtains are often hung on the inside of a building's windows to block the passage of light. For instance, at night to aid sleeping, or to stop light from escaping outside the building (stopping people outside from being able to see inside, often for privacy reasons).", "faiss_indices": [326, 306, 108]}
{"image_path": "data/images/000000008021.jpg", "query": "Summarize the visual elements in this picture.", "caption": "People watch a man delivering a lecture on a screen. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A lecture (from Latin: lectura 'reading') is an oral presentation intended to present information or teach people about a particular subject, for example by a university or college teacher. Lectures are used to convey critical information, history, background, theories, and equations. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [61, 128, 79]}
{"image_path": "data/images/000000384350.jpg", "query": "What does this picture show?", "caption": "A red and white plane sitting on a runway. Plane most often refers to:\n\nAero- or airplane, a powered, fixed-wing aircraft\nPlane (geometry), a flat, 2-dimensional surface\nPlane (mathematics), generalizations of a geometrical plane\nPlane or planes may also refer to: In aviation, a runway is an elongated, rectangular surface designed for the landing and takeoff of an aircraft. Runways may be a human-made surface (often asphalt, concrete, or a mixture of both) or a natural surface (grass, dirt, gravel, ice, sand or salt).", "faiss_indices": [277, 203, 16]}
{"image_path": "data/images/000000238013.jpg", "query": "What is happening in this image?", "caption": "A man is preparing to hit a tennis ball. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A ball is a round object (usually spherical, but sometimes ovoid) with several uses. It is used in ball games, where the play of the game follows the state of the ball as it is hit, kicked or thrown by players.", "faiss_indices": [235, 82, 225]}
{"image_path": "data/images/000000280918.jpg", "query": "Summarize the visual elements in this picture.", "caption": "Two ladies taking a turkey outside of an oven. Turkey, officially the Republic of Türkiye, is a country mainly located in Anatolia in West Asia, with a relatively small part called East Thrace in Southeast Europe. It borders the Black Sea to the north; Georgia, Armenia, Azerbaijan, and Iran to the east; Iraq, Syria, and the Mediterranean Sea to the south; and the Aegean Sea, Greece, and Bulgaria to the west. An oven is a tool that is used to expose materials to a hot environment. Ovens contain a hollow chamber and provide a means of heating the chamber in a controlled way. Lady is a term for a woman who behaves in a polite way. Once used to describe only women of a high social class or status, the female counterpart of lord, now it may refer to any adult woman, as gentleman can be used for men.", "faiss_indices": [93, 304, 10]}
{"image_path": "data/images/000000564133.jpg", "query": "Tell me what's going on in the photo.", "caption": "Pack of 6 elephants walking through the native brush. Elephants are the largest living land animals. Three living species are currently recognised: the African bush elephant (Loxodonta africana), the African forest elephant (L. A brush is a common tool with bristles, wire or other filaments. It generally consists of a handle or block to which filaments are affixed in either a parallel or perpendicular orientation, depending on the way the brush is to be gripped during use.", "faiss_indices": [32, 248, 38]}
{"image_path": "data/images/000000173183.jpg", "query": "What can be seen here?", "caption": "two street signs one is green and white the other brown and white", "faiss_indices": [275, 287, 249]}
{"image_path": "data/images/000000442463.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A child in a helmet and safety pads riding a skateboard. A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. A skateboard is a type of sports equipment used for skateboarding. It is usually made of a specially designed 7–8-ply maple plywood deck and has polyurethane wheels attached to the underside by a pair of skateboarding trucks.\nThe skateboard moves by pushing with one foot while the other foot remains balanced on the board, or by pumping one's legs in structures such as a bowl or half pipe. Pads (also called leg guards) are a type of protective equipment used in a number of sports and serve to protect the legs from the impact of a hard ball, puck, or other object of play travelling at high speed which could otherwise cause injuries to the lower legs. These are used by batters in the sport of cricket, catchers in the sports of baseball and fastpitch softball, and by goaltenders in sports such as ice hockey, ringette, bandy, rinkball, field hockey, rink hockey and box lacrosse.", "faiss_indices": [2, 258, 260]}
{"image_path": "data/images/000000303305.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A red and white bus on street next to trees. In botany, a tree is a perennial plant with an elongated stem, or trunk, usually supporting branches and leaves. In some usages, the definition of a tree may be narrower, e.g., including only woody plants with secondary growth, only plants that are usable as lumber, or only plants above a specified height. A bus (contracted from omnibus, with variants multibus, motorbus, autobus, etc.) is a motor vehicle that carries significantly more passengers than an average car or van, but fewer than the average rail transport. It is most commonly used in public transport, but is also in use for charter purposes, or through private ownership. A street is a public thoroughfare in a city, town or village, typically lined with buildings on one or both sides. Streets often include pavements (sidewalks), pedestrian crossings, and sometimes amenities like streetlights or benches.", "faiss_indices": [41, 134, 287]}
{"image_path": "data/images/000000511760.jpg", "query": "Explain the contents of the image.", "caption": "A man and a child flying a kite. A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag forces. A kite consists of wings, tethers and anchors.", "faiss_indices": [268, 26, 16]}
{"image_path": "data/images/000000367195.jpg", "query": "Tell me what's going on in the photo.", "caption": "A dog laying down on a fluffy carpet A carpet is a textile floor covering typically consisting of an upper layer of pile attached to a backing. The pile was traditionally made from wool, but since the 20th century synthetic fibres such as polypropylene, nylon, and polyester have often been used, as these fibres are less expensive than wool. The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers.", "faiss_indices": [186, 40, 182]}
{"image_path": "data/images/000000497628.jpg", "query": "What is happening in this image?", "caption": "A bed that has an old fashioned wooden frame. A frame is often a structural system that supports other components of a physical construction and/or steel frame that limits the construction's extent.\nFrame and FRAME may also refer to: That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe. A bed is a piece of furniture that is used as a place to sleep, rest, and relax.\nMost modern beds consist of a soft, cushioned mattress on a bed frame. The mattress rests either on a solid base, often wood slats, or a sprung base.", "faiss_indices": [175, 307, 252]}
{"image_path": "data/images/000000046872.jpg", "query": "Describe everything visible in the image.", "caption": "a man standing beside a large truck in a parking lot A truck or lorry is a motor vehicle designed to transport freight, carry specialized payloads, or perform other utilitarian work. Trucks vary greatly in size, power, and configuration, but the vast majority feature body-on-frame construction, with a cabin that is independent of the payload portion of the vehicle. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father.", "faiss_indices": [172, 62, 229]}
{"image_path": "data/images/000000562818.jpg", "query": "Can you describe the scene?", "caption": "a number of people riding skis on a snowy slope Skis are runners, attached to the user's feet, designed to glide over snow. Typically employed in pairs, skis are attached to ski boots with ski bindings, with either a free, lockable, or partially secured heel. In mathematics, the slope or gradient of a line is a number that describes the direction of the line on a plane. Often denoted by the letter m, slope is calculated as the ratio of the vertical change to the horizontal change (\"rise over run\") between two distinct points on the line, giving the same number for any choice of points. A number is a mathematical object used to count, measure, and label. The most basic examples are the natural numbers 1, 2, 3, 4, and so forth. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [322, 251, 132]}
{"image_path": "data/images/000000507235.jpg", "query": "Tell me what's going on in the photo.", "caption": "Two bowls of food with vegetables on top. Bowls, also known as lawn bowls or lawn bowling, is a sport in which players try to roll their ball (called a bowl) closest to a smaller ball (known as a \"jack\" or sometimes a \"kitty\"). The bowls are shaped (biased), so that they follow a curved path when being rolled. Top most commonly refers to:\n\nTop, a basic term of orientation, distinguished from bottom, front, back, and sides\nSpinning top, a ubiquitous traditional toy\nTop (clothing), clothing designed to be worn over the torso\nMountain top, a mountain peak located at some distance from the nearest point of higher elevation\nTop may also refer to: Vegetables are edible parts of plants that are consumed by humans or other animals as food. This original meaning is still commonly used, and is applied to plants collectively to refer to all edible plant matter, including flowers, fruits, stems, leaves, roots, and seeds. Food is any substance consumed by an organism for nutritional support. Food is usually of plant, animal, or fungal origin and contains essential nutrients such as carbohydrates, fats, proteins, vitamins, or minerals.", "faiss_indices": [72, 102, 253]}
{"image_path": "data/images/000000572678.jpg", "query": "Can you describe the scene?", "caption": "A white room with a large window and a glass dining table and white chairs. A window is an opening in a wall, door, roof, or vehicle that allows the exchange of light and may also allow the passage of sound and sometimes air. Modern windows are usually glazed or covered in some other transparent or translucent material, a sash set in a frame in the opening; the sash and frame are also referred to as a window. A chair is a type of seat, typically designed for one person and consisting of one or more legs, a flat or slightly angled seat and a back-rest. It may be made of wood, metal, or synthetic materials, and may be padded or upholstered in various colors and fabrics.\nChairs vary in design. In a building or a ship, a room is any enclosed space within a number of walls to which entry is possible only via a door or other dividing structure. The entrance connects it to either a passageway, another room, or the outdoors.", "faiss_indices": [330, 280, 130]}
{"image_path": "data/images/000000571804.jpg", "query": "Provide a description of this image.", "caption": "A porcelain tea and bathroom set is on display. Tea is an aromatic beverage prepared by pouring hot or boiling water over cured or fresh leaves of Camellia sinensis, an evergreen shrub native to East Asia which probably originated in the borderlands of south-western China and northern Myanmar. Tea is also made, but rarely, from the leaves of Camellia taliensis.", "faiss_indices": [306, 108, 270]}
{"image_path": "data/images/000000413552.jpg", "query": "Provide a description of this image.", "caption": "A woman holds a sick child who is getting her temperature taken. A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. Temperature is a physical quantity that quantitatively expresses the attribute of hotness or coldness. Temperature is measured with a thermometer. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [209, 85, 42]}
{"image_path": "data/images/000000394611.jpg", "query": "Can you describe the scene?", "caption": "Two tall giraffes graze on bushes in an open field. The giraffe is a large African hoofed mammal belonging to the genus Giraffa. It is the tallest living terrestrial animal and the largest ruminant on Earth. A shrub or bush is a small to medium-sized perennial woody plant. Unlike herbaceous plants, shrubs have persistent woody stems above the ground.", "faiss_indices": [272, 38, 65]}
{"image_path": "data/images/000000162581.jpg", "query": "Can you describe the scene?", "caption": "A man on the court with his tennis racket raised. A court is an institution, often a government entity, with the authority to adjudicate legal disputes between parties  and administer justice in civil, criminal, and administrative matters in accordance with the rule of law.\nCourts generally consist of judges or other judicial officers, and are usually established and dissolved through legislation enacted by a legislature. Courts may also be established by constitution or an equivalent constituting instrument.\nThe practical authority given to the court is known as its jurisdiction, which describes the court's power to decide certain kinds of questions, or petitions put to it. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father.", "faiss_indices": [235, 82, 225]}
{"image_path": "data/images/000000581615.jpg", "query": "Tell me what's going on in the photo.", "caption": "a urinal hanging on a wall in between two stalls A wall is a structure and a surface that defines an area; carries a load; provides security, shelter, or soundproofing; or serves a decorative purpose. There are various types of walls, including border barriers between countries, brick walls, defensive walls in fortifications, and retaining walls that hold back dirt, stone, water, or noise.", "faiss_indices": [270, 320, 306]}
{"image_path": "data/images/000000060932.jpg", "query": "Explain the contents of the image.", "caption": "A man in a suit that is standing in front of a group of people. A suit, also called a lounge suit, business suit, dress suit, or formal suit, is a set of clothes comprising a suit jacket and trousers of identical textiles generally worn with a collared dress shirt, necktie, and dress shoes. A skirt suit is similar, but with a matching skirt instead of trousers. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A group is a number of persons or things that are located, gathered, or classed together. That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [5, 229, 212]}
{"image_path": "data/images/000000024027.jpg", "query": "Can you describe the scene?", "caption": "a large kite that is being flown in the sky The sky is an unobstructed view upward from the surface of the Earth. It includes the atmosphere and outer space. That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe. A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag forces. A kite consists of wings, tethers and anchors.", "faiss_indices": [26, 268, 323]}
{"image_path": "data/images/000000547144.jpg", "query": "Can you describe the scene?", "caption": "A desk with several monitors under it and two computers and a laptop on top of the desk. A computer is a machine that can be programmed to automatically carry out sequences of arithmetic or logical operations (computation). Modern digital electronic computers can perform generic sets of operations known as programs, which enable computers to perform a wide range of tasks. Top most commonly refers to:\n\nTop, a basic term of orientation, distinguished from bottom, front, back, and sides\nSpinning top, a ubiquitous traditional toy\nTop (clothing), clothing designed to be worn over the torso\nMountain top, a mountain peak located at some distance from the nearest point of higher elevation\nTop may also refer to: A desk or bureau is a piece of furniture with a flat table-style work surface used in a school, office, home or the like for academic, professional or domestic activities such as reading, writing, or using equipment such as a computer. Desks often have one or more drawers, compartments, or pigeonholes to store items such as office supplies and papers. A laptop computer or notebook computer, also known as a laptop or notebook, is a small, portable personal computer (PC). Laptops typically have a clamshell form factor with a flat-panel screen on the inside of the upper lid and an alphanumeric keyboard and pointing device on the inside of the lower lid.", "faiss_indices": [233, 245, 92]}
{"image_path": "data/images/000000414170.jpg", "query": "Summarize the visual elements in this picture.", "caption": "Several skiers glide down a hilly landscape covered in snow. Snow consists of individual ice crystals that grow while suspended in the atmosphere—usually within clouds—and then fall, accumulating on the ground where they undergo further changes. It consists of frozen crystalline water throughout its life cycle, starting when, under suitable conditions, the ice crystals form in the atmosphere, increase to millimeter size, precipitate and accumulate on surfaces, then metamorphose in place, and ultimately melt, slide, or sublimate away.\nSnowstorms organize and develop by feeding on sources of atmospheric moisture and cold air. A landscape is the visible features of an area of land, its landforms, and how they integrate with natural or human-made features, often considered in terms of their aesthetic appeal. A landscape includes the physical elements of geophysically defined landforms such as mountains, hills, water bodies such as rivers, lakes, ponds and the sea, living elements of land cover including indigenous vegetation, human elements including different forms of land use, buildings, and structures, and transitory elements such as lighting and weather conditions. Skiing is the use of skis to glide on snow for basic transport, a recreational activity, or a competitive winter sport. Many types of competitive skiing events are recognized by the International Olympic Committee (IOC), and the International Ski and Snowboard Federation (FIS).", "faiss_indices": [322, 251, 132]}
{"image_path": "data/images/000000520077.jpg", "query": "Tell me what's going on in the photo.", "caption": "A stack of text and comic books on a table. A book is a structured presentation of recorded information, primarily verbal and graphical, through a medium. Originally physical, electronic books and audiobooks are now existent.", "faiss_indices": [321, 318, 280]}
{"image_path": "data/images/000000448810.jpg", "query": "Can you describe the scene?", "caption": "A street sign sitting on the side of a road. A road is a thoroughfare used primarily for movement of traffic. Roads differ from streets, whose primary use is local access. A sign is an object, quality, event, or entity whose presence or occurrence indicates the probable presence or occurrence of something else. A natural sign bears a causal relation to its object—for instance, thunder is a sign of storm, or medical symptoms a sign of disease.", "faiss_indices": [275, 249, 287]}
{"image_path": "data/images/000000463174.jpg", "query": "What is the subject of this image?", "caption": "a tennis player swinging a racket at a ball A ball is a round object (usually spherical, but sometimes ovoid) with several uses. It is used in ball games, where the play of the game follows the state of the ball as it is hit, kicked or thrown by players.", "faiss_indices": [235, 82, 113]}
{"image_path": "data/images/000000424551.jpg", "query": "What can be seen here?", "caption": "People climbing up the snowy mountain side on skis Skis are runners, attached to the user's feet, designed to glide over snow. Typically employed in pairs, skis are attached to ski boots with ski bindings, with either a free, lockable, or partially secured heel. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [132, 322, 251]}
{"image_path": "data/images/000000457559.jpg", "query": "Explain the contents of the image.", "caption": "A soccer player preparing to kick a soccer ball as an opposing player runs along side. A ball is a round object (usually spherical, but sometimes ovoid) with several uses. It is used in ball games, where the play of the game follows the state of the ball as it is hit, kicked or thrown by players.", "faiss_indices": [113, 82, 226]}
{"image_path": "data/images/000000397681.jpg", "query": "What does this picture show?", "caption": "A group of 20 small photos in a collage together, with each photo containing a carrot in it. The carrot (Daucus carota subsp. sativus) is a root vegetable, typically orange in colour, though heirloom variants including purple, black, red, white, and yellow cultivars exist, all of which are domesticated forms of the wild carrot, Daucus carota, native to Europe and Southwestern Asia. Collage (, from the French: coller, \"to glue\" or \"to stick together\") is a technique of art creation, primarily used in the visual arts, but in music too, by which art results from an assembly of different forms, thus creating a new whole. (Compare with pastiche, which is a \"pasting\" together.)   Collage may refer to the technique as a whole, or more specifically to a two-dimensional work, assembled from flat pieces on a flat substrate, whereas assemblage typically refers to a three-dimensional equivalent.\nA collage may sometimes include magazine and newspaper clippings, ribbons, paint, bits of colored or handmade papers, portions of other artwork or texts, photographs and other found objects, glued to a piece of paper or canvas. A photograph (also known as a photo, or more generically referred to as an image or picture) is an image created by light falling on a photosensitive surface, usually photographic film or an electronic image sensor. The process and practice of creating such images is called photography.\nMost photographs are now created using a smartphone or camera, which uses a lens to focus the scene's visible wavelengths of light into a reproduction of what the human eye would perceive. A photograph (also known as a photo, or more generically referred to as an image or picture) is an image created by light falling on a photosensitive surface, usually photographic film or an electronic image sensor. The process and practice of creating such images is called photography.\nMost photographs are now created using a smartphone or camera, which uses a lens to focus the scene's visible wavelengths of light into a reproduction of what the human eye would perceive. A group is a number of persons or things that are located, gathered, or classed together.", "faiss_indices": [30, 166, 189]}
{"image_path": "data/images/000000368684.jpg", "query": "Provide a description of this image.", "caption": "A laptop on a couch across from a television. Television (TV) is a telecommunication medium for transmitting moving images and sound. Additionally, the term can refer to a physical television set rather than the medium of transmission. A laptop computer or notebook computer, also known as a laptop or notebook, is a small, portable personal computer (PC). Laptops typically have a clamshell form factor with a flat-panel screen on the inside of the upper lid and an alphanumeric keyboard and pointing device on the inside of the lower lid. A couch, also known as a sofa, settee, chesterfield, or davenport, is a cushioned piece of furniture that can seat multiple people. It is commonly found in the form of a bench with upholstered armrests and is often fitted with springs and tailored cushion and pillows.", "faiss_indices": [233, 252, 9]}
{"image_path": "data/images/000000348881.jpg", "query": "Explain the contents of the image.", "caption": "A large white airplane and a person on a lot. An airplane (American English), or aeroplane (Commonwealth English), informally plane, is a fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller, or rocket engine. Airplanes come in a variety of sizes, shapes, and wing configurations. A person (pl.: people or persons, depending on context) is a being who has certain capacities or attributes such as reason, morality, consciousness or self-consciousness, and being a part of a culturally established form of social relations such as kinship, ownership of property, or legal responsibility. The defining features of personhood and, consequently, what makes a person count as a person, differ widely among cultures and contexts.\nIn addition to the question of personhood, of what makes a being count as a person to begin with, there are further questions about personal identity and self: both about what makes any particular person that particular person instead of another, and about what makes a person at one time the same person as they were or will be at another time despite any intervening changes.\nThe plural form \"people\" is often used to refer to an entire nation or ethnic group (as in \"a people\"), and this was the original meaning of the word; it subsequently acquired its", "faiss_indices": [16, 203, 184]}
{"image_path": "data/images/000000561366.jpg", "query": "Explain the contents of the image.", "caption": "There is a phone on top of a calculator Top most commonly refers to:\n\nTop, a basic term of orientation, distinguished from bottom, front, back, and sides\nSpinning top, a ubiquitous traditional toy\nTop (clothing), clothing designed to be worn over the torso\nMountain top, a mountain peak located at some distance from the nearest point of higher elevation\nTop may also refer to: An electronic calculator is typically a portable electronic device used to perform calculations, ranging from basic arithmetic to complex mathematics.\nThe first solid-state electronic calculator was created in the early 1960s. Pocket-sized devices became available in the 1970s, especially after the Intel 4004, the first microprocessor, was developed by Intel for the Japanese calculator company Busicom. A telephone, colloquially referred to as a phone, is a telecommunications device that enables two or more users to conduct a conversation when they are too far apart to be easily heard directly. A telephone converts sound, typically and most efficiently the human voice, into electronic signals that are transmitted via cables and other communication channels to another telephone which reproduces the sound to the receiving user.", "faiss_indices": [29, 20, 285]}
{"image_path": "data/images/000000226111.jpg", "query": "Explain the contents of the image.", "caption": "A street sign mounted to the side of a pole. A sign is an object, quality, event, or entity whose presence or occurrence indicates the probable presence or occurrence of something else. A natural sign bears a causal relation to its object—for instance, thunder is a sign of storm, or medical symptoms a sign of disease.", "faiss_indices": [275, 51, 287]}
{"image_path": "data/images/000000293804.jpg", "query": "Explain the contents of the image.", "caption": "A view of a fire place with a light on it. Light, visible light, or visible radiation is electromagnetic radiation that can be perceived by the human eye. Visible light spans the visible spectrum and is usually defined as having wavelengths in the range of 400–700 nanometres (nm), corresponding to frequencies of 750–420 terahertz.", "faiss_indices": [51, 215, 104]}
{"image_path": "data/images/000000116206.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A cutting board and knife, with chopped carrots, celery, and onion. A knife (pl.: knives; from Old Norse knifr 'knife, dirk') is a tool or weapon with a cutting edge or blade, usually attached to a handle or hilt. One of the earliest tools used by humanity, knives appeared at least 2.5 million years ago, as evidenced by the Oldowan tools. Celery (Apium graveolens Dulce Group or Apium graveolens var. dulce) is a cultivated plant belonging to the species Apium graveolens in the family Apiaceae that has been used as a vegetable since ancient times.\nThe original wild species has been selectively bred over centuries into three primary cultivar groups: stalk celery (Dulce Group), consumed for its fibrous edible stalks; leaf celery (Secalinum Group), grown for its aromatic leaves; and celeriac (Rapaceum Group), cultivated for its large, edible hypocotyl. An onion (Allium cepa L.Tooltip Carl Linnaeus, from Latin cepa), also known as the bulb onion or common onion, is a vegetable that is the most widely cultivated species of the genus Allium. The shallot is a botanical variety of the onion which was classified as a separate species until 2011. The carrot (Daucus carota subsp. sativus) is a root vegetable, typically orange in colour, though heirloom variants including purple, black, red, white, and yellow cultivars exist, all of which are domesticated forms of the wild carrot, Daucus carota, native to Europe and Southwestern Asia.", "faiss_indices": [142, 265, 110]}
{"image_path": "data/images/000000368038.jpg", "query": "What is the subject of this image?", "caption": "A row of train colors of various colors next to trees. In botany, a tree is a perennial plant with an elongated stem, or trunk, usually supporting branches and leaves. In some usages, the definition of a tree may be narrower, e.g., including only woody plants with secondary growth, only plants that are usable as lumber, or only plants above a specified height. Color (or colour in Commonwealth English; see spelling differences) is the visual perception based on the electromagnetic spectrum. Though color is not an inherent property of matter, color perception is related to an object's light absorption, emission, reflection and transmission.", "faiss_indices": [95, 144, 313]}
{"image_path": "data/images/000000034760.jpg", "query": "Describe everything visible in the image.", "caption": "A full view of a bathroom with sink and toilet in the back. The human back, also called the dorsum (pl.: dorsa), is the large posterior area of the human body, rising from the top of the buttocks to the back of the neck. It is the surface of the body opposite from the chest and the abdomen. A toilet is a piece of sanitary hardware that collects human waste (urine and feces) and sometimes toilet paper, usually for disposal. Flush toilets use water, while dry or non-flush toilets do not. A sink (also known as basin in the UK) is a bowl-shaped plumbing fixture for washing hands, dishwashing, and other purposes. Sinks have a tap (faucet) that supplies hot and cold water and may include a spray feature to be used for faster rinsing. A bathroom is a room in which people wash their bodies or parts thereof. It can contain one or more of the following plumbing fixtures: a shower, a bathtub, a bidet, and a sink (also known as a wash basin in the United Kingdom).", "faiss_indices": [306, 320, 270]}
{"image_path": "data/images/000000242060.jpg", "query": "What does this picture show?", "caption": "a plate filled with some little tiny cakes Cake is a flour confection usually made from flour, sugar, and other ingredients and is usually baked. In their oldest forms, cakes were modifications of bread, but cakes now cover a wide range of preparations that can be simple or elaborate and which share features with desserts such as pastries, meringues, custards, and pies.\nThe most common ingredients include flour, sugar, eggs, fat (such as butter, oil, or margarine), a liquid, and a leavening agent, such as baking soda or baking powder.", "faiss_indices": [27, 210, 96]}
{"image_path": "data/images/000000502347.jpg", "query": "What can be seen here?", "caption": "The airplane is flying low over the town. An airplane (American English), or aeroplane (Commonwealth English), informally plane, is a fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller, or rocket engine. Airplanes come in a variety of sizes, shapes, and wing configurations. A town is a type of a human settlement, generally larger than a village but smaller than a city.\nThe criteria for distinguishing a town vary globally, often depending on factors such as population size, economic character, administrative status, or historical significance. In some regions, towns are formally defined by legal charters or government designations, while in others, the term is used informally.", "faiss_indices": [16, 203, 26]}
{"image_path": "data/images/000000153229.jpg", "query": "Can you describe the scene?", "caption": "The group of young men is playing a game of Frisbee. A game is a structured type of play usually undertaken for entertainment or fun, and sometimes used as an educational tool. Many games are also considered to be work (such as professional players of spectator sports or video games) or art (such as games involving an artistic layout such as mahjong, solitaire, or some video games).\nGames have a wide range of occasions, reflecting both the generality of its concept and the variety of its play. A group is a number of persons or things that are located, gathered, or classed together. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A  frisbee (pronounced  FRIZ-bee), also called a flying disc or simply a disc, is a gliding toy or sporting item generally made of injection-molded plastic and roughly 20 to 25 centimetres (8 to 10 in) in diameter with a pronounced lip. It is used recreationally and competitively for throwing and catching, as in flying disc games.", "faiss_indices": [230, 226, 86]}
{"image_path": "data/images/000000304817.jpg", "query": "What is the subject of this image?", "caption": "Snowboard stuck in a thick collection of trees. In botany, a tree is a perennial plant with an elongated stem, or trunk, usually supporting branches and leaves. In some usages, the definition of a tree may be narrower, e.g., including only woody plants with secondary growth, only plants that are usable as lumber, or only plants above a specified height. Snowboards are boards where the user places both feet, usually secured, to the same board. The board itself is wider than most skis, with the ability to glide on snow.", "faiss_indices": [187, 122, 144]}
{"image_path": "data/images/000000349837.jpg", "query": "What can be seen here?", "caption": "Several refrigerators are lined up by a wall. A wall is a structure and a surface that defines an area; carries a load; provides security, shelter, or soundproofing; or serves a decorative purpose. There are various types of walls, including border barriers between countries, brick walls, defensive walls in fortifications, and retaining walls that hold back dirt, stone, water, or noise. A refrigerator, commonly shortened to fridge, is a commercial and home appliance consisting of a thermally insulated compartment and a heat pump (mechanical, electronic or chemical) that transfers heat from its inside to its external environment so that its inside is cooled to a temperature below the room temperature. Refrigeration is an essential food storage technique around the world.", "faiss_indices": [83, 237, 329]}
{"image_path": "data/images/000000500565.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A woman holding a little boy who is brushing his teeth. A tooth (pl.: teeth) is a hard, calcified structure found in the jaws (or mouths) of many vertebrates and used to break down food. Some animals, particularly carnivores and omnivores, also use teeth to help with capturing or wounding prey, tearing food, for defensive purposes, to intimidate other animals often including their own, or to carry prey or their young. A boy is a young male human. The term is commonly used for a child or an adolescent. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [296, 98, 143]}
{"image_path": "data/images/000000092177.jpg", "query": "What does this picture show?", "caption": "The birthday cake has dark and light blue frosting. Cake is a flour confection usually made from flour, sugar, and other ingredients and is usually baked. In their oldest forms, cakes were modifications of bread, but cakes now cover a wide range of preparations that can be simple or elaborate and which share features with desserts such as pastries, meringues, custards, and pies.\nThe most common ingredients include flour, sugar, eggs, fat (such as butter, oil, or margarine), a liquid, and a leavening agent, such as baking soda or baking powder.", "faiss_indices": [210, 27, 69]}
{"image_path": "data/images/000000467315.jpg", "query": "Tell me what's going on in the photo.", "caption": "a glass vase with some flowers inside of it A vase ( or ) is an open container. It can be made from a number of materials, such as ceramics, glass, non-rusting metals, such as aluminium, brass, bronze, or stainless steel. Flowers, also known as blooms and blossoms, are the reproductive structures of flowering plants (angiosperms). Typically, they are structured in four circular levels, called whorls, around the end of a stalk.", "faiss_indices": [109, 282, 101]}
{"image_path": "data/images/000000377113.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A boy wearing  skating boats in water Water is an inorganic compound with the chemical formula H2O. It is a transparent, tasteless, odorless, and nearly colorless chemical substance. A boat is a watercraft of a large range of types and sizes, but generally smaller than a ship, which is distinguished by its larger size or capacity, its shape, or its ability to carry boats.\nSmall boats are typically used on inland waterways such as rivers and lakes, or in protected coastal areas. However, some boats (such as whaleboats) were intended for offshore use. A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [151, 250, 2]}
{"image_path": "data/images/000000439994.jpg", "query": "Explain the contents of the image.", "caption": "a catcher and umpire standing on a baseball field Catcher is a position in baseball and softball. When a batter takes their turn to hit, the catcher crouches behind home plate, in front of the (home) umpire, and receives the ball from the pitcher. An umpire is an official in a variety of sports and competition, responsible for enforcing the rules of the sport, including sportsmanship decisions such as ejection.\nThe term derives from the Old French nonper, non, 'not' and per, 'equal': 'one who is requested to act as arbiter of a dispute between two people' (as evidenced in cricket, where dismissal decisions can only be made on appeal). Noumper shows up around 1350 before undergoing a linguistic shift known as false splitting.", "faiss_indices": [82, 4, 113]}
{"image_path": "data/images/000000382009.jpg", "query": "Explain the contents of the image.", "caption": "A man holds a tennis racket in his hand and looks up. A hand is a prehensile, multi-fingered appendage located at the end of the forearm or forelimb of primates such as humans, chimpanzees, monkeys, and lemurs. A few other vertebrates such as the koala (which has two opposable thumbs on each \"hand\" and fingerprints extremely similar to human fingerprints) are often described as having \"hands\" instead of paws on their front limbs. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father.", "faiss_indices": [235, 82, 299]}
{"image_path": "data/images/000000234807.jpg", "query": "What can be seen here?", "caption": "Horses are standing in a field outside of a crumbling castle. A castle is a type of fortified structure built during the Middle Ages predominantly by the nobility or royalty and by military orders. Scholars usually consider a castle to be the private fortified residence of a lord or noble. The horse (Equus ferus caballus) is a domesticated, one-toed, hoofed mammal. It belongs to the taxonomic family Equidae and is one of two extant subspecies of Equus ferus.", "faiss_indices": [241, 81, 116]}
{"image_path": "data/images/000000340451.jpg", "query": "What does this picture show?", "caption": "a person sitting on a bench wearing some boots and yellow jacket A person (pl.: people or persons, depending on context) is a being who has certain capacities or attributes such as reason, morality, consciousness or self-consciousness, and being a part of a culturally established form of social relations such as kinship, ownership of property, or legal responsibility. The defining features of personhood and, consequently, what makes a person count as a person, differ widely among cultures and contexts.\nIn addition to the question of personhood, of what makes a being count as a person to begin with, there are further questions about personal identity and self: both about what makes any particular person that particular person instead of another, and about what makes a person at one time the same person as they were or will be at another time despite any intervening changes.\nThe plural form \"people\" is often used to refer to an entire nation or ethnic group (as in \"a people\"), and this was the original meaning of the word; it subsequently acquired its A jacket is a garment for the upper body, usually extending below the hips. A jacket typically has sleeves and fastens in the front or slightly on the side. A boot is a type of footwear. Most boots mainly cover the foot and the ankle, while some also cover some part of the lower calf.", "faiss_indices": [78, 87, 185]}
{"image_path": "data/images/000000234526.jpg", "query": "What can be seen here?", "caption": "two children are feeding a giraffe and trees A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. In botany, a tree is a perennial plant with an elongated stem, or trunk, usually supporting branches and leaves. In some usages, the definition of a tree may be narrower, e.g., including only woody plants with secondary growth, only plants that are usable as lumber, or only plants above a specified height. The giraffe is a large African hoofed mammal belonging to the genus Giraffa. It is the tallest living terrestrial animal and the largest ruminant on Earth.", "faiss_indices": [272, 38, 171]}
{"image_path": "data/images/000000386210.jpg", "query": "Tell me what's going on in the photo.", "caption": "A store window with a tray of grass and vegetables A window is an opening in a wall, door, roof, or vehicle that allows the exchange of light and may also allow the passage of sound and sometimes air. Modern windows are usually glazed or covered in some other transparent or translucent material, a sash set in a frame in the opening; the sash and frame are also referred to as a window. Vegetables are edible parts of plants that are consumed by humans or other animals as food. This original meaning is still commonly used, and is applied to plants collectively to refer to all edible plant matter, including flowers, fruits, stems, leaves, roots, and seeds. Poaceae ( poh-AY-see-e(y)e), also called Gramineae ( grə-MIN-ee-e(y)e), is a large and nearly ubiquitous family of monocotyledonous flowering plants commonly known as grasses. It includes the cereal grasses, bamboos, the grasses of natural grassland and species cultivated in lawns and pasture. A tray is a shallow platform designed for the carrying of items. It can be fashioned from numerous materials, including silver, brass, sheet iron, paperboard, wood, melamine, and molded pulp.", "faiss_indices": [130, 319, 89]}
{"image_path": "data/images/000000565989.jpg", "query": "What is the subject of this image?", "caption": "A large building with statues at the top of it . A statue is a free-standing sculpture in which the realistic, full-length figures of persons or animals are carved or cast in a durable material such as wood, metal or stone. Typical statues are life-sized or close to life-size. Top most commonly refers to:\n\nTop, a basic term of orientation, distinguished from bottom, front, back, and sides\nSpinning top, a ubiquitous traditional toy\nTop (clothing), clothing designed to be worn over the torso\nMountain top, a mountain peak located at some distance from the nearest point of higher elevation\nTop may also refer to: A building or edifice is an enclosed structure with a roof, walls and often windows, usually standing permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for numerous factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, prestige, and aesthetic reasons.", "faiss_indices": [292, 257, 162]}
{"image_path": "data/images/000000214703.jpg", "query": "Provide a description of this image.", "caption": "Two people lying on belly on surfboards close to each other, in large watery expanse. A surfboard is a narrow plank used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [53, 207, 75]}
{"image_path": "data/images/000000089045.jpg", "query": "What is the subject of this image?", "caption": "A grand piano in a formal residential living room A piano is a keyboard instrument that produces sound when its keys are depressed, activating an action mechanism where hammers strike strings. Modern pianos have a row of 88 black and white keys, tuned to a chromatic scale in equal temperament. In a building or a ship, a room is any enclosed space within a number of walls to which entry is possible only via a door or other dividing structure. The entrance connects it to either a passageway, another room, or the outdoors.", "faiss_indices": [305, 330, 329]}
{"image_path": "data/images/000000209972.jpg", "query": "What does this picture show?", "caption": "A sail boat stuck in the sand on the beach A beach is a landform alongside a body of water which consists of loose particles. The particles composing a beach are typically made from rock, such as sand, gravel, shingle, pebbles, etc., or biological sources, such as mollusc shells or coralline algae. Sand is a granular material composed of finely divided mineral particles. Sand has various compositions but is usually defined by its grain size. A boat is a watercraft of a large range of types and sizes, but generally smaller than a ship, which is distinguished by its larger size or capacity, its shape, or its ability to carry boats.\nSmall boats are typically used on inland waterways such as rivers and lakes, or in protected coastal areas. However, some boats (such as whaleboats) were intended for offshore use.", "faiss_indices": [250, 151, 214]}
{"image_path": "data/images/000000168593.jpg", "query": "What does this picture show?", "caption": "There are two refrigerators in this dirty, rundown kitchen. A kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment. A modern middle-class residential kitchen is typically equipped with a stove, a sink with hot and cold running water, a refrigerator, and worktops and kitchen cabinets arranged according to a modular design. A refrigerator, commonly shortened to fridge, is a commercial and home appliance consisting of a thermally insulated compartment and a heat pump (mechanical, electronic or chemical) that transfers heat from its inside to its external environment so that its inside is cooled to a temperature below the room temperature. Refrigeration is an essential food storage technique around the world.", "faiss_indices": [83, 237, 329]}
{"image_path": "data/images/000000000139.jpg", "query": "What does this picture show?", "caption": "A living area with a television and a table Television (TV) is a telecommunication medium for transmitting moving images and sound. Additionally, the term can refer to a physical television set rather than the medium of transmission. Area is the measure of a region's size on a surface. The area of a plane region or plane area refers to the area of a shape or planar lamina, while surface area refers to the area of an open surface or the boundary of a three-dimensional object.", "faiss_indices": [128, 79, 329]}
{"image_path": "data/images/000000344621.jpg", "query": "What is happening in this image?", "caption": "The living room is clean and is ready to be used. In a building or a ship, a room is any enclosed space within a number of walls to which entry is possible only via a door or other dividing structure. The entrance connects it to either a passageway, another room, or the outdoors.", "faiss_indices": [329, 330, 257]}
{"image_path": "data/images/000000226883.jpg", "query": "Summarize the visual elements in this picture.", "caption": "An animal grazing on a lush field of green grass. Poaceae ( poh-AY-see-e(y)e), also called Gramineae ( grə-MIN-ee-e(y)e), is a large and nearly ubiquitous family of monocotyledonous flowering plants commonly known as grasses. It includes the cereal grasses, bamboos, the grasses of natural grassland and species cultivated in lawns and pasture. Animals are multicellular, eukaryotic organisms in the biological kingdom Animalia (). With few exceptions, animals consume organic material, breathe oxygen, have myocytes and are able to move, can reproduce sexually, and grow from a hollow sphere of cells, the blastula, during embryonic development.", "faiss_indices": [298, 50, 23]}
{"image_path": "data/images/000000394275.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A blue bus driving down a street past a park. A bus (contracted from omnibus, with variants multibus, motorbus, autobus, etc.) is a motor vehicle that carries significantly more passengers than an average car or van, but fewer than the average rail transport. It is most commonly used in public transport, but is also in use for charter purposes, or through private ownership. A street is a public thoroughfare in a city, town or village, typically lined with buildings on one or both sides. Streets often include pavements (sidewalks), pedestrian crossings, and sometimes amenities like streetlights or benches. A park is an area of natural, semi-natural or planted space set aside for human enjoyment and recreation or for the protection of wildlife or natural habitats. Urban parks are green spaces set aside for recreation inside towns and cities.", "faiss_indices": [134, 41, 287]}
{"image_path": "data/images/000000041635.jpg", "query": "Explain the contents of the image.", "caption": "Three cows standing on a grass field under a cloudy sky. The sky is an unobstructed view upward from the surface of the Earth. It includes the atmosphere and outer space. Cattle (Bos taurus) are large, domesticated, bovid ungulates widely kept as livestock. They are prominent modern members of the subfamily Bovinae and the most widespread species of the genus Bos.", "faiss_indices": [200, 67, 169]}
{"image_path": "data/images/000000292236.jpg", "query": "Explain the contents of the image.", "caption": "A couple of men standing next to train tracks. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father.", "faiss_indices": [313, 247, 295]}
{"image_path": "data/images/000000341921.jpg", "query": "Tell me what's going on in the photo.", "caption": "A child sits on a bench at a playground. A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. A playground, playpark, or play area is a place designed to provide an environment for children that facilitates play, typically outdoors. While a playground is usually designed for children, some are designed for other age groups, or people with disabilities.", "faiss_indices": [22, 85, 42]}
{"image_path": "data/images/000000032285.jpg", "query": "Tell me what's going on in the photo.", "caption": "You can see into part of a bathroom with the linen closet on the outside. In Modern English, the word \"you\" is the second-person pronoun. It is grammatically plural, and was historically used only for the dative case, but in most modern dialects is used for all cases and numbers. A closet (especially in North American English usage) is an enclosed space, with a door, used for storage, particularly that of clothes. Fitted closets are built into the walls of the house so that they take up no apparent space in the room. A bathroom is a room in which people wash their bodies or parts thereof. It can contain one or more of the following plumbing fixtures: a shower, a bathtub, a bidet, and a sink (also known as a wash basin in the United Kingdom).", "faiss_indices": [100, 306, 326]}
{"image_path": "data/images/000000293200.jpg", "query": "Provide a description of this image.", "caption": "a group of people with kites in their hands. A hand is a prehensile, multi-fingered appendage located at the end of the forearm or forelimb of primates such as humans, chimpanzees, monkeys, and lemurs. A few other vertebrates such as the koala (which has two opposable thumbs on each \"hand\" and fingerprints extremely similar to human fingerprints) are often described as having \"hands\" instead of paws on their front limbs. A group is a number of persons or things that are located, gathered, or classed together. A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag forces. A kite consists of wings, tethers and anchors. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [268, 26, 5]}
{"image_path": "data/images/000000356505.jpg", "query": "Describe everything visible in the image.", "caption": "A woman riding a surfboard on a wave. In physics, mathematics, engineering, and related fields, a wave is a propagating dynamic disturbance (change from equilibrium) of one or more quantities. Periodic waves oscillate repeatedly about an equilibrium (resting) value at some frequency. A surfboard is a narrow plank used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [207, 53, 167]}
{"image_path": "data/images/000000081061.jpg", "query": "What does this picture show?", "caption": "a chair,couch and suitcase sitting by the road A suitcase is a form of baggage. It is a rectangular container with a handle and is typically used to carry one's clothes and other belongings while traveling. A road is a thoroughfare used primarily for movement of traffic. Roads differ from streets, whose primary use is local access. A couch, also known as a sofa, settee, chesterfield, or davenport, is a cushioned piece of furniture that can seat multiple people. It is commonly found in the form of a bench with upholstered armrests and is often fitted with springs and tailored cushion and pillows. A chair is a type of seat, typically designed for one person and consisting of one or more legs, a flat or slightly angled seat and a back-rest. It may be made of wood, metal, or synthetic materials, and may be padded or upholstered in various colors and fabrics.\nChairs vary in design.", "faiss_indices": [195, 259, 252]}
{"image_path": "data/images/000000442661.jpg", "query": "Explain the contents of the image.", "caption": "A tall giraffe sitting next to a window. A window is an opening in a wall, door, roof, or vehicle that allows the exchange of light and may also allow the passage of sound and sometimes air. Modern windows are usually glazed or covered in some other transparent or translucent material, a sash set in a frame in the opening; the sash and frame are also referred to as a window. The giraffe is a large African hoofed mammal belonging to the genus Giraffa. It is the tallest living terrestrial animal and the largest ruminant on Earth.", "faiss_indices": [272, 38, 292]}
{"image_path": "data/images/000000482275.jpg", "query": "What is happening in this image?", "caption": "A couple of people standing cutting a cake. Cake is a flour confection usually made from flour, sugar, and other ingredients and is usually baked. In their oldest forms, cakes were modifications of bread, but cakes now cover a wide range of preparations that can be simple or elaborate and which share features with desserts such as pastries, meringues, custards, and pies.\nThe most common ingredients include flour, sugar, eggs, fat (such as butter, oil, or margarine), a liquid, and a leavening agent, such as baking soda or baking powder. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [27, 210, 265]}
{"image_path": "data/images/000000087875.jpg", "query": "What is happening in this image?", "caption": "Their is a hadron and their  in this lot, In particle physics, a hadron is a composite subatomic particle made of two or more quarks held together by the strong nuclear force. Pronounced  , the name is derived from Ancient Greek  ἁδρός (hadrós) 'stout, thick'. In Modern English, they is a third-person pronoun relating to a grammatical subject.", "faiss_indices": [269, 243, 64]}
{"image_path": "data/images/000000523100.jpg", "query": "What is the subject of this image?", "caption": "Person canning oranges showing a large bowl of fruit wedges. A bowl is a typically round dish or container generally used for preparing, serving, storing, or consuming food. The interior of a bowl is characteristically shaped like a spherical cap, with the edges and the bottom, forming a seamless curve. A person (pl.: people or persons, depending on context) is a being who has certain capacities or attributes such as reason, morality, consciousness or self-consciousness, and being a part of a culturally established form of social relations such as kinship, ownership of property, or legal responsibility. The defining features of personhood and, consequently, what makes a person count as a person, differ widely among cultures and contexts.\nIn addition to the question of personhood, of what makes a being count as a person to begin with, there are further questions about personal identity and self: both about what makes any particular person that particular person instead of another, and about what makes a person at one time the same person as they were or will be at another time despite any intervening changes.\nThe plural form \"people\" is often used to refer to an entire nation or ethnic group (as in \"a people\"), and this was the original meaning of the word; it subsequently acquired its A wedge is a triangular shaped tool, a portable inclined plane, and one of the six simple machines. It can be used to separate two objects or portions of an object, lift up an object, or hold an object in place. The orange, also called sweet orange to distinguish it from the bitter orange (Citrus × aurantium), is the fruit of a tree in the family Rutaceae. Botanically, this is the hybrid Citrus × sinensis, between the pomelo (Citrus maxima) and the mandarin orange (Citrus reticulata).", "faiss_indices": [194, 139, 213]}
{"image_path": "data/images/000000034873.jpg", "query": "What can be seen here?", "caption": "a black counter a sink and a table and two chairs", "faiss_indices": [188, 256, 329]}
{"image_path": "data/images/000000511321.jpg", "query": "Provide a description of this image.", "caption": "Scenic boats daily travel the Thames in England. England is a country that is part of the United Kingdom. It is located on the island of Great Britain, of which it covers about 62%, and more than 100 smaller adjacent islands. The River Thames (  TEMZ), known alternatively in parts as the River Isis, is a river that flows through southern England including London. At 215 miles (346 km), it is the longest river entirely in England and the second-longest in the United Kingdom, after the River Severn.\nThe river rises at Thames Head in Gloucestershire and flows into the North Sea near Tilbury, Essex and Gravesend, Kent, via the Thames Estuary. A boat is a watercraft of a large range of types and sizes, but generally smaller than a ship, which is distinguished by its larger size or capacity, its shape, or its ability to carry boats.\nSmall boats are typically used on inland waterways such as rivers and lakes, or in protected coastal areas. However, some boats (such as whaleboats) were intended for offshore use.", "faiss_indices": [204, 250, 151]}
{"image_path": "data/images/000000215644.jpg", "query": "What does this picture show?", "caption": "A picture of an unfinished back splash in the kitchen with a microwave and other small kitchen appliances. Microwave is a form of electromagnetic radiation with wavelengths shorter than other radio waves but longer than infrared waves. Its wavelength ranges from about one meter to one millimeter, corresponding to frequencies between 300 MHz and 300 GHz, broadly construed. An image or picture is a visual representation. An image can be two-dimensional, such as a drawing, painting, or photograph, or three-dimensional, such as a carving or sculpture. A kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment. A modern middle-class residential kitchen is typically equipped with a stove, a sink with hot and cold running water, a refrigerator, and worktops and kitchen cabinets arranged according to a modular design.", "faiss_indices": [329, 273, 188]}
{"image_path": "data/images/000000066706.jpg", "query": "Tell me what's going on in the photo.", "caption": "A plate topped with banana slice covered pan cakes. Cake is a flour confection usually made from flour, sugar, and other ingredients and is usually baked. In their oldest forms, cakes were modifications of bread, but cakes now cover a wide range of preparations that can be simple or elaborate and which share features with desserts such as pastries, meringues, custards, and pies.\nThe most common ingredients include flour, sugar, eggs, fat (such as butter, oil, or margarine), a liquid, and a leavening agent, such as baking soda or baking powder.", "faiss_indices": [210, 27, 96]}
{"image_path": "data/images/000000438774.jpg", "query": "What is happening in this image?", "caption": "a small party of people eats some pizza on a table Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples. A party is a gathering of people who have been invited by a host for the purposes of socializing, conversation, recreation, or as part of a festival or other commemoration or celebration of a special occasion. A party will often feature food and beverages, and often conversation, music, dancing, or other forms of entertainment. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [52, 278, 211]}
{"image_path": "data/images/000000120420.jpg", "query": "What can be seen here?", "caption": "A man in a green shirt is taking a picture with his cell phone. An image or picture is a visual representation. An image can be two-dimensional, such as a drawing, painting, or photograph, or three-dimensional, such as a carving or sculpture. A shirt is a cloth garment for the upper body (from the neck to the waist).\nOriginally an undergarment worn exclusively by men, it has become, in American English, a catch-all term for a broad variety of upper-body garments and undergarments. In British English, a shirt is more specifically a garment with a collar, sleeves with cuffs, and a full vertical opening with buttons or snaps (North Americans would call that a \"dress shirt\", a specific type of collared shirt). A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A telephone, colloquially referred to as a phone, is a telecommunications device that enables two or more users to conduct a conversation when they are too far apart to be easily heard directly. A telephone converts sound, typically and most efficiently the human voice, into electronic signals that are transmitted via cables and other communication channels to another telephone which reproduces the sound to the receiving user.", "faiss_indices": [30, 166, 94]}
{"image_path": "data/images/000000244750.jpg", "query": "What is happening in this image?", "caption": "A man sitting at a table with wine glasses lined up in front of him. Glasses, also known as eyeglasses (American English), spectacles (Commonwealth English), or colloquially as specs, are vision eyewear with clear or tinted lenses mounted in a frame that holds them in front of a person's eyes, typically utilizing a bridge over the nose and hinged arms, known as temples or temple pieces, that rest over the ears for support.\nGlasses are typically used for vision correction, such as with reading glasses and glasses used for nearsightedness; however, without the specialized lenses, they are sometimes used for cosmetic purposes. \nSafety glasses are eye protection, a form of personal protective equipment (PPE) that are worn by workers around their eyes for protection. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father.", "faiss_indices": [244, 281, 284]}
{"image_path": "data/images/000000481480.jpg", "query": "Provide a description of this image.", "caption": "A couple of men racing horses next to each other. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. The horse (Equus ferus caballus) is a domesticated, one-toed, hoofed mammal. It belongs to the taxonomic family Equidae and is one of two extant subspecies of Equus ferus.", "faiss_indices": [165, 241, 81]}
{"image_path": "data/images/000000046497.jpg", "query": "Can you describe the scene?", "caption": "LITTLE GIRLS ARE ON THE EDGE OF A BOAT A girl is a young female human, usually a child or an adolescent. While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture. A boat is a watercraft of a large range of types and sizes, but generally smaller than a ship, which is distinguished by its larger size or capacity, its shape, or its ability to carry boats.\nSmall boats are typically used on inland waterways such as rivers and lakes, or in protected coastal areas. However, some boats (such as whaleboats) were intended for offshore use.", "faiss_indices": [250, 151, 222]}
{"image_path": "data/images/000000263796.jpg", "query": "Tell me what's going on in the photo.", "caption": "an extremely nasty toilet in front of pipes and cable A toilet is a piece of sanitary hardware that collects human waste (urine and feces) and sometimes toilet paper, usually for disposal. Flush toilets use water, while dry or non-flush toilets do not.", "faiss_indices": [320, 306, 270]}
{"image_path": "data/images/000000448365.jpg", "query": "What is the subject of this image?", "caption": "A young boy is performing tricks on a skateboard. A skateboard is a type of sports equipment used for skateboarding. It is usually made of a specially designed 7–8-ply maple plywood deck and has polyurethane wheels attached to the underside by a pair of skateboarding trucks.\nThe skateboard moves by pushing with one foot while the other foot remains balanced on the board, or by pumping one's legs in structures such as a bowl or half pipe. A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [2, 255, 170]}
{"image_path": "data/images/000000311518.jpg", "query": "What is happening in this image?", "caption": "A small green boat in a pond outside an office building. A pond is a small, still, land-based body of water formed by pooling inside a depression, either naturally or artificially. A pond is smaller than a lake and there are no official criteria distinguishing the two, although defining a pond to be less than 5 hectares (12 acres) in area, less than 5 metres (16 ft) in depth and with less than 30% of its area covered by emergent vegetation helps in distinguishing the ecology of ponds from those of lakes and wetlands.: 460  \nPonds can be created by a wide variety of natural processes (e.g. A boat is a watercraft of a large range of types and sizes, but generally smaller than a ship, which is distinguished by its larger size or capacity, its shape, or its ability to carry boats.\nSmall boats are typically used on inland waterways such as rivers and lakes, or in protected coastal areas. However, some boats (such as whaleboats) were intended for offshore use. A building or edifice is an enclosed structure with a roof, walls and often windows, usually standing permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for numerous factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, prestige, and aesthetic reasons.", "faiss_indices": [151, 250, 214]}
{"image_path": "data/images/000000377814.jpg", "query": "What is happening in this image?", "caption": "A dozen doughnuts sits in a doughnut box and two are chocolate, three are glazed and one is a raised pink iced. Pink is a pale tint of red, the color of the pink flower. It was first used as a color name in the late 17th century. A box (plural: boxes) is a container with rigid sides used for the storage or transportation of its contents. Most boxes have flat, parallel, rectangular sides (typically rectangular prisms). A doughnut or donut () is a type of pastry made from leavened fried dough.: 275  It is popular in many countries and is prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors. Doughnut is the traditional spelling, while donut is the simplified version; the terms are used interchangeably.\nDoughnuts are usually deep fried from a flour dough, but other types of batters can also be used.", "faiss_indices": [254, 314, 210]}
{"image_path": "data/images/000000041888.jpg", "query": "Tell me what's going on in the photo.", "caption": "three strange looking birds walking on the grass Birds are a group of warm-blooded vertebrates constituting the class Aves, characterised by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton. Birds live worldwide and range in size from the 5.5 cm (2.2 in) bee hummingbird to the 2.8 m (9 ft 2 in) common ostrich. Poaceae ( poh-AY-see-e(y)e), also called Gramineae ( grə-MIN-ee-e(y)e), is a large and nearly ubiquitous family of monocotyledonous flowering plants commonly known as grasses. It includes the cereal grasses, bamboos, the grasses of natural grassland and species cultivated in lawns and pasture.", "faiss_indices": [184, 24, 90]}
{"image_path": "data/images/000000248616.jpg", "query": "What is the subject of this image?", "caption": "Three images of the same man hitting a tennis ball An image or picture is a visual representation. An image can be two-dimensional, such as a drawing, painting, or photograph, or three-dimensional, such as a carving or sculpture. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A ball is a round object (usually spherical, but sometimes ovoid) with several uses. It is used in ball games, where the play of the game follows the state of the ball as it is hit, kicked or thrown by players.", "faiss_indices": [235, 82, 225]}
{"image_path": "data/images/000000085157.jpg", "query": "Describe everything visible in the image.", "caption": "A group of people enjoying a meat at a restaurant. A restaurant is an establishment that prepares and serves food and drinks to customers. Meals are generally served and eaten on the premises, but many restaurants also offer take-out and food delivery services. A group is a number of persons or things that are located, gathered, or classed together. Meat is animal tissue, often muscle, that is eaten as food. Humans have hunted and farmed other animals for meat since prehistory. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [131, 206, 59]}
{"image_path": "data/images/000000080153.jpg", "query": "Explain the contents of the image.", "caption": "A man on snow skis with his dog. Skis are runners, attached to the user's feet, designed to glide over snow. Typically employed in pairs, skis are attached to ski boots with ski bindings, with either a free, lockable, or partially secured heel. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers.", "faiss_indices": [251, 322, 132]}
{"image_path": "data/images/000000350405.jpg", "query": "What does this picture show?", "caption": "A man riding a snowboard down a ski slope. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. In mathematics, the slope or gradient of a line is a number that describes the direction of the line on a plane. Often denoted by the letter m, slope is calculated as the ratio of the vertical change to the horizontal change (\"rise over run\") between two distinct points on the line, giving the same number for any choice of points. Snowboards are boards where the user places both feet, usually secured, to the same board. The board itself is wider than most skis, with the ability to glide on snow.", "faiss_indices": [187, 122, 251]}
{"image_path": "data/images/000000432468.jpg", "query": "What is happening in this image?", "caption": "The brown cat is lying on a luggage bag. A bag, also known regionally as a sack, is a common tool in the form of a floppy container, typically made of cloth, leather, bamboo, paper, or plastic. The use of bags predates recorded history, with the earliest bags being lengths of animal skin, cotton, or woven plant fibers, folded up at the edges and secured in that shape with strings of the same material. The cat (Felis catus), also referred to as the domestic cat or house cat, is a small domesticated carnivorous mammal. It is the only domesticated species of the family Felidae.", "faiss_indices": [192, 182, 140]}
{"image_path": "data/images/000000349152.jpg", "query": "Provide a description of this image.", "caption": "Krispy Kreme donuts fill up a long table. A doughnut or donut () is a type of pastry made from leavened fried dough.: 275  It is popular in many countries and is prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors. Doughnut is the traditional spelling, while donut is the simplified version; the terms are used interchangeably.\nDoughnuts are usually deep fried from a flour dough, but other types of batters can also be used.", "faiss_indices": [314, 254, 96]}
{"image_path": "data/images/000000563281.jpg", "query": "What does this picture show?", "caption": "A small child holding a toothbrush stands in front of colorful chicken decorations. A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. A toothbrush is a special type of brush used to clean the teeth, gums, and tongue. It consists of a head of tightly clustered bristles, atop of which toothpaste can be applied, mounted on a handle which facilitates the cleaning of hard-to-reach areas of the mouth.", "faiss_indices": [143, 98, 296]}
{"image_path": "data/images/000000364557.jpg", "query": "What can be seen here?", "caption": "After a long day surfing, this couple walks down the shoreline. A coast (coastline, shoreline, seashore) is the land next to the sea or the line that forms the boundary between the land and the ocean or a lake. Coasts are influenced by the topography of the surrounding landscape and by aquatic erosion, such as that caused by waves. Surfing is a surface water sport in which an individual, a surfer (or two in tandem surfing), uses a board to ride on the forward section, or face, of a moving wave of water, which usually carries the surfer towards the shore. Waves suitable for surfing are primarily found on ocean shores, but can also be found as standing waves in the open ocean, in lakes, in rivers in the form of a tidal bore, or wave pools.\nSurfing includes all forms of wave-riding using a board, regardless of the stance.", "faiss_indices": [207, 53, 279]}
{"image_path": "data/images/000000529966.jpg", "query": "What does this picture show?", "caption": "Two bowls of oranges are sitting on a metal surface. Bowls, also known as lawn bowls or lawn bowling, is a sport in which players try to roll their ball (called a bowl) closest to a smaller ball (known as a \"jack\" or sometimes a \"kitty\"). The bowls are shaped (biased), so that they follow a curved path when being rolled. A surface, as the term is most generally used, is the outermost or uppermost layer of a physical object or space. It is the portion or region of the object that can first be perceived by an observer using the senses of sight and touch, and is the portion with which other materials first interact. The orange, also called sweet orange to distinguish it from the bitter orange (Citrus × aurantium), is the fruit of a tree in the family Rutaceae. Botanically, this is the hybrid Citrus × sinensis, between the pomelo (Citrus maxima) and the mandarin orange (Citrus reticulata).", "faiss_indices": [72, 263, 86]}
{"image_path": "data/images/000000090108.jpg", "query": "What is happening in this image?", "caption": "A white bathroom sink sitting under a bathroom window. A sink (also known as basin in the UK) is a bowl-shaped plumbing fixture for washing hands, dishwashing, and other purposes. Sinks have a tap (faucet) that supplies hot and cold water and may include a spray feature to be used for faster rinsing. A window is an opening in a wall, door, roof, or vehicle that allows the exchange of light and may also allow the passage of sound and sometimes air. Modern windows are usually glazed or covered in some other transparent or translucent material, a sash set in a frame in the opening; the sash and frame are also referred to as a window.", "faiss_indices": [256, 188, 306]}
{"image_path": "data/images/000000273712.jpg", "query": "What can be seen here?", "caption": "A large red fridge is sitting on the red carpet. A carpet is a textile floor covering typically consisting of an upper layer of pile attached to a backing. The pile was traditionally made from wool, but since the 20th century synthetic fibres such as polypropylene, nylon, and polyester have often been used, as these fibres are less expensive than wool. A refrigerator, commonly shortened to fridge, is a commercial and home appliance consisting of a thermally insulated compartment and a heat pump (mechanical, electronic or chemical) that transfers heat from its inside to its external environment so that its inside is cooled to a temperature below the room temperature. Refrigeration is an essential food storage technique around the world.", "faiss_indices": [237, 83, 186]}
{"image_path": "data/images/000000322211.jpg", "query": "Can you describe the scene?", "caption": "A BOX OF DOUGHNUTS JUST SHORT OF A DOZEN A doughnut or donut () is a type of pastry made from leavened fried dough.: 275  It is popular in many countries and is prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors. Doughnut is the traditional spelling, while donut is the simplified version; the terms are used interchangeably.\nDoughnuts are usually deep fried from a flour dough, but other types of batters can also be used. A box (plural: boxes) is a container with rigid sides used for the storage or transportation of its contents. Most boxes have flat, parallel, rectangular sides (typically rectangular prisms). A dozen (commonly abbreviated doz or dz) is a grouping of twelve.\nThe dozen may be one of the earliest primitive integer groupings, perhaps because there are approximately a dozen cycles of the Moon, or months, in a cycle of the Sun, or year. Twelve is convenient because it has a maximal number of divisors among the numbers up to its double, a property only true of 1, 2, 6, 12, 60, 360, and 2520.\nThe use of twelve as a base number, known as the duodecimal system (also as dozenal), originated in Mesopotamia (see also sexagesimal).", "faiss_indices": [254, 314, 324]}
{"image_path": "data/images/000000462756.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A grey motorcycle on dirt road next to a building. A road is a thoroughfare used primarily for movement of traffic. Roads differ from streets, whose primary use is local access. A building or edifice is an enclosed structure with a roof, walls and often windows, usually standing permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for numerous factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, prestige, and aesthetic reasons. A motorcycle (motorbike, bike; uni (if one-wheeled); trike (if three-wheeled); quad (if four-wheeled)) is a lightweight private 1-to-2 passenger personal motor vehicle steered by a handlebar from a saddle-style seat.\nMotorcycle designs vary greatly to suit a range of different purposes: long-distance travel, commuting, cruising, sport (including racing), and off-road riding. Motorcycling is riding a motorcycle and being involved in other related social activities such as joining a motorcycle club and attending motorcycle rallies.\nThe 1885 Daimler Reitwagen made by Gottlieb Daimler and Wilhelm Maybach in Germany was the first internal combustion, petroleum-fueled motorcycle.", "faiss_indices": [39, 63, 99]}
{"image_path": "data/images/000000130613.jpg", "query": "Provide a description of this image.", "caption": "Three fish and vegetables on a silver tray. A tray is a shallow platform designed for the carrying of items. It can be fashioned from numerous materials, including silver, brass, sheet iron, paperboard, wood, melamine, and molded pulp. Vegetables are edible parts of plants that are consumed by humans or other animals as food. This original meaning is still commonly used, and is applied to plants collectively to refer to all edible plant matter, including flowers, fruits, stems, leaves, roots, and seeds. A fish (pl.: fish or fishes) is an aquatic, anamniotic, gill-bearing vertebrate animal with swimming fins and a hard skull, but lacking limbs with digits. Fish can be grouped into the more basal jawless fish and the more common jawed fish, the latter including all living cartilaginous and bony fish, as well as the extinct placoderms and acanthodians.", "faiss_indices": [312, 319, 89]}
{"image_path": "data/images/000000562197.jpg", "query": "Explain the contents of the image.", "caption": "Three pictures of plates with salads, including beans, fish and vegetables. Vegetables are edible parts of plants that are consumed by humans or other animals as food. This original meaning is still commonly used, and is applied to plants collectively to refer to all edible plant matter, including flowers, fruits, stems, leaves, roots, and seeds. A fish (pl.: fish or fishes) is an aquatic, anamniotic, gill-bearing vertebrate animal with swimming fins and a hard skull, but lacking limbs with digits. Fish can be grouped into the more basal jawless fish and the more common jawed fish, the latter including all living cartilaginous and bony fish, as well as the extinct placoderms and acanthodians. An image or picture is a visual representation. An image can be two-dimensional, such as a drawing, painting, or photograph, or three-dimensional, such as a carving or sculpture. A bean is the seed of some plants in the legume family (Fabaceae) used as a vegetable for human consumption or animal feed. The seeds are often preserved through drying (a pulse), but fresh beans are also sold. A salad is a dish consisting of mixed ingredients, frequently vegetables. They are typically served chilled or at room temperature, though some can be served warm.", "faiss_indices": [102, 205, 17]}
{"image_path": "data/images/000000527784.jpg", "query": "What does this picture show?", "caption": "Two plates that have food on a counter. That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe. Food is any substance consumed by an organism for nutritional support. Food is usually of plant, animal, or fungal origin and contains essential nutrients such as carbohydrates, fats, proteins, vitamins, or minerals.", "faiss_indices": [131, 59, 205]}
{"image_path": "data/images/000000383289.jpg", "query": "Describe everything visible in the image.", "caption": "a security officer sitting on a fence while talking on a cell phone and holding onto a segway A Segway is a two-wheeled, self-balancing personal transporter device invented by Dean Kamen. The name is a registered trademark of Segway Inc. An officer is a person who has a position of authority in a hierarchical organization. The term derives from Old French oficier \"officer, official\" (early 14c., Modern French officier), from Medieval Latin officiarius \"an officer,\" from Latin officium \"a service, a duty\" the late Latin from officiarius, meaning \"official.\" A fence is a structure that encloses an area, typically outdoors, and is usually constructed from posts that are connected by boards, wire, rails or netting. A fence differs from a wall in not having a solid foundation along its whole length.\nAlternatives to fencing include a ditch (sometimes filled with water, forming a moat). A telephone, colloquially referred to as a phone, is a telecommunications device that enables two or more users to conduct a conversation when they are too far apart to be easily heard directly. A telephone converts sound, typically and most efficiently the human voice, into electronic signals that are transmitted via cables and other communication channels to another telephone which reproduces the sound to the receiving user.", "faiss_indices": [325, 20, 218]}
{"image_path": "data/images/000000262048.jpg", "query": "Tell me what's going on in the photo.", "caption": "A woman in a bikini laying under a red umbrella. A bikini is a two-piece swimsuit primarily worn by women that features one piece on top that covers the breasts, and a second piece on the bottom: the front covering the pelvis but usually exposing the navel, and the back generally covering the intergluteal cleft and some or all of the buttocks. The size of the top and bottom can vary, from bikinis that offer full coverage of the breasts, pelvis, and buttocks, to more revealing designs with a thong or G-string bottom that covers only the mons pubis, but exposes the buttocks, and a top that covers only the areolae. An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [0, 31, 71]}
{"image_path": "data/images/000000376322.jpg", "query": "What can be seen here?", "caption": "A long table full of people on both sides. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [245, 5, 212]}
{"image_path": "data/images/000000166642.jpg", "query": "Summarize the visual elements in this picture.", "caption": "An elephant standing on top of a rocky hillside. Elephants are the largest living land animals. Three living species are currently recognised: the African bush elephant (Loxodonta africana), the African forest elephant (L. Top most commonly refers to:\n\nTop, a basic term of orientation, distinguished from bottom, front, back, and sides\nSpinning top, a ubiquitous traditional toy\nTop (clothing), clothing designed to be worn over the torso\nMountain top, a mountain peak located at some distance from the nearest point of higher elevation\nTop may also refer to:", "faiss_indices": [248, 32, 1]}
{"image_path": "data/images/000000479126.jpg", "query": "Tell me what's going on in the photo.", "caption": "Two girls are smoking cigarettes while one is playing on the laptop. A laptop computer or notebook computer, also known as a laptop or notebook, is a small, portable personal computer (PC). Laptops typically have a clamshell form factor with a flat-panel screen on the inside of the upper lid and an alphanumeric keyboard and pointing device on the inside of the lower lid. A girl is a young female human, usually a child or an adolescent. While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture. A cigarette is a narrow cylinder containing a combustible material, typically tobacco, that is rolled into thin paper for smoking. The cigarette is ignited at one end, causing it to smolder; the resulting smoke is orally inhaled via the opposite end.", "faiss_indices": [311, 233, 74]}
{"image_path": "data/images/000000293794.jpg", "query": "Tell me what's going on in the photo.", "caption": "A man looking over a full stand of bananas. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A banana is an elongated, edible fruit – botanically a berry – produced by several kinds of large treelike herbaceous flowering plants in the genus Musa. In some countries, cooking bananas are called plantains, distinguishing them from dessert bananas.", "faiss_indices": [45, 328, 194]}
{"image_path": "data/images/000000425925.jpg", "query": "What can be seen here?", "caption": "City street with focal view to building with maroon steeple and clocks under a standing platform. A street is a public thoroughfare in a city, town or village, typically lined with buildings on one or both sides. Streets often include pavements (sidewalks), pedestrian crossings, and sometimes amenities like streetlights or benches. In architecture, a steeple is a tall tower on a building, topped by a spire and often incorporating a belfry and other components. Steeples are very common on Christian churches and cathedrals and the use of the term generally connotes a religious structure.", "faiss_indices": [208, 162, 249]}
{"image_path": "data/images/000000401446.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A woman in a dress has a handbag and is holding an umbrella. A dress (also known as a frock or a gown) is a one-piece outer garment that is worn on the torso, hangs down over the legs, and is primarily worn by women or girls. Dresses often consist of a bodice attached to a skirt. An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain. A handbag, commonly known as a purse in North American English, is a handled medium-to-large bag used to carry personal items. It has also been called a pocketbook in parts of the U.S. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [299, 111, 71]}
{"image_path": "data/images/000000220584.jpg", "query": "What is happening in this image?", "caption": "A man in wetsuit and a surfboard in the waves. A wetsuit is a garment worn to provide thermal protection while wet. It is usually made of foamed neoprene, and is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports and other activities in or on the water. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A surfboard is a narrow plank used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave. Waves most often refers to:\n\nPlural form of wave,  a propagating dynamic disturbance (change from equilibrium) of one or more quantities.\nWaves may also refer to:", "faiss_indices": [207, 53, 31]}
{"image_path": "data/images/000000351559.jpg", "query": "Provide a description of this image.", "caption": "A green stop light with a tall building lighted up in the background at night. Night, or nighttime, is the period of darkness when the Sun is below the horizon. Sunlight illuminates one side of the Earth, leaving the other in darkness. Light, visible light, or visible radiation is electromagnetic radiation that can be perceived by the human eye. Visible light spans the visible spectrum and is usually defined as having wavelengths in the range of 400–700 nanometres (nm), corresponding to frequencies of 750–420 terahertz. A building or edifice is an enclosed structure with a roof, walls and often windows, usually standing permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for numerous factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, prestige, and aesthetic reasons.", "faiss_indices": [257, 51, 112]}
{"image_path": "data/images/000000486104.jpg", "query": "Can you describe the scene?", "caption": "A baseball game is in action as a batter swings. A game is a structured type of play usually undertaken for entertainment or fun, and sometimes used as an educational tool. Many games are also considered to be work (such as professional players of spectator sports or video games) or art (such as games involving an artistic layout such as mahjong, solitaire, or some video games).\nGames have a wide range of occasions, reflecting both the generality of its concept and the variety of its play.", "faiss_indices": [113, 4, 82]}
{"image_path": "data/images/000000554735.jpg", "query": "What can be seen here?", "caption": "A hand reaches out to grab a piece of pizza Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples. A hand is a prehensile, multi-fingered appendage located at the end of the forearm or forelimb of primates such as humans, chimpanzees, monkeys, and lemurs. A few other vertebrates such as the koala (which has two opposable thumbs on each \"hand\" and fingerprints extremely similar to human fingerprints) are often described as having \"hands\" instead of paws on their front limbs.", "faiss_indices": [278, 52, 131]}
{"image_path": "data/images/000000533536.jpg", "query": "Can you describe the scene?", "caption": "A cat looking up at the telivision that has something interesting on it. Television (TV) is a telecommunication medium for transmitting moving images and sound. Additionally, the term can refer to a physical television set rather than the medium of transmission. The cat (Felis catus), also referred to as the domestic cat or house cat, is a small domesticated carnivorous mammal. It is the only domesticated species of the family Felidae. That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe.", "faiss_indices": [182, 192, 51]}
{"image_path": "data/images/000000503755.jpg", "query": "What is happening in this image?", "caption": "A tennis player is playing in a match. A match is a tool for starting a fire. Typically, matches are made of small wooden sticks or stiff paper.", "faiss_indices": [235, 82, 290]}
{"image_path": "data/images/000000171611.jpg", "query": "What is happening in this image?", "caption": "A man and a dog fishing on a boat in a lake with two boats in the background. The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers. A boat is a watercraft of a large range of types and sizes, but generally smaller than a ship, which is distinguished by its larger size or capacity, its shape, or its ability to carry boats.\nSmall boats are typically used on inland waterways such as rivers and lakes, or in protected coastal areas. However, some boats (such as whaleboats) were intended for offshore use. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A boat is a watercraft of a large range of types and sizes, but generally smaller than a ship, which is distinguished by its larger size or capacity, its shape, or its ability to carry boats.\nSmall boats are typically used on inland waterways such as rivers and lakes, or in protected coastal areas. However, some boats (such as whaleboats) were intended for offshore use. A lake is often a naturally occurring, relatively large and fixed body of water on or near the Earth's surface. It is localized in a basin or interconnected basins surrounded by dry land.", "faiss_indices": [151, 250, 312]}
{"image_path": "data/images/000000499031.jpg", "query": "Can you describe the scene?", "caption": "A group of two women and an older woman between them. A group is a number of persons or things that are located, gathered, or classed together. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause. Them or THEM, a third-person singular or plural accusative personal pronoun, may refer to: A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [5, 303, 183]}
{"image_path": "data/images/000000384616.jpg", "query": "Tell me what's going on in the photo.", "caption": "A red fire hydrant sitting on the side of a dirt road. A road is a thoroughfare used primarily for movement of traffic. Roads differ from streets, whose primary use is local access. A hydrant is an outlet from a fluid main often consisting of an upright pipe with a valve attached, from which fluid (e.g. water or fuel) can be tapped.\nDepending on the fluid involved, the term may refer to:\n\nFire hydrant for firefighting water supply\nFlushing hydrant for cleaning water mains\nHydrant network systems used to transport aviation fuel from an oil depot to an airport, to fuel aircraft\nSnowmaking hydrants, which use water and air\nStandpipe (street), a type of domestic or neighbourhood hydrant for dispensing water when supply is interrupted or absent", "faiss_indices": [11, 320, 99]}
{"image_path": "data/images/000000303893.jpg", "query": "What is the subject of this image?", "caption": "A girl in a floral dress sitting next to a boy in a blue shirt eating food. Food is any substance consumed by an organism for nutritional support. Food is usually of plant, animal, or fungal origin and contains essential nutrients such as carbohydrates, fats, proteins, vitamins, or minerals. A shirt is a cloth garment for the upper body (from the neck to the waist).\nOriginally an undergarment worn exclusively by men, it has become, in American English, a catch-all term for a broad variety of upper-body garments and undergarments. In British English, a shirt is more specifically a garment with a collar, sleeves with cuffs, and a full vertical opening with buttons or snaps (North Americans would call that a \"dress shirt\", a specific type of collared shirt). A dress (also known as a frock or a gown) is a one-piece outer garment that is worn on the torso, hangs down over the legs, and is primarily worn by women or girls. Dresses often consist of a bodice attached to a skirt. A girl is a young female human, usually a child or an adolescent. While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture. A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [205, 17, 131]}
{"image_path": "data/images/000000067896.jpg", "query": "What does this picture show?", "caption": "A clock displays a time for the public to see. In public relations and communication science, publics are groups of individual people, and the public (a.k.a. the general public) is the totality of such groupings. Time is the continuous progression of existence that occurs in an apparently irreversible succession from the past, through the present, and into the future. It is a component quantity of various measurements used to sequence events, to compare the duration of events (or the intervals between them), and to quantify rates of change of quantities in material reality or in the conscious experience. A clock or chronometer is a device that measures and displays time. The clock is one of the oldest human inventions, meeting the need to measure intervals of time shorter than the natural units such as the day, the lunar month, and the year.", "faiss_indices": [14, 161, 51]}
{"image_path": "data/images/000000209613.jpg", "query": "Tell me what's going on in the photo.", "caption": "A group of sheep in a field with three dogs close by. A group is a number of persons or things that are located, gathered, or classed together. Sheep (pl.: sheep) or domestic sheep  (Ovis aries) are a domesticated, ruminant mammal typically kept as livestock. Although the term sheep can apply to other species in the genus Ovis, in everyday usage it almost always refers to domesticated sheep. The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers.", "faiss_indices": [169, 50, 223]}
{"image_path": "data/images/000000454750.jpg", "query": "Describe everything visible in the image.", "caption": "A larger zebra resting its head on a smaller zebra. A head is the part of an organism which usually includes the ears, brain, forehead, cheeks, chin, eyes, nose, and mouth, each of which aid in various sensory functions such as sight, hearing, smell, and taste. Some very simple animals may not have a head, but many bilaterally symmetric forms do, regardless of size. Zebras (US: , UK: ) (subgenus Hippotigris) are African equines with distinctive black-and-white striped coats. There are three living species: Grévy's zebra (Equus grevyi), the plains zebra (E.", "faiss_indices": [3, 33, 227]}
{"image_path": "data/images/000000558073.jpg", "query": "What is the subject of this image?", "caption": "a cat sitting in a bathtub not looking amused A bathtub, also known simply as a bath or tub, is a container for holding water in which a person or another animal may bathe. Most modern bathtubs are made of thermoformed acrylic, porcelain-enameled steel or cast iron, or fiberglass-reinforced polyester. The cat (Felis catus), also referred to as the domestic cat or house cat, is a small domesticated carnivorous mammal. It is the only domesticated species of the family Felidae.", "faiss_indices": [192, 182, 108]}
{"image_path": "data/images/000000031620.jpg", "query": "Can you describe the scene?", "caption": "A bride and groom about to cut into their cake Cake is a flour confection usually made from flour, sugar, and other ingredients and is usually baked. In their oldest forms, cakes were modifications of bread, but cakes now cover a wide range of preparations that can be simple or elaborate and which share features with desserts such as pastries, meringues, custards, and pies.\nThe most common ingredients include flour, sugar, eggs, fat (such as butter, oil, or margarine), a liquid, and a leavening agent, such as baking soda or baking powder. A bridegroom (often shortened to groom) is a man who is about to be married or who is newlywed. \nWhen marrying, the bridegroom's future spouse is usually referred to as the bride. A bride is a woman who is about to be married or who is a newlywed.\nWhen marrying, if the bride's future spouse is a man, he is usually referred to as the bridegroom or just groom. In Western culture, a bride may be attended by a maid, bridesman and one or more bridesmaids.\nThe word \"bride\" has its roots in the Old English word bryd, which is shared with other Germanic languages.", "faiss_indices": [27, 210, 21]}
{"image_path": "data/images/000000379441.jpg", "query": "Explain the contents of the image.", "caption": "A living room with a sofa, a bookcase, and a laptop charging. A bookcase, or bookshelf, is a piece of furniture with horizontal shelves, often in a cabinet, used to store books or other printed materials. Bookcases are used in private homes, public and university libraries, offices, schools, and bookstores. A couch, also known as a sofa, settee, chesterfield, or davenport, is a cushioned piece of furniture that can seat multiple people. It is commonly found in the form of a bench with upholstered armrests and is often fitted with springs and tailored cushion and pillows. In a building or a ship, a room is any enclosed space within a number of walls to which entry is possible only via a door or other dividing structure. The entrance connects it to either a passageway, another room, or the outdoors.", "faiss_indices": [280, 9, 252]}
{"image_path": "data/images/000000509824.jpg", "query": "What can be seen here?", "caption": "A living room with a cream colored couch A couch, also known as a sofa, settee, chesterfield, or davenport, is a cushioned piece of furniture that can seat multiple people. It is commonly found in the form of a bench with upholstered armrests and is often fitted with springs and tailored cushion and pillows. In a building or a ship, a room is any enclosed space within a number of walls to which entry is possible only via a door or other dividing structure. The entrance connects it to either a passageway, another room, or the outdoors.", "faiss_indices": [252, 9, 330]}
{"image_path": "data/images/000000144784.jpg", "query": "What is happening in this image?", "caption": "A hand poised to push a button on a liquid filled blender. A blender (sometimes called a mixer (from Latin mixus, the PPP of miscere eng. to Mix) or liquidiser in British English) is a kitchen and laboratory appliance used to mix, crush, purée or emulsify food and other substances. A button is a  fastener that joins two pieces of fabric together by slipping through a loop or by sliding through a buttonhole.\nIn modern clothing and fashion design, buttons are commonly made of plastic but also may be made of metal, wood, or seashell. Buttons can also be used on containers such as wallets and bags. A hand is a prehensile, multi-fingered appendage located at the end of the forearm or forelimb of primates such as humans, chimpanzees, monkeys, and lemurs. A few other vertebrates such as the koala (which has two opposable thumbs on each \"hand\" and fingerprints extremely similar to human fingerprints) are often described as having \"hands\" instead of paws on their front limbs.", "faiss_indices": [309, 136, 103]}
{"image_path": "data/images/000000332318.jpg", "query": "What is happening in this image?", "caption": "A VERY BIG MOUNTAIN AND ANIMALS SPREAD ACROSS A FARM. A mountain is an elevated portion of the Earth's crust, generally with steep sides that show significant exposed bedrock. Although definitions vary, a mountain may differ from a plateau in having a limited summit area, and is usually higher than a hill, typically rising at least 300 metres (980 ft) above the surrounding land. A farm (also called an agricultural holding) is an area of land that is devoted primarily to agricultural processes with the primary objective of producing food and other crops; it is the basic facility in food production. The name is used for specialized units such as arable farms, vegetable farms, fruit farms, dairy, pig and poultry farms, and land used for the production of natural fiber, biofuel, and other biobased products. Animals are multicellular, eukaryotic organisms in the biological kingdom Animalia (). With few exceptions, animals consume organic material, breathe oxygen, have myocytes and are able to move, can reproduce sexually, and grow from a hollow sphere of cells, the blastula, during embryonic development.", "faiss_indices": [223, 264, 232]}
{"image_path": "data/images/000000552371.jpg", "query": "What does this picture show?", "caption": "Some horses standing near each other in a fenced in area The horse (Equus ferus caballus) is a domesticated, one-toed, hoofed mammal. It belongs to the taxonomic family Equidae and is one of two extant subspecies of Equus ferus. Area is the measure of a region's size on a surface. The area of a plane region or plane area refers to the area of a shape or planar lamina, while surface area refers to the area of an open surface or the boundary of a three-dimensional object.", "faiss_indices": [81, 241, 218]}
{"image_path": "data/images/000000060363.jpg", "query": "What does this picture show?", "caption": "A clock on a building next to a building with a \"Bart\" logo. A logo (abbreviation of logotype; from Ancient Greek  λόγος (lógos) 'word, speech' and  τύπος (túpos) 'mark, imprint') is a graphic mark, emblem, or symbol used to aid and promote public identification and recognition. It may be of an abstract or figurative design or include the text of the name that it represents, as in a wordmark.\nIn the days of hot metal typesetting, a logotype was one word cast as a single piece of type (e.g. A building or edifice is an enclosed structure with a roof, walls and often windows, usually standing permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for numerous factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, prestige, and aesthetic reasons. A clock or chronometer is a device that measures and displays time. The clock is one of the oldest human inventions, meeting the need to measure intervals of time shorter than the natural units such as the day, the lunar month, and the year.", "faiss_indices": [161, 14, 302]}
{"image_path": "data/images/000000060102.jpg", "query": "Explain the contents of the image.", "caption": "a man hitting a soccer ball with his head A head is the part of an organism which usually includes the ears, brain, forehead, cheeks, chin, eyes, nose, and mouth, each of which aid in various sensory functions such as sight, hearing, smell, and taste. Some very simple animals may not have a head, but many bilaterally symmetric forms do, regardless of size. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A ball is a round object (usually spherical, but sometimes ovoid) with several uses. It is used in ball games, where the play of the game follows the state of the ball as it is hit, kicked or thrown by players.", "faiss_indices": [225, 4, 82]}
{"image_path": "data/images/000000254016.jpg", "query": "What is happening in this image?", "caption": "a doughnut factory making doughnuts in oil An oil is any nonpolar chemical substance that is composed primarily of hydrocarbons and is hydrophobic (does not mix with water) and lipophilic (mixes with other oils). Oils are usually flammable and surface active. A doughnut or donut () is a type of pastry made from leavened fried dough.: 275  It is popular in many countries and is prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors. Doughnut is the traditional spelling, while donut is the simplified version; the terms are used interchangeably.\nDoughnuts are usually deep fried from a flour dough, but other types of batters can also be used.", "faiss_indices": [314, 254, 62]}
{"image_path": "data/images/000000425906.jpg", "query": "Provide a description of this image.", "caption": "People look on as an airborne snowboarder competes. Snowboarding is a recreational and competitive activity that involves descending a snow-covered surface while standing on a snowboard that is almost always attached to a rider's feet. It features in the Winter Olympic Games and Winter Paralympic Games.\nSnowboarding was developed in the United States, inspired by skateboarding, sledding, surfing, and skiing. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [122, 187, 251]}
{"image_path": "data/images/000000383386.jpg", "query": "Explain the contents of the image.", "caption": "The three teddy bears sit with their arms around each other. Bears are carnivoran mammals of the family Ursidae (). They are classified as caniforms, or doglike carnivorans.", "faiss_indices": [119, 239, 32]}
{"image_path": "data/images/000000164969.jpg", "query": "Tell me what's going on in the photo.", "caption": "A pizza cut into six slices with three different toppings. Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples.", "faiss_indices": [52, 278, 59]}
{"image_path": "data/images/000000280891.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A child with oranges and apples biting into one. A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. An apple is a round, edible fruit produced by an apple tree (Malus spp.). Fruit trees of the orchard or domestic apple (Malus domestica), the most widely grown in the genus, are cultivated worldwide. The orange, also called sweet orange to distinguish it from the bitter orange (Citrus × aurantium), is the fruit of a tree in the family Rutaceae. Botanically, this is the hybrid Citrus × sinensis, between the pomelo (Citrus maxima) and the mandarin orange (Citrus reticulata).", "faiss_indices": [139, 194, 126]}
{"image_path": "data/images/000000327605.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A women who is standing in the snow on skis. Skis are runners, attached to the user's feet, designed to glide over snow. Typically employed in pairs, skis are attached to ski boots with ski bindings, with either a free, lockable, or partially secured heel. Snow consists of individual ice crystals that grow while suspended in the atmosphere—usually within clouds—and then fall, accumulating on the ground where they undergo further changes. It consists of frozen crystalline water throughout its life cycle, starting when, under suitable conditions, the ice crystals form in the atmosphere, increase to millimeter size, precipitate and accumulate on surfaces, then metamorphose in place, and ultimately melt, slide, or sublimate away.\nSnowstorms organize and develop by feeding on sources of atmospheric moisture and cold air. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [322, 251, 132]}
{"image_path": "data/images/000000353518.jpg", "query": "Tell me what's going on in the photo.", "caption": "A harbor with boats washed up in the low tide A harbor (American English), or harbour (Commonwealth English; see spelling differences), is a sheltered body of water where ships, boats, and barges can be moored. The term harbor is often used interchangeably with port, which is a man-made facility built for loading and unloading vessels and dropping off and picking up passengers. A boat is a watercraft of a large range of types and sizes, but generally smaller than a ship, which is distinguished by its larger size or capacity, its shape, or its ability to carry boats.\nSmall boats are typically used on inland waterways such as rivers and lakes, or in protected coastal areas. However, some boats (such as whaleboats) were intended for offshore use. Tides are the rise and fall of sea levels caused by the combined effects of the gravitational forces exerted by the Moon (and to a much lesser extent, the Sun) and are also caused by the Earth and Moon orbiting one another.\nTide tables can be used for any given locale to find the predicted times and amplitude (or \"tidal range\"). \nThe predictions are influenced by many factors including the alignment of the Sun and Moon, the phase and amplitude of the tide (pattern of tides in the deep ocean), the amphidromic systems of the oceans, and the shape of the coastline and near-shore bathymetry (see Timing).", "faiss_indices": [214, 289, 279]}
{"image_path": "data/images/000000560312.jpg", "query": "Explain the contents of the image.", "caption": "An indoor station has a television on the wall. Television (TV) is a telecommunication medium for transmitting moving images and sound. Additionally, the term can refer to a physical television set rather than the medium of transmission. A wall is a structure and a surface that defines an area; carries a load; provides security, shelter, or soundproofing; or serves a decorative purpose. There are various types of walls, including border barriers between countries, brick walls, defensive walls in fortifications, and retaining walls that hold back dirt, stone, water, or noise.", "faiss_indices": [79, 128, 330]}
{"image_path": "data/images/000000366611.jpg", "query": "Can you describe the scene?", "caption": "A dog is chewing on a soccer ball. A ball is a round object (usually spherical, but sometimes ovoid) with several uses. It is used in ball games, where the play of the game follows the state of the ball as it is hit, kicked or thrown by players. The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers.", "faiss_indices": [225, 230, 294]}
{"image_path": "data/images/000000125257.jpg", "query": "Can you describe the scene?", "caption": "a person walking on a snow covered field. A person (pl.: people or persons, depending on context) is a being who has certain capacities or attributes such as reason, morality, consciousness or self-consciousness, and being a part of a culturally established form of social relations such as kinship, ownership of property, or legal responsibility. The defining features of personhood and, consequently, what makes a person count as a person, differ widely among cultures and contexts.\nIn addition to the question of personhood, of what makes a being count as a person to begin with, there are further questions about personal identity and self: both about what makes any particular person that particular person instead of another, and about what makes a person at one time the same person as they were or will be at another time despite any intervening changes.\nThe plural form \"people\" is often used to refer to an entire nation or ethnic group (as in \"a people\"), and this was the original meaning of the word; it subsequently acquired its", "faiss_indices": [122, 317, 99]}
{"image_path": "data/images/000000469174.jpg", "query": "What is happening in this image?", "caption": "A plane flying low with an American flag flying in the foreground. Plane most often refers to:\n\nAero- or airplane, a powered, fixed-wing aircraft\nPlane (geometry), a flat, 2-dimensional surface\nPlane (mathematics), generalizations of a geometrical plane\nPlane or planes may also refer to: A flag is a piece of fabric (most often rectangular) with distinctive colours and design. It is used as a symbol, a signalling device, or for decoration.", "faiss_indices": [16, 203, 18]}
{"image_path": "data/images/000000118367.jpg", "query": "Explain the contents of the image.", "caption": "Hot dog on a roll with cheese, onions, and herbs. The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers. Cheese is a type of dairy product produced in a range of flavors, textures, and forms by coagulation of the milk protein casein. It comprises proteins and fat from milk (usually the milk of cows, buffalo, goats or sheep). An onion (Allium cepa L.Tooltip Carl Linnaeus, from Latin cepa), also known as the bulb onion or common onion, is a vegetable that is the most widely cultivated species of the genus Allium. The shallot is a botanical variety of the onion which was classified as a separate species until 2011. Herbs are a widely distributed and widespread group of plants, excluding vegetables, with savory or aromatic properties that are used for flavoring and garnishing food, for medicinal purposes, or for fragrances. Culinary use typically distinguishes herbs from spices.", "faiss_indices": [310, 70, 59]}
{"image_path": "data/images/000000157756.jpg", "query": "What is happening in this image?", "caption": "A clock that is sitting on the side of a tower. A tower is a tall structure, taller than it is wide, often by a significant factor. Towers are distinguished from masts by their lack of guy-wires and are therefore, along with tall buildings, self-supporting structures.\nTowers are specifically distinguished from buildings in that they are built not to be habitable but to serve other functions using the height of the tower. That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe. A clock or chronometer is a device that measures and displays time. The clock is one of the oldest human inventions, meeting the need to measure intervals of time shorter than the natural units such as the day, the lunar month, and the year.", "faiss_indices": [161, 14, 162]}
{"image_path": "data/images/000000035770.jpg", "query": "What is the subject of this image?", "caption": "There are sinks and black and white designs in the bathroom. A sink (also known as basin in the UK) is a bowl-shaped plumbing fixture for washing hands, dishwashing, and other purposes. Sinks have a tap (faucet) that supplies hot and cold water and may include a spray feature to be used for faster rinsing. A bathroom is a room in which people wash their bodies or parts thereof. It can contain one or more of the following plumbing fixtures: a shower, a bathtub, a bidet, and a sink (also known as a wash basin in the United Kingdom). A design is the concept or proposal for an object, process, or system. The word design refers to something that is or has been intentionally created by a thinking agent, and is sometimes used to refer to the inherent nature of something – its design.", "faiss_indices": [306, 108, 256]}
{"image_path": "data/images/000000012670.jpg", "query": "What does this picture show?", "caption": "A large crowd of people walking around while one owns a teddy bear. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty. Bears are carnivoran mammals of the family Ursidae (). They are classified as caniforms, or doglike carnivorans. A crowd is as a group of people that have gathered for a common purpose or intent. Examples are a demonstration, a sports event, or a looting (classified in sociology as an acting crowd).", "faiss_indices": [229, 212, 119]}
{"image_path": "data/images/000000032038.jpg", "query": "What can be seen here?", "caption": "a large cheesy pizza on a wooden counter Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples.", "faiss_indices": [52, 278, 131]}
{"image_path": "data/images/000000456394.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A show floor with a shiny blue motorcycle surrounded by bars. A floor is the bottom surface of a room or vehicle. Floors vary from simple dirt in a cave to many layered surfaces made with modern technology. A motorcycle (motorbike, bike; uni (if one-wheeled); trike (if three-wheeled); quad (if four-wheeled)) is a lightweight private 1-to-2 passenger personal motor vehicle steered by a handlebar from a saddle-style seat.\nMotorcycle designs vary greatly to suit a range of different purposes: long-distance travel, commuting, cruising, sport (including racing), and off-road riding. Motorcycling is riding a motorcycle and being involved in other related social activities such as joining a motorcycle club and attending motorcycle rallies.\nThe 1885 Daimler Reitwagen made by Gottlieb Daimler and Wilhelm Maybach in Germany was the first internal combustion, petroleum-fueled motorcycle.", "faiss_indices": [39, 63, 40]}
{"image_path": "data/images/000000402096.jpg", "query": "What can be seen here?", "caption": "A sign stands in front of a building on the street. A sign is an object, quality, event, or entity whose presence or occurrence indicates the probable presence or occurrence of something else. A natural sign bears a causal relation to its object—for instance, thunder is a sign of storm, or medical symptoms a sign of disease. A building or edifice is an enclosed structure with a roof, walls and often windows, usually standing permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for numerous factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, prestige, and aesthetic reasons. A street is a public thoroughfare in a city, town or village, typically lined with buildings on one or both sides. Streets often include pavements (sidewalks), pedestrian crossings, and sometimes amenities like streetlights or benches.", "faiss_indices": [275, 249, 287]}
{"image_path": "data/images/000000348481.jpg", "query": "Explain the contents of the image.", "caption": "A laptop, phone, keys and other accessories sitting on a table. A telephone, colloquially referred to as a phone, is a telecommunications device that enables two or more users to conduct a conversation when they are too far apart to be easily heard directly. A telephone converts sound, typically and most efficiently the human voice, into electronic signals that are transmitted via cables and other communication channels to another telephone which reproduces the sound to the receiving user. A laptop computer or notebook computer, also known as a laptop or notebook, is a small, portable personal computer (PC). Laptops typically have a clamshell form factor with a flat-panel screen on the inside of the upper lid and an alphanumeric keyboard and pointing device on the inside of the lower lid.", "faiss_indices": [233, 245, 280]}
{"image_path": "data/images/000000031735.jpg", "query": "Can you describe the scene?", "caption": "A view of a room that has two windows and a blue couch. Windows is a product line of proprietary graphical operating systems developed and marketed by Microsoft. It is grouped into families and subfamilies that cater to particular sectors of the computing industry – Windows (unqualified) for a consumer or corporate workstation, Windows Server for a server and Windows IoT for an embedded system. That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe. A couch, also known as a sofa, settee, chesterfield, or davenport, is a cushioned piece of furniture that can seat multiple people. It is commonly found in the form of a bench with upholstered armrests and is often fitted with springs and tailored cushion and pillows. In a building or a ship, a room is any enclosed space within a number of walls to which entry is possible only via a door or other dividing structure. The entrance connects it to either a passageway, another room, or the outdoors.", "faiss_indices": [252, 9, 330]}
{"image_path": "data/images/000000071451.jpg", "query": "What does this picture show?", "caption": "A white bed topped with lots of pillows and a wooden headboard. A pillow is a support of the body at rest for comfort, therapy, or decoration. Pillows are used in different variations by many species, including humans. A bed is a piece of furniture that is used as a place to sleep, rest, and relax.\nMost modern beds consist of a soft, cushioned mattress on a bed frame. The mattress rests either on a solid base, often wood slats, or a sprung base.", "faiss_indices": [175, 164, 280]}
{"image_path": "data/images/000000431140.jpg", "query": "What is happening in this image?", "caption": "A bathroom with a white toilet and a white sink and a mirror A sink (also known as basin in the UK) is a bowl-shaped plumbing fixture for washing hands, dishwashing, and other purposes. Sinks have a tap (faucet) that supplies hot and cold water and may include a spray feature to be used for faster rinsing. A bathroom is a room in which people wash their bodies or parts thereof. It can contain one or more of the following plumbing fixtures: a shower, a bathtub, a bidet, and a sink (also known as a wash basin in the United Kingdom). A mirror, also known as a looking glass, is an object that reflects an image. Light that bounces off a mirror forms an image of whatever is in front of it, which is then focused through the lens of the eye or a camera. A toilet is a piece of sanitary hardware that collects human waste (urine and feces) and sometimes toilet paper, usually for disposal. Flush toilets use water, while dry or non-flush toilets do not.", "faiss_indices": [306, 320, 270]}
{"image_path": "data/images/000000431545.jpg", "query": "What is happening in this image?", "caption": "a close up of a baseball player running on the base paths A path is a route for physical travel – see Trail.\nPath or PATH may also refer to:", "faiss_indices": [113, 4, 82]}
{"image_path": "data/images/000000151000.jpg", "query": "What does this picture show?", "caption": "A woman holding a camera is taking a picture. An image or picture is a visual representation. An image can be two-dimensional, such as a drawing, painting, or photograph, or three-dimensional, such as a carving or sculpture. A camera is an instrument used to capture and store images and videos, either digitally via an electronic image sensor, or chemically via a light-sensitive material such as photographic film. As a pivotal technology in the fields of photography and videography, cameras have played a significant role in the progression of visual arts, media, entertainment, surveillance, and scientific research. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [94, 166, 30]}
{"image_path": "data/images/000000218997.jpg", "query": "Tell me what's going on in the photo.", "caption": "A small boy sits on the ground playing with a baseball at a baseball field Baseball is a bat-and-ball sport played between two teams of nine players each, taking turns batting and fielding. The game occurs over the course of several plays, with each play beginning when a player on the fielding team, called the pitcher, throws a ball that a player on the batting team, called the batter, tries to hit with a bat. A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [113, 4, 82]}
{"image_path": "data/images/000000303499.jpg", "query": "Summarize the visual elements in this picture.", "caption": "Two people riding on the back of horses near a tall building. A building or edifice is an enclosed structure with a roof, walls and often windows, usually standing permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for numerous factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, prestige, and aesthetic reasons. The horse (Equus ferus caballus) is a domesticated, one-toed, hoofed mammal. It belongs to the taxonomic family Equidae and is one of two extant subspecies of Equus ferus. The human back, also called the dorsum (pl.: dorsa), is the large posterior area of the human body, rising from the top of the buttocks to the back of the neck. It is the surface of the body opposite from the chest and the abdomen. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [165, 81, 241]}
{"image_path": "data/images/000000167902.jpg", "query": "What can be seen here?", "caption": "A large yellow and black toucan sitting on top of a tree branch. A branch, also called a ramus in botany, is a stem that grows off from another stem, or when structures like veins in leaves are divided into smaller veins. Top most commonly refers to:\n\nTop, a basic term of orientation, distinguished from bottom, front, back, and sides\nSpinning top, a ubiquitous traditional toy\nTop (clothing), clothing designed to be worn over the torso\nMountain top, a mountain peak located at some distance from the nearest point of higher elevation\nTop may also refer to:", "faiss_indices": [171, 57, 144]}
{"image_path": "data/images/000000509699.jpg", "query": "Explain the contents of the image.", "caption": "A person on a flowered chair is watching an old television. Television (TV) is a telecommunication medium for transmitting moving images and sound. Additionally, the term can refer to a physical television set rather than the medium of transmission. A person (pl.: people or persons, depending on context) is a being who has certain capacities or attributes such as reason, morality, consciousness or self-consciousness, and being a part of a culturally established form of social relations such as kinship, ownership of property, or legal responsibility. The defining features of personhood and, consequently, what makes a person count as a person, differ widely among cultures and contexts.\nIn addition to the question of personhood, of what makes a being count as a person to begin with, there are further questions about personal identity and self: both about what makes any particular person that particular person instead of another, and about what makes a person at one time the same person as they were or will be at another time despite any intervening changes.\nThe plural form \"people\" is often used to refer to an entire nation or ethnic group (as in \"a people\"), and this was the original meaning of the word; it subsequently acquired its A chair is a type of seat, typically designed for one person and consisting of one or more legs, a flat or slightly angled seat and a back-rest. It may be made of wood, metal, or synthetic materials, and may be padded or upholstered in various colors and fabrics.\nChairs vary in design.", "faiss_indices": [128, 79, 195]}
{"image_path": "data/images/000000431876.jpg", "query": "Explain the contents of the image.", "caption": "The cops in the city are riding horses threw the streets. Streets is the plural of street, a type of road.\nStreets or The Streets may also refer to: The horse (Equus ferus caballus) is a domesticated, one-toed, hoofed mammal. It belongs to the taxonomic family Equidae and is one of two extant subspecies of Equus ferus. A city is a human settlement of a substantial size. The term \"city\" has different meanings around the world and in some places the settlement can be very small.", "faiss_indices": [249, 165, 287]}
{"image_path": "data/images/000000033005.jpg", "query": "What can be seen here?", "caption": "A person on a tennis court standing on one leg A person (pl.: people or persons, depending on context) is a being who has certain capacities or attributes such as reason, morality, consciousness or self-consciousness, and being a part of a culturally established form of social relations such as kinship, ownership of property, or legal responsibility. The defining features of personhood and, consequently, what makes a person count as a person, differ widely among cultures and contexts.\nIn addition to the question of personhood, of what makes a being count as a person to begin with, there are further questions about personal identity and self: both about what makes any particular person that particular person instead of another, and about what makes a person at one time the same person as they were or will be at another time despite any intervening changes.\nThe plural form \"people\" is often used to refer to an entire nation or ethnic group (as in \"a people\"), and this was the original meaning of the word; it subsequently acquired its A leg is a weight-bearing and locomotive anatomical structure, usually having a columnar shape. During locomotion, legs function as \"extensible struts\". A court is an institution, often a government entity, with the authority to adjudicate legal disputes between parties  and administer justice in civil, criminal, and administrative matters in accordance with the rule of law.\nCourts generally consist of judges or other judicial officers, and are usually established and dissolved through legislation enacted by a legislature. Courts may also be established by constitution or an equivalent constituting instrument.\nThe practical authority given to the court is known as its jurisdiction, which describes the court's power to decide certain kinds of questions, or petitions put to it.", "faiss_indices": [235, 327, 259]}
{"image_path": "data/images/000000056288.jpg", "query": "What can be seen here?", "caption": "A large half a sandwich sitting on a plate next to a pepperocini A sandwich is a dish typically consisting variously of meat, cheese, sauces, and vegetables used as a filling between slices of bread, or placed atop a slice of bread; or, more generally, any dish in which bread serves as a container or wrapper for another food type, and allows it to be a finger food. The sandwich began as a portable, convenient food in the Western world, though over time it has become prevalent worldwide.\nThere has been social media debate over the precise definition of sandwich, specifically whether a hot dog or open sandwich can be categorized as such. Peperoncino (Italian: [peperonˈtʃiːno]; pl.: peperoncini) is the generic Italian name for hot chili peppers, specifically some regional cultivars of the species Capsicum annuum and C. frutescens (chili pepper and Tabasco pepper, respectively).", "faiss_indices": [59, 196, 17]}
{"image_path": "data/images/000000016249.jpg", "query": "What can be seen here?", "caption": "there are many people that are sitting on the benches That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [9, 252, 195]}
{"image_path": "data/images/000000203864.jpg", "query": "Provide a description of this image.", "caption": "Two people standing on a tennis court playing tennis A court is an institution, often a government entity, with the authority to adjudicate legal disputes between parties  and administer justice in civil, criminal, and administrative matters in accordance with the rule of law.\nCourts generally consist of judges or other judicial officers, and are usually established and dissolved through legislation enacted by a legislature. Courts may also be established by constitution or an equivalent constituting instrument.\nThe practical authority given to the court is known as its jurisdiction, which describes the court's power to decide certain kinds of questions, or petitions put to it. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [235, 113, 82]}
{"image_path": "data/images/000000231747.jpg", "query": "What is the subject of this image?", "caption": "Photos of sports memorabilia including shirts, caps, and baseball bats. A shirt is a cloth garment for the upper body (from the neck to the waist).\nOriginally an undergarment worn exclusively by men, it has become, in American English, a catch-all term for a broad variety of upper-body garments and undergarments. In British English, a shirt is more specifically a garment with a collar, sleeves with cuffs, and a full vertical opening with buttons or snaps (North Americans would call that a \"dress shirt\", a specific type of collared shirt). A souvenir (French for 'a remembrance or memory'), memento, keepsake, or token of remembrance is an object a person acquires for the memories the owner associates with it. A souvenir can be any object that can be collected or purchased and transported home by the traveler as a memento of a visit. A photograph (also known as a photo, or more generically referred to as an image or picture) is an image created by light falling on a photosensitive surface, usually photographic film or an electronic image sensor. The process and practice of creating such images is called photography.\nMost photographs are now created using a smartphone or camera, which uses a lens to focus the scene's visible wavelengths of light into a reproduction of what the human eye would perceive. Bats are flying mammals of the order Chiroptera (). With their forelimbs adapted as wings, they are the only mammals capable of true and sustained flight.", "faiss_indices": [301, 215, 283]}
{"image_path": "data/images/000000018737.jpg", "query": "Tell me what's going on in the photo.", "caption": "A motorcycle is sitting next to a beach. A beach is a landform alongside a body of water which consists of loose particles. The particles composing a beach are typically made from rock, such as sand, gravel, shingle, pebbles, etc., or biological sources, such as mollusc shells or coralline algae. A motorcycle (motorbike, bike; uni (if one-wheeled); trike (if three-wheeled); quad (if four-wheeled)) is a lightweight private 1-to-2 passenger personal motor vehicle steered by a handlebar from a saddle-style seat.\nMotorcycle designs vary greatly to suit a range of different purposes: long-distance travel, commuting, cruising, sport (including racing), and off-road riding. Motorcycling is riding a motorcycle and being involved in other related social activities such as joining a motorcycle club and attending motorcycle rallies.\nThe 1885 Daimler Reitwagen made by Gottlieb Daimler and Wilhelm Maybach in Germany was the first internal combustion, petroleum-fueled motorcycle.", "faiss_indices": [63, 39, 8]}
{"image_path": "data/images/000000083172.jpg", "query": "What is happening in this image?", "caption": "A tennis match with one of the players serving the ball. A ball is a round object (usually spherical, but sometimes ovoid) with several uses. It is used in ball games, where the play of the game follows the state of the ball as it is hit, kicked or thrown by players. A match is a tool for starting a fire. Typically, matches are made of small wooden sticks or stiff paper.", "faiss_indices": [235, 113, 82]}
{"image_path": "data/images/000000025386.jpg", "query": "Summarize the visual elements in this picture.", "caption": "two people on a train with trays of food A tray is a shallow platform designed for the carrying of items. It can be fashioned from numerous materials, including silver, brass, sheet iron, paperboard, wood, melamine, and molded pulp. Food is any substance consumed by an organism for nutritional support. Food is usually of plant, animal, or fungal origin and contains essential nutrients such as carbohydrates, fats, proteins, vitamins, or minerals. A train (from Old French trahiner, from Latin trahere, \"to pull, to draw\") is a series of connected vehicles that run along a railway track and transport people or freight. Trains are typically pulled or pushed by locomotives (often known simply as \"engines\"), though some are self-propelled, such as multiple units or railcars. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [313, 319, 89]}
{"image_path": "data/images/000000100510.jpg", "query": "What does this picture show?", "caption": "A jockey riding and jumping with a horse in an obstacle course. The horse (Equus ferus caballus) is a domesticated, one-toed, hoofed mammal. It belongs to the taxonomic family Equidae and is one of two extant subspecies of Equus ferus.", "faiss_indices": [165, 241, 81]}
{"image_path": "data/images/000000034205.jpg", "query": "Summarize the visual elements in this picture.", "caption": "The meal is prepared and ready to be eaten. A meal is an occasion that takes place at a certain time and includes consumption of food. The English names used for specific meals vary, depending on the speaker's culture, the time of day, or the size of the meal.", "faiss_indices": [205, 17, 131]}
{"image_path": "data/images/000000482719.jpg", "query": "Provide a description of this image.", "caption": "Bananas and plums sitting in a bowl on the a table. A plum is a fruit of some species in Prunus subg. Prunus. A banana is an elongated, edible fruit – botanically a berry – produced by several kinds of large treelike herbaceous flowering plants in the genus Musa. In some countries, cooking bananas are called plantains, distinguishing them from dessert bananas. A bowl is a typically round dish or container generally used for preparing, serving, storing, or consuming food. The interior of a bowl is characteristically shaped like a spherical cap, with the edges and the bottom, forming a seamless curve.", "faiss_indices": [213, 328, 45]}
{"image_path": "data/images/000000226984.jpg", "query": "Tell me what's going on in the photo.", "caption": "The counters in this kitchen are covered with stuff. A kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment. A modern middle-class residential kitchen is typically equipped with a stove, a sink with hot and cold running water, a refrigerator, and worktops and kitchen cabinets arranged according to a modular design.", "faiss_indices": [329, 309, 256]}
{"image_path": "data/images/000000276055.jpg", "query": "What can be seen here?", "caption": "A woman holding a drink and a large carrot The carrot (Daucus carota subsp. sativus) is a root vegetable, typically orange in colour, though heirloom variants including purple, black, red, white, and yellow cultivars exist, all of which are domesticated forms of the wild carrot, Daucus carota, native to Europe and Southwestern Asia. A drink or beverage is a liquid intended for human consumption. In addition to their basic function of satisfying thirst, drinks play important roles in human culture. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [284, 201, 48]}
{"image_path": "data/images/000000221291.jpg", "query": "Tell me what's going on in the photo.", "caption": "Young boy posing in front of a flying kite in the park A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag forces. A kite consists of wings, tethers and anchors. A park is an area of natural, semi-natural or planted space set aside for human enjoyment and recreation or for the protection of wildlife or natural habitats. Urban parks are green spaces set aside for recreation inside towns and cities. A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [26, 268, 255]}
{"image_path": "data/images/000000355257.jpg", "query": "What is the subject of this image?", "caption": "A girl in a hospital bed with an IV and monitors. A girl is a young female human, usually a child or an adolescent. While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture. A bed is a piece of furniture that is used as a place to sleep, rest, and relax.\nMost modern beds consist of a soft, cushioned mattress on a bed frame. The mattress rests either on a solid base, often wood slats, or a sprung base.", "faiss_indices": [270, 175, 222]}
{"image_path": "data/images/000000465179.jpg", "query": "What is happening in this image?", "caption": "A woman is brushing her teeth and posing for a picture. An image or picture is a visual representation. An image can be two-dimensional, such as a drawing, painting, or photograph, or three-dimensional, such as a carving or sculpture. A tooth (pl.: teeth) is a hard, calcified structure found in the jaws (or mouths) of many vertebrates and used to break down food. Some animals, particularly carnivores and omnivores, also use teeth to help with capturing or wounding prey, tearing food, for defensive purposes, to intimidate other animals often including their own, or to carry prey or their young. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [296, 267, 166]}
{"image_path": "data/images/000000227044.jpg", "query": "Provide a description of this image.", "caption": "A cat idly looks by on top of a sink A sink (also known as basin in the UK) is a bowl-shaped plumbing fixture for washing hands, dishwashing, and other purposes. Sinks have a tap (faucet) that supplies hot and cold water and may include a spray feature to be used for faster rinsing. Top most commonly refers to:\n\nTop, a basic term of orientation, distinguished from bottom, front, back, and sides\nSpinning top, a ubiquitous traditional toy\nTop (clothing), clothing designed to be worn over the torso\nMountain top, a mountain peak located at some distance from the nearest point of higher elevation\nTop may also refer to: The cat (Felis catus), also referred to as the domestic cat or house cat, is a small domesticated carnivorous mammal. It is the only domesticated species of the family Felidae.", "faiss_indices": [182, 192, 188]}
{"image_path": "data/images/000000378284.jpg", "query": "Can you describe the scene?", "caption": "Small personal pizza on a crust made of rice. Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples. Rice is a cereal grain and in its domesticated form is the staple food of over half of the world's population, particularly in Asia and Africa. Rice is the seed of the grass species Oryza sativa (Asian rice)—or, much less commonly, Oryza glaberrima (African rice).", "faiss_indices": [278, 52, 96]}
{"image_path": "data/images/000000406570.jpg", "query": "Can you describe the scene?", "caption": "some apples oranges and another yellow and green fruit In botany, a fruit is the seed-bearing structure in flowering plants (angiosperms) that is formed from the ovary after flowering.\nFruits are the means by which angiosperms disseminate their seeds. Edible fruits in particular have long propagated using the movements of humans and other animals in a symbiotic relationship that is the means for seed dispersal for the one group and nutrition for the other; humans, and many other animals, have become dependent on fruits as a source of food. The orange, also called sweet orange to distinguish it from the bitter orange (Citrus × aurantium), is the fruit of a tree in the family Rutaceae. Botanically, this is the hybrid Citrus × sinensis, between the pomelo (Citrus maxima) and the mandarin orange (Citrus reticulata).", "faiss_indices": [194, 139, 126]}
{"image_path": "data/images/000000433192.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A laptop computer is sitting open on a bed. A bed is a piece of furniture that is used as a place to sleep, rest, and relax.\nMost modern beds consist of a soft, cushioned mattress on a bed frame. The mattress rests either on a solid base, often wood slats, or a sprung base. A computer is a machine that can be programmed to automatically carry out sequences of arithmetic or logical operations (computation). Modern digital electronic computers can perform generic sets of operations known as programs, which enable computers to perform a wide range of tasks.", "faiss_indices": [233, 245, 92]}
{"image_path": "data/images/000000336658.jpg", "query": "Summarize the visual elements in this picture.", "caption": "The buses are parked next to the pole. A bus (contracted from omnibus, with variants multibus, motorbus, autobus, etc.) is a motor vehicle that carries significantly more passengers than an average car or van, but fewer than the average rail transport. It is most commonly used in public transport, but is also in use for charter purposes, or through private ownership.", "faiss_indices": [134, 41, 316]}
{"image_path": "data/images/000000150726.jpg", "query": "What does this picture show?", "caption": "Pair of giraffes walking on grassy area in enclosure. Area is the measure of a region's size on a surface. The area of a plane region or plane area refers to the area of a shape or planar lamina, while surface area refers to the area of an open surface or the boundary of a three-dimensional object. Enclosure or inclosure is a term, used in English landownership, that refers to the appropriation of \"waste\" or \"common land\", enclosing it, and by doing so depriving commoners of their traditional rights of access and usage. Agreements to enclose land could be either through a formal or informal process. The giraffe is a large African hoofed mammal belonging to the genus Giraffa. It is the tallest living terrestrial animal and the largest ruminant on Earth.", "faiss_indices": [272, 38, 3]}
{"image_path": "data/images/000000481413.jpg", "query": "What does this picture show?", "caption": "A very small boy on the beach with a disc. A beach is a landform alongside a body of water which consists of loose particles. The particles composing a beach are typically made from rock, such as sand, gravel, shingle, pebbles, etc., or biological sources, such as mollusc shells or coralline algae. A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [230, 8, 170]}
{"image_path": "data/images/000000243034.jpg", "query": "Describe everything visible in the image.", "caption": "A very tall clock tower towering over a city at night. A tower is a tall structure, taller than it is wide, often by a significant factor. Towers are distinguished from masts by their lack of guy-wires and are therefore, along with tall buildings, self-supporting structures.\nTowers are specifically distinguished from buildings in that they are built not to be habitable but to serve other functions using the height of the tower. A city is a human settlement of a substantial size. The term \"city\" has different meanings around the world and in some places the settlement can be very small. Night, or nighttime, is the period of darkness when the Sun is below the horizon. Sunlight illuminates one side of the Earth, leaving the other in darkness.", "faiss_indices": [162, 292, 112]}
{"image_path": "data/images/000000297562.jpg", "query": "Can you describe the scene?", "caption": "A baby sitting in a chair getting a haircut. In common terminology, a baby is the very young offspring of adult human beings, while infant (from the Latin word infans, meaning 'baby' or 'child') is a formal or specialised synonym. The terms may also be used to refer to juveniles of other organisms. A hairstyle, hairdo, haircut, or coiffure refers to the styling of hair, usually on the human head but sometimes on the face or body. The fashioning of hair can be considered an aspect of personal grooming, fashion, and cosmetics, although practical, cultural, and popular considerations also influence some hairstyles.\nThe oldest known depiction of hair styling is hair braiding, which dates back about 30,000 years. A chair is a type of seat, typically designed for one person and consisting of one or more legs, a flat or slightly angled seat and a back-rest. It may be made of wood, metal, or synthetic materials, and may be padded or upholstered in various colors and fabrics.\nChairs vary in design.", "faiss_indices": [240, 155, 195]}
{"image_path": "data/images/000000251119.jpg", "query": "Tell me what's going on in the photo.", "caption": "The lunchbox has a cold sandwich, strawberry yogurt and orange juice. A sandwich is a dish typically consisting variously of meat, cheese, sauces, and vegetables used as a filling between slices of bread, or placed atop a slice of bread; or, more generally, any dish in which bread serves as a container or wrapper for another food type, and allows it to be a finger food. The sandwich began as a portable, convenient food in the Western world, though over time it has become prevalent worldwide.\nThere has been social media debate over the precise definition of sandwich, specifically whether a hot dog or open sandwich can be categorized as such. Juice is a drink made from the extraction or pressing of the natural liquid contained in fruit and vegetables. It can also refer to liquids that are flavored with concentrate or other biological food sources, such as meat or seafood, such as clam juice. Yogurt (UK: ; US: , from Ottoman Turkish: یوغورت, Turkish: yoğurt; also spelled yoghurt, yogourt or yoghourt) is a food produced by bacterial fermentation of milk. Fermentation of sugars in the milk by these bacteria produces lactic acid, which acts on milk protein to give yogurt its texture and characteristic tart flavor. A lunch box (or lunchbox) is a hand-held container used to transport food, usually to work or to school. It is commonly made of metal or plastic, is reasonably airtight and often has a handle for carrying.", "faiss_indices": [291, 17, 102]}
{"image_path": "data/images/000000413395.jpg", "query": "Can you describe the scene?", "caption": "A man sits on the couch with two cats on his lap. A lap is a surface (usually horizontal) created between the knee and hips of a biped when it is in a seated or lying down position. The lap of a parent or loved one is seen as a physically and psychologically comfortable place for a child to sit. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A couch, also known as a sofa, settee, chesterfield, or davenport, is a cushioned piece of furniture that can seat multiple people. It is commonly found in the form of a bench with upholstered armrests and is often fitted with springs and tailored cushion and pillows. The cat (Felis catus), also referred to as the domestic cat or house cat, is a small domesticated carnivorous mammal. It is the only domesticated species of the family Felidae.", "faiss_indices": [192, 182, 9]}
{"image_path": "data/images/000000270677.jpg", "query": "What can be seen here?", "caption": "This is a picture of a boy with his skateboard. An image or picture is a visual representation. An image can be two-dimensional, such as a drawing, painting, or photograph, or three-dimensional, such as a carving or sculpture. A skateboard is a type of sports equipment used for skateboarding. It is usually made of a specially designed 7–8-ply maple plywood deck and has polyurethane wheels attached to the underside by a pair of skateboarding trucks.\nThe skateboard moves by pushing with one foot while the other foot remains balanced on the board, or by pumping one's legs in structures such as a bowl or half pipe. A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [2, 255, 170]}
{"image_path": "data/images/000000464824.jpg", "query": "Describe everything visible in the image.", "caption": "A man getting water from a fire hydrant on a sidewalk. Water is an inorganic compound with the chemical formula H2O. It is a transparent, tasteless, odorless, and nearly colorless chemical substance. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A sidewalk (North American English),\n\n \npavement (British English, South African English), or footpath (Irish English, Indian English, Australian English, New Zealand English) is a path along the side of a road. Usually constructed of concrete, pavers, brick, stone, or asphalt, it is designed for pedestrians.", "faiss_indices": [11, 99, 106]}
{"image_path": "data/images/000000147205.jpg", "query": "Can you describe the scene?", "caption": "A piece of roast meat with walnuts and mushrooms on a serving plate Meat is animal tissue, often muscle, that is eaten as food. Humans have hunted and farmed other animals for meat since prehistory. A walnut is the edible seed of any tree of the genus Juglans (family Juglandaceae), particularly the Persian or English walnut, Juglans regia. They are accessory fruit because the outer covering of the fruit is technically an involucre and thus not morphologically part of the carpel; this means it cannot be a drupe but is instead a drupe-like nut.\nAfter full ripening, the shell is discarded, and the kernel is eaten. A mushroom or toadstool is the fleshy, spore-bearing fruiting body of a fungus, typically produced above ground on soil or another food source. Toadstool generally refers to a poisonous mushroom.\nThe standard for the name \"mushroom\" is the cultivated white button mushroom, Agaricus bisporus; hence, the word \"mushroom\" is most often applied to those fungi (Basidiomycota, Agaricomycetes) that have a stem (stipe), a cap (pileus), and gills (lamellae, sing.", "faiss_indices": [206, 10, 96]}
{"image_path": "data/images/000000530820.jpg", "query": "Tell me what's going on in the photo.", "caption": "A man standing on a tennis court holding a racket A court is an institution, often a government entity, with the authority to adjudicate legal disputes between parties  and administer justice in civil, criminal, and administrative matters in accordance with the rule of law.\nCourts generally consist of judges or other judicial officers, and are usually established and dissolved through legislation enacted by a legislature. Courts may also be established by constitution or an equivalent constituting instrument.\nThe practical authority given to the court is known as its jurisdiction, which describes the court's power to decide certain kinds of questions, or petitions put to it. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father.", "faiss_indices": [235, 82, 225]}
{"image_path": "data/images/000000549390.jpg", "query": "Describe everything visible in the image.", "caption": "a person in a dress rides on a bike A person (pl.: people or persons, depending on context) is a being who has certain capacities or attributes such as reason, morality, consciousness or self-consciousness, and being a part of a culturally established form of social relations such as kinship, ownership of property, or legal responsibility. The defining features of personhood and, consequently, what makes a person count as a person, differ widely among cultures and contexts.\nIn addition to the question of personhood, of what makes a being count as a person to begin with, there are further questions about personal identity and self: both about what makes any particular person that particular person instead of another, and about what makes a person at one time the same person as they were or will be at another time despite any intervening changes.\nThe plural form \"people\" is often used to refer to an entire nation or ethnic group (as in \"a people\"), and this was the original meaning of the word; it subsequently acquired its A bicycle, also called a pedal cycle, bike, push-bike or cycle, is a human-powered or motor-assisted, pedal-driven, single-track vehicle, with two wheels attached to a frame, one behind the other. A bicycle rider is called a cyclist, or bicyclist.\nBicycles were introduced in the 19th century in Europe.", "faiss_indices": [286, 220, 39]}
{"image_path": "data/images/000000405972.jpg", "query": "What can be seen here?", "caption": "An elephant leads a baby elephant towards a door. Elephants are the largest living land animals. Three living species are currently recognised: the African bush elephant (Loxodonta africana), the African forest elephant (L. A door is a hinged or otherwise movable barrier that allows ingress (entry) into and egress (exit) from an enclosure. The created opening in the wall is a doorway or portal.", "faiss_indices": [32, 248, 43]}
{"image_path": "data/images/000000378454.jpg", "query": "Describe everything visible in the image.", "caption": "A man gets air catching the Frisbee near the water. Water is an inorganic compound with the chemical formula H2O. It is a transparent, tasteless, odorless, and nearly colorless chemical substance. An atmosphere (from Ancient Greek  ἀτμός (atmós) 'vapour, steam' and  σφαῖρα (sphaîra) 'sphere') is a layer of gases that envelop an astronomical object, held in place by the gravity of the object. A planet retains an atmosphere when the gravity is great and the temperature of the atmosphere is low. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A  frisbee (pronounced  FRIZ-bee), also called a flying disc or simply a disc, is a gliding toy or sporting item generally made of injection-molded plastic and roughly 20 to 25 centimetres (8 to 10 in) in diameter with a pronounced lip. It is used recreationally and competitively for throwing and catching, as in flying disc games.", "faiss_indices": [230, 53, 207]}
{"image_path": "data/images/000000088432.jpg", "query": "Summarize the visual elements in this picture.", "caption": "Some street signs near a road with a truck. A road is a thoroughfare used primarily for movement of traffic. Roads differ from streets, whose primary use is local access. A truck or lorry is a motor vehicle designed to transport freight, carry specialized payloads, or perform other utilitarian work. Trucks vary greatly in size, power, and configuration, but the vast majority feature body-on-frame construction, with a cabin that is independent of the payload portion of the vehicle.", "faiss_indices": [275, 287, 150]}
{"image_path": "data/images/000000206027.jpg", "query": "Explain the contents of the image.", "caption": "A slice of pizza that is on top of a napkin. Top most commonly refers to:\n\nTop, a basic term of orientation, distinguished from bottom, front, back, and sides\nSpinning top, a ubiquitous traditional toy\nTop (clothing), clothing designed to be worn over the torso\nMountain top, a mountain peak located at some distance from the nearest point of higher elevation\nTop may also refer to: A napkin, serviette or face towelette is a square of cloth or paper tissue used at the table for wiping the mouth and fingers while eating. It is also sometimes used as a bib by tucking it into a shirt collar. Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples. That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe.", "faiss_indices": [52, 278, 273]}
{"image_path": "data/images/000000568147.jpg", "query": "What is happening in this image?", "caption": "A parking meter has some colored wrap around the pole The metre (or meter in US spelling; symbol: m) is the base unit of length in the International System of Units (SI). Since 2019, the metre has been defined as the length of the path travelled by light in vacuum during a time interval of ⁠1/299792458⁠ of a second, where the second is defined by a hyperfine transition frequency of caesium.\nThe metre was originally defined in 1791 by the French National Assembly as one ten-millionth of the distance from the equator to the North Pole along a great circle, so the Earth's polar circumference is approximately 40000 km.\nIn 1799, the metre was redefined in terms of a prototype metre bar.", "faiss_indices": [178, 51, 111]}
{"image_path": "data/images/000000303908.jpg", "query": "What is happening in this image?", "caption": "An empty wooden bench near the waters edge.", "faiss_indices": [53, 207, 158]}
{"image_path": "data/images/000000063602.jpg", "query": "Describe everything visible in the image.", "caption": "A computer sits on a desk by a printer. A computer is a machine that can be programmed to automatically carry out sequences of arithmetic or logical operations (computation). Modern digital electronic computers can perform generic sets of operations known as programs, which enable computers to perform a wide range of tasks. A desk or bureau is a piece of furniture with a flat table-style work surface used in a school, office, home or the like for academic, professional or domestic activities such as reading, writing, or using equipment such as a computer. Desks often have one or more drawers, compartments, or pigeonholes to store items such as office supplies and papers.", "faiss_indices": [233, 245, 176]}
{"image_path": "data/images/000000521540.jpg", "query": "What can be seen here?", "caption": "A plate with a banana that is cut up, cookies and a spoon on it. A banana is an elongated, edible fruit – botanically a berry – produced by several kinds of large treelike herbaceous flowering plants in the genus Musa. In some countries, cooking bananas are called plantains, distinguishing them from dessert bananas. That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe. A cookie is a sweet biscuit with high sugar and fat content. Cookie dough is softer than that used for other types of biscuit, and they are cooked longer at lower temperatures. A spoon (UK: , US:  SPOON) is a utensil consisting of a shallow bowl (also known as a head), oval or round, at the end of a handle. A type of cutlery (sometimes called flatware in the United States), especially as part of a place setting, it is used primarily for transferring food to the mouth (eating).", "faiss_indices": [328, 45, 96]}
{"image_path": "data/images/000000558421.jpg", "query": "Describe everything visible in the image.", "caption": "Blue and yellow train that is heading down the tracks That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe. A train (from Old French trahiner, from Latin trahere, \"to pull, to draw\") is a series of connected vehicles that run along a railway track and transport people or freight. Trains are typically pulled or pushed by locomotives (often known simply as \"engines\"), though some are self-propelled, such as multiple units or railcars.", "faiss_indices": [313, 141, 99]}
{"image_path": "data/images/000000140076.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A made up dinner table with a flower vase on the table. A vase ( or ) is an open container. It can be made from a number of materials, such as ceramics, glass, non-rusting metals, such as aluminium, brass, bronze, or stainless steel.", "faiss_indices": [109, 273, 245]}
{"image_path": "data/images/000000146363.jpg", "query": "Explain the contents of the image.", "caption": "A beach chair with an umbrella on a beach by the water. A beach is a landform alongside a body of water which consists of loose particles. The particles composing a beach are typically made from rock, such as sand, gravel, shingle, pebbles, etc., or biological sources, such as mollusc shells or coralline algae. An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain. A chair is a type of seat, typically designed for one person and consisting of one or more legs, a flat or slightly angled seat and a back-rest. It may be made of wood, metal, or synthetic materials, and may be padded or upholstered in various colors and fabrics.\nChairs vary in design. Water is an inorganic compound with the chemical formula H2O. It is a transparent, tasteless, odorless, and nearly colorless chemical substance.", "faiss_indices": [259, 195, 111]}
{"image_path": "data/images/000000218362.jpg", "query": "Describe everything visible in the image.", "caption": "A large digital clock mounted to a wall. A wall is a structure and a surface that defines an area; carries a load; provides security, shelter, or soundproofing; or serves a decorative purpose. There are various types of walls, including border barriers between countries, brick walls, defensive walls in fortifications, and retaining walls that hold back dirt, stone, water, or noise. A clock or chronometer is a device that measures and displays time. The clock is one of the oldest human inventions, meeting the need to measure intervals of time shorter than the natural units such as the day, the lunar month, and the year.", "faiss_indices": [161, 14, 125]}
{"image_path": "data/images/000000376206.jpg", "query": "What can be seen here?", "caption": "A man on a surfboard  surfing a nice big wave A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A surfboard is a narrow plank used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave. In physics, mathematics, engineering, and related fields, a wave is a propagating dynamic disturbance (change from equilibrium) of one or more quantities. Periodic waves oscillate repeatedly about an equilibrium (resting) value at some frequency.", "faiss_indices": [53, 207, 75]}
{"image_path": "data/images/000000401244.jpg", "query": "Describe everything visible in the image.", "caption": "A guy gets ready to throw a Frisbee during a game. A game is a structured type of play usually undertaken for entertainment or fun, and sometimes used as an educational tool. Many games are also considered to be work (such as professional players of spectator sports or video games) or art (such as games involving an artistic layout such as mahjong, solitaire, or some video games).\nGames have a wide range of occasions, reflecting both the generality of its concept and the variety of its play. A  frisbee (pronounced  FRIZ-bee), also called a flying disc or simply a disc, is a gliding toy or sporting item generally made of injection-molded plastic and roughly 20 to 25 centimetres (8 to 10 in) in diameter with a pronounced lip. It is used recreationally and competitively for throwing and catching, as in flying disc games.", "faiss_indices": [230, 4, 181]}
{"image_path": "data/images/000000248314.jpg", "query": "What can be seen here?", "caption": "An office desk with computer equipment, calculator, and work papers holds an employee's working lunch of soup, rice, and vegetables. A desk or bureau is a piece of furniture with a flat table-style work surface used in a school, office, home or the like for academic, professional or domestic activities such as reading, writing, or using equipment such as a computer. Desks often have one or more drawers, compartments, or pigeonholes to store items such as office supplies and papers. Vegetables are edible parts of plants that are consumed by humans or other animals as food. This original meaning is still commonly used, and is applied to plants collectively to refer to all edible plant matter, including flowers, fruits, stems, leaves, roots, and seeds. Rice is a cereal grain and in its domesticated form is the staple food of over half of the world's population, particularly in Asia and Africa. Rice is the seed of the grass species Oryza sativa (Asian rice)—or, much less commonly, Oryza glaberrima (African rice). Equipment most commonly refers to a set of tools or other objects commonly used to achieve a particular objective. Different jobs require different kinds of equipment. Soup is a primarily liquid food, generally served warm or hot – though it is sometimes served chilled – made by cooking or otherwise combining meat or vegetables with stock, milk, or water. According to The Oxford Companion to Food (OCF), \"soup\" is \"the most general of the terms which apply to liquid savoury dishes\"; others include broth, bisque, consommé, potage and many more. An electronic calculator is typically a portable electronic device used to perform calculations, ranging from basic arithmetic to complex mathematics.\nThe first solid-state electronic calculator was created in the early 1960s. Pocket-sized devices became available in the 1970s, especially after the Intel 4004, the first microprocessor, was developed by Intel for the Japanese calculator company Busicom. Paper is a thin, flat material produced by the compression of fibres.\nPaper(s) or The Paper may also refer to: Lunch is a meal typically consumed around the middle of the day, following breakfast and preceding dinner. It varies in form, size, and significance across cultures and historical periods.", "faiss_indices": [245, 291, 17]}
{"image_path": "data/images/000000203389.jpg", "query": "What is the subject of this image?", "caption": "A group of people riding motorcycles in the woods. A group is a number of persons or things that are located, gathered, or classed together. A motorcycle (motorbike, bike; uni (if one-wheeled); trike (if three-wheeled); quad (if four-wheeled)) is a lightweight private 1-to-2 passenger personal motor vehicle steered by a handlebar from a saddle-style seat.\nMotorcycle designs vary greatly to suit a range of different purposes: long-distance travel, commuting, cruising, sport (including racing), and off-road riding. Motorcycling is riding a motorcycle and being involved in other related social activities such as joining a motorcycle club and attending motorcycle rallies.\nThe 1885 Daimler Reitwagen made by Gottlieb Daimler and Wilhelm Maybach in Germany was the first internal combustion, petroleum-fueled motorcycle. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty.", "faiss_indices": [39, 63, 5]}
{"image_path": "data/images/000000447313.jpg", "query": "Provide a description of this image.", "caption": "Three zebras eating hay at the edge of a forest. A forest is an ecosystem characterized by a dense community of trees. Hundreds of definitions of forest are used throughout the world, incorporating factors such as tree density, tree height, land use, legal standing, and ecological function. Zebras (US: , UK: ) (subgenus Hippotigris) are African equines with distinctive black-and-white striped coats. There are three living species: Grévy's zebra (Equus grevyi), the plains zebra (E. Hay is grass, legumes, or other herbaceous plants that have been cut and dried to be stored for use as animal fodder, either for large grazing animals raised as livestock, such as cattle, horses, goats, and sheep, or for smaller domesticated animals such as rabbits and guinea pigs. Pigs can eat hay, but do not digest it as efficiently as herbivores do.\nHay can be used as animal fodder when or where there is not enough pasture or rangeland on which to graze an animal, when grazing is not feasible due to weather (such as during the winter), or when lush pasture by itself would be too rich for the health of the animal.", "faiss_indices": [33, 3, 298]}
{"image_path": "data/images/000000432553.jpg", "query": "Provide a description of this image.", "caption": "A couple of dogs viewing something as a person sits in a chair. The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers. A person (pl.: people or persons, depending on context) is a being who has certain capacities or attributes such as reason, morality, consciousness or self-consciousness, and being a part of a culturally established form of social relations such as kinship, ownership of property, or legal responsibility. The defining features of personhood and, consequently, what makes a person count as a person, differ widely among cultures and contexts.\nIn addition to the question of personhood, of what makes a being count as a person to begin with, there are further questions about personal identity and self: both about what makes any particular person that particular person instead of another, and about what makes a person at one time the same person as they were or will be at another time despite any intervening changes.\nThe plural form \"people\" is often used to refer to an entire nation or ethnic group (as in \"a people\"), and this was the original meaning of the word; it subsequently acquired its A chair is a type of seat, typically designed for one person and consisting of one or more legs, a flat or slightly angled seat and a back-rest. It may be made of wood, metal, or synthetic materials, and may be padded or upholstered in various colors and fabrics.\nChairs vary in design.", "faiss_indices": [308, 294, 195]}
{"image_path": "data/images/000000219485.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A grey cat standing in a window with grey lining. A window is an opening in a wall, door, roof, or vehicle that allows the exchange of light and may also allow the passage of sound and sometimes air. Modern windows are usually glazed or covered in some other transparent or translucent material, a sash set in a frame in the opening; the sash and frame are also referred to as a window. The cat (Felis catus), also referred to as the domestic cat or house cat, is a small domesticated carnivorous mammal. It is the only domesticated species of the family Felidae.", "faiss_indices": [192, 182, 130]}
{"image_path": "data/images/000000458255.jpg", "query": "Explain the contents of the image.", "caption": "A girl reading a book in bed with a cat A girl is a young female human, usually a child or an adolescent. While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture. A book is a structured presentation of recorded information, primarily verbal and graphical, through a medium. Originally physical, electronic books and audiobooks are now existent. A bed is a piece of furniture that is used as a place to sleep, rest, and relax.\nMost modern beds consist of a soft, cushioned mattress on a bed frame. The mattress rests either on a solid base, often wood slats, or a sprung base. The cat (Felis catus), also referred to as the domestic cat or house cat, is a small domesticated carnivorous mammal. It is the only domesticated species of the family Felidae.", "faiss_indices": [192, 182, 321]}
{"image_path": "data/images/000000121506.jpg", "query": "Provide a description of this image.", "caption": "A beige outdoor umbrella is blown upside down. An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain.", "faiss_indices": [111, 71, 124]}
{"image_path": "data/images/000000427160.jpg", "query": "Explain the contents of the image.", "caption": "a bunch of little boys running around on a baseball field A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [113, 4, 82]}
{"image_path": "data/images/000000187734.jpg", "query": "What is the subject of this image?", "caption": "Man and women gather around to play a video game. A game is a structured type of play usually undertaken for entertainment or fun, and sometimes used as an educational tool. Many games are also considered to be work (such as professional players of spectator sports or video games) or art (such as games involving an artistic layout such as mahjong, solitaire, or some video games).\nGames have a wide range of occasions, reflecting both the generality of its concept and the variety of its play. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [226, 181, 229]}
{"image_path": "data/images/000000520264.jpg", "query": "What can be seen here?", "caption": "A man and a woman stand next to each other in a kitchen. A kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment. A modern middle-class residential kitchen is typically equipped with a stove, a sink with hot and cold running water, a refrigerator, and worktops and kitchen cabinets arranged according to a modular design. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [329, 21, 309]}
{"image_path": "data/images/000000520301.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A brown dog is looking outside of the car window. A window is an opening in a wall, door, roof, or vehicle that allows the exchange of light and may also allow the passage of sound and sometimes air. Modern windows are usually glazed or covered in some other transparent or translucent material, a sash set in a frame in the opening; the sash and frame are also referred to as a window. The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers.", "faiss_indices": [130, 308, 294]}
{"image_path": "data/images/000000100582.jpg", "query": "Tell me what's going on in the photo.", "caption": "Small personal pizza with bacon and spinach. Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples. Spinach (Spinacia oleracea) is a leafy green flowering plant native to Central and Western Asia. It is of the order Caryophyllales, family Amaranthaceae, subfamily Chenopodioideae. Bacon is a type of salt-cured pork made from various cuts, typically the belly or less fatty parts of the back. It is eaten as a side dish (particularly in breakfasts), used as a central ingredient (e.g., the BLT sandwich), or as a flavouring or accent.", "faiss_indices": [278, 52, 10]}
{"image_path": "data/images/000000044652.jpg", "query": "What does this picture show?", "caption": "An airplane is flying high in the cloudy sky An airplane (American English), or aeroplane (Commonwealth English), informally plane, is a fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller, or rocket engine. Airplanes come in a variety of sizes, shapes, and wing configurations. The sky is an unobstructed view upward from the surface of the Earth. It includes the atmosphere and outer space.", "faiss_indices": [323, 203, 16]}
{"image_path": "data/images/000000263594.jpg", "query": "What does this picture show?", "caption": "A white care is sitting in a handicapped parking spot.", "faiss_indices": [316, 259, 195]}
{"image_path": "data/images/000000065455.jpg", "query": "What can be seen here?", "caption": "A group of giraffe Standing up against a dirt wall in front of a crowd of children. A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. A wall is a structure and a surface that defines an area; carries a load; provides security, shelter, or soundproofing; or serves a decorative purpose. There are various types of walls, including border barriers between countries, brick walls, defensive walls in fortifications, and retaining walls that hold back dirt, stone, water, or noise. A crowd is as a group of people that have gathered for a common purpose or intent. Examples are a demonstration, a sports event, or a looting (classified in sociology as an acting crowd). A group is a number of persons or things that are located, gathered, or classed together.", "faiss_indices": [272, 38, 50]}
{"image_path": "data/images/000000179898.jpg", "query": "What can be seen here?", "caption": "A boy standing in front of his class holding a hot dog in each hand. The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers. A hand is a prehensile, multi-fingered appendage located at the end of the forearm or forelimb of primates such as humans, chimpanzees, monkeys, and lemurs. A few other vertebrates such as the koala (which has two opposable thumbs on each \"hand\" and fingerprints extremely similar to human fingerprints) are often described as having \"hands\" instead of paws on their front limbs. A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [148, 44, 294]}
{"image_path": "data/images/000000310622.jpg", "query": "Explain the contents of the image.", "caption": "A cluster of street signs hang on a street pole.", "faiss_indices": [275, 287, 249]}
{"image_path": "data/images/000000060899.jpg", "query": "Tell me what's going on in the photo.", "caption": "A little boy has a hairbrush in his hands. A hand is a prehensile, multi-fingered appendage located at the end of the forearm or forelimb of primates such as humans, chimpanzees, monkeys, and lemurs. A few other vertebrates such as the koala (which has two opposable thumbs on each \"hand\" and fingerprints extremely similar to human fingerprints) are often described as having \"hands\" instead of paws on their front limbs. A hairbrush is a brush with rigid (hard or inflexible) or light and soft spokes used in hair care for smoothing, styling, and detangling human hair, or for grooming an animal's fur. It can also be used for styling in combination with a curling iron or hair dryer.\n\nA brush is normally used for detangling hair, for example after sleep or showering. A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [143, 98, 170]}
{"image_path": "data/images/000000102707.jpg", "query": "Provide a description of this image.", "caption": "Utensils and containers line the sink in a kitchen. A kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment. A modern middle-class residential kitchen is typically equipped with a stove, a sink with hot and cold running water, a refrigerator, and worktops and kitchen cabinets arranged according to a modular design. A sink (also known as basin in the UK) is a bowl-shaped plumbing fixture for washing hands, dishwashing, and other purposes. Sinks have a tap (faucet) that supplies hot and cold water and may include a spray feature to be used for faster rinsing. A container is any receptacle or enclosure for holding a product used in storage, packaging, and transportation, including shipping.\nThings kept inside of a container are protected on several sides by being inside of its structure. The term is most frequently applied to devices made from materials that are durable and are often partly or completely rigid.\nA container can also be considered as a basic tool, consisting of any device creating a partially or fully enclosed space that can be used to contain, store, and transport objects or materials.", "faiss_indices": [188, 256, 329]}
{"image_path": "data/images/000000149622.jpg", "query": "Can you describe the scene?", "caption": "Two owls sitting together on a tree branch. A branch, also called a ramus in botany, is a stem that grows off from another stem, or when structures like veins in leaves are divided into smaller veins. Owls are birds from the order Strigiformes (), which includes over 200 species of mostly solitary and nocturnal birds of prey typified by an upright stance, a large, broad head, binocular vision, binaural hearing, sharp talons, and feathers adapted for silent flight. Exceptions include the diurnal northern hawk-owl and the gregarious burrowing owl.\nOwls are divided into two families: the true (or typical) owl family, Strigidae, and the barn owl and bay owl family, Tytonidae.", "faiss_indices": [90, 184, 24]}
{"image_path": "data/images/000000182923.jpg", "query": "Provide a description of this image.", "caption": "There is a woman jumping in the area during a tennis game. A game is a structured type of play usually undertaken for entertainment or fun, and sometimes used as an educational tool. Many games are also considered to be work (such as professional players of spectator sports or video games) or art (such as games involving an artistic layout such as mahjong, solitaire, or some video games).\nGames have a wide range of occasions, reflecting both the generality of its concept and the variety of its play. Area is the measure of a region's size on a surface. The area of a plane region or plane area refers to the area of a shape or planar lamina, while surface area refers to the area of an open surface or the boundary of a three-dimensional object. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [235, 82, 86]}
{"image_path": "data/images/000000092091.jpg", "query": "What is happening in this image?", "caption": "A baby girl chews on a stick with a teddy bear in hand. A girl is a young female human, usually a child or an adolescent. While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture. A hand is a prehensile, multi-fingered appendage located at the end of the forearm or forelimb of primates such as humans, chimpanzees, monkeys, and lemurs. A few other vertebrates such as the koala (which has two opposable thumbs on each \"hand\" and fingerprints extremely similar to human fingerprints) are often described as having \"hands\" instead of paws on their front limbs. Bears are carnivoran mammals of the family Ursidae (). They are classified as caniforms, or doglike carnivorans.", "faiss_indices": [119, 239, 155]}
{"image_path": "data/images/000000545129.jpg", "query": "Tell me what's going on in the photo.", "caption": "Three zebras standing in a sandy desert area. Zebras (US: , UK: ) (subgenus Hippotigris) are African equines with distinctive black-and-white striped coats. There are three living species: Grévy's zebra (Equus grevyi), the plains zebra (E. Area is the measure of a region's size on a surface. The area of a plane region or plane area refers to the area of a shape or planar lamina, while surface area refers to the area of an open surface or the boundary of a three-dimensional object.", "faiss_indices": [33, 3, 38]}
{"image_path": "data/images/000000417285.jpg", "query": "Explain the contents of the image.", "caption": "Three images of a pie and a cup of tea or coffee. A pie is a baked dish which is usually made of a pastry dough casing that contains a filling of various sweet or savoury ingredients. Sweet pies may be filled with fruit (as in an apple pie), nuts (pecan pie), fruit preserves (jam tart), brown sugar (sugar pie), sweetened vegetables (rhubarb pie), or with thicker fillings based on eggs and dairy (as in custard pie and cream pie). A cup is a small container used to hold liquids for drinking, typically with a flattened hemispherical shape, and often with a capacity of about 6–16 US fluid ounces (177–473 ml). Cups may be made of pottery (including porcelain), glass, metal, wood, stone, polystyrene, plastic, lacquerware, or other materials. Coffee is a beverage brewed from roasted, ground coffee beans. Darkly colored, bitter, and slightly acidic, coffee has a stimulating effect on humans, primarily due to its caffeine content, but decaffeinated coffee is also commercially available. An image or picture is a visual representation. An image can be two-dimensional, such as a drawing, painting, or photograph, or three-dimensional, such as a carving or sculpture. Tea is an aromatic beverage prepared by pouring hot or boiling water over cured or fresh leaves of Camellia sinensis, an evergreen shrub native to East Asia which probably originated in the borderlands of south-western China and northern Myanmar. Tea is also made, but rarely, from the leaves of Camellia taliensis.", "faiss_indices": [48, 96, 47]}
{"image_path": "data/images/000000574425.jpg", "query": "What is happening in this image?", "caption": "A red and black big transportation truck or bus parked on the side of a road. A truck or lorry is a motor vehicle designed to transport freight, carry specialized payloads, or perform other utilitarian work. Trucks vary greatly in size, power, and configuration, but the vast majority feature body-on-frame construction, with a cabin that is independent of the payload portion of the vehicle. A bus (contracted from omnibus, with variants multibus, motorbus, autobus, etc.) is a motor vehicle that carries significantly more passengers than an average car or van, but fewer than the average rail transport. It is most commonly used in public transport, but is also in use for charter purposes, or through private ownership. A road is a thoroughfare used primarily for movement of traffic. Roads differ from streets, whose primary use is local access.", "faiss_indices": [134, 41, 172]}
{"image_path": "data/images/000000499622.jpg", "query": "Describe everything visible in the image.", "caption": "A cop riding on the back of a motorcycle. The human back, also called the dorsum (pl.: dorsa), is the large posterior area of the human body, rising from the top of the buttocks to the back of the neck. It is the surface of the body opposite from the chest and the abdomen. A motorcycle (motorbike, bike; uni (if one-wheeled); trike (if three-wheeled); quad (if four-wheeled)) is a lightweight private 1-to-2 passenger personal motor vehicle steered by a handlebar from a saddle-style seat.\nMotorcycle designs vary greatly to suit a range of different purposes: long-distance travel, commuting, cruising, sport (including racing), and off-road riding. Motorcycling is riding a motorcycle and being involved in other related social activities such as joining a motorcycle club and attending motorcycle rallies.\nThe 1885 Daimler Reitwagen made by Gottlieb Daimler and Wilhelm Maybach in Germany was the first internal combustion, petroleum-fueled motorcycle.", "faiss_indices": [63, 39, 152]}
{"image_path": "data/images/000000102411.jpg", "query": "What does this picture show?", "caption": "A man riding a motorcycle with a woman on the back. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause. The human back, also called the dorsum (pl.: dorsa), is the large posterior area of the human body, rising from the top of the buttocks to the back of the neck. It is the surface of the body opposite from the chest and the abdomen. A motorcycle (motorbike, bike; uni (if one-wheeled); trike (if three-wheeled); quad (if four-wheeled)) is a lightweight private 1-to-2 passenger personal motor vehicle steered by a handlebar from a saddle-style seat.\nMotorcycle designs vary greatly to suit a range of different purposes: long-distance travel, commuting, cruising, sport (including racing), and off-road riding. Motorcycling is riding a motorcycle and being involved in other related social activities such as joining a motorcycle club and attending motorcycle rallies.\nThe 1885 Daimler Reitwagen made by Gottlieb Daimler and Wilhelm Maybach in Germany was the first internal combustion, petroleum-fueled motorcycle.", "faiss_indices": [63, 39, 152]}
{"image_path": "data/images/000000170955.jpg", "query": "What can be seen here?", "caption": "A president in a nice suit walking near a building. A suit, also called a lounge suit, business suit, dress suit, or formal suit, is a set of clothes comprising a suit jacket and trousers of identical textiles generally worn with a collared dress shirt, necktie, and dress shoes. A skirt suit is similar, but with a matching skirt instead of trousers. A building or edifice is an enclosed structure with a roof, walls and often windows, usually standing permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for numerous factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, prestige, and aesthetic reasons. President most commonly refers to:\n\nPresident (corporate title)\nPresident (education), a leader of a college or university\nPresident (government title)\nPresident may also refer to:", "faiss_indices": [246, 185, 28]}
{"image_path": "data/images/000000378453.jpg", "query": "What does this picture show?", "caption": "A herd of zebras standing on a sandy platform near a small body of water. A herd is a social group of certain animals of the same species, either wild or domestic. The form of collective animal behavior associated with this is called herding. Water is an inorganic compound with the chemical formula H2O. It is a transparent, tasteless, odorless, and nearly colorless chemical substance. Zebras (US: , UK: ) (subgenus Hippotigris) are African equines with distinctive black-and-white striped coats. There are three living species: Grévy's zebra (Equus grevyi), the plains zebra (E.", "faiss_indices": [33, 3, 50]}
{"image_path": "data/images/000000419974.jpg", "query": "What does this picture show?", "caption": "A dog sits waiting while his owner cuts some meat. Ownership is the state or fact of legal possession and control over property, which may be any asset, tangible or intangible. Ownership can involve multiple rights, collectively referred to as title, which may be separated and held by different parties.\nThe process and mechanics of ownership are fairly complex: one can gain, transfer, and lose ownership of property in a number of ways. Meat is animal tissue, often muscle, that is eaten as food. Humans have hunted and farmed other animals for meat since prehistory. The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers.", "faiss_indices": [206, 308, 294]}
{"image_path": "data/images/000000015335.jpg", "query": "What does this picture show?", "caption": "A man, woman and child eating together at a restaurant. A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. A restaurant is an establishment that prepares and serves food and drinks to customers. Meals are generally served and eaten on the premises, but many restaurants also offer take-out and food delivery services. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause.", "faiss_indices": [131, 205, 17]}
{"image_path": "data/images/000000527220.jpg", "query": "What can be seen here?", "caption": "A red Ferrari at a gas station showing the gas prices and three mopeds A price is the (usually not negative) quantity of payment or compensation expected, required, or given by one party to another in return for goods or services. In some situations, especially when the product is a service rather than a physical good, the price for the service may be called something else such as \"rent\" or \"tuition\". Ferrari S.p.A. (; Italian: [ferˈraːri]) is an Italian luxury sports car manufacturer based in Maranello. A moped ( MOH-ped) is a type of small motorcycle, generally having a less stringent licensing requirement than full motorcycles or automobiles. Historically, the term exclusively meant a similar vehicle with both bicycle pedals and a motorcycle engine.", "faiss_indices": [315, 152, 196]}
{"image_path": "data/images/000000051314.jpg", "query": "What does this picture show?", "caption": "A surfer in a wetsuit sliding through the water. A wetsuit is a garment worn to provide thermal protection while wet. It is usually made of foamed neoprene, and is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports and other activities in or on the water. Water is an inorganic compound with the chemical formula H2O. It is a transparent, tasteless, odorless, and nearly colorless chemical substance. Surfing is a surface water sport in which an individual, a surfer (or two in tandem surfing), uses a board to ride on the forward section, or face, of a moving wave of water, which usually carries the surfer towards the shore. Waves suitable for surfing are primarily found on ocean shores, but can also be found as standing waves in the open ocean, in lakes, in rivers in the form of a tidal bore, or wave pools.\nSurfing includes all forms of wave-riding using a board, regardless of the stance.", "faiss_indices": [31, 53, 207]}
{"image_path": "data/images/000000135673.jpg", "query": "Summarize the visual elements in this picture.", "caption": "A pro plane and a jet play flying close to each other in the sky. Plane most often refers to:\n\nAero- or airplane, a powered, fixed-wing aircraft\nPlane (geometry), a flat, 2-dimensional surface\nPlane (mathematics), generalizations of a geometrical plane\nPlane or planes may also refer to: The sky is an unobstructed view upward from the surface of the Earth. It includes the atmosphere and outer space.", "faiss_indices": [16, 203, 230]}
{"image_path": "data/images/000000472030.jpg", "query": "Describe everything visible in the image.", "caption": "A lush green forest filled with lots of trees. In botany, a tree is a perennial plant with an elongated stem, or trunk, usually supporting branches and leaves. In some usages, the definition of a tree may be narrower, e.g., including only woody plants with secondary growth, only plants that are usable as lumber, or only plants above a specified height. A forest is an ecosystem characterized by a dense community of trees. Hundreds of definitions of forest are used throughout the world, incorporating factors such as tree density, tree height, land use, legal standing, and ecological function.", "faiss_indices": [77, 144, 95]}
{"image_path": "data/images/000000513041.jpg", "query": "Can you describe the scene?", "caption": "A pizza on a wooden plate near glasses of wine. Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples. Wine is an alcoholic drink made from fermented fruit. Yeast consumes the sugar in the fruit and converts it to ethanol and carbon dioxide, releasing heat in the process. Glasses, also known as eyeglasses (American English), spectacles (Commonwealth English), or colloquially as specs, are vision eyewear with clear or tinted lenses mounted in a frame that holds them in front of a person's eyes, typically utilizing a bridge over the nose and hinged arms, known as temples or temple pieces, that rest over the ears for support.\nGlasses are typically used for vision correction, such as with reading glasses and glasses used for nearsightedness; however, without the specialized lenses, they are sometimes used for cosmetic purposes. \nSafety glasses are eye protection, a form of personal protective equipment (PPE) that are worn by workers around their eyes for protection.", "faiss_indices": [52, 278, 131]}
{"image_path": "data/images/000000507893.jpg", "query": "What is happening in this image?", "caption": "A door opens to a plain, white bathroom. A bathroom is a room in which people wash their bodies or parts thereof. It can contain one or more of the following plumbing fixtures: a shower, a bathtub, a bidet, and a sink (also known as a wash basin in the United Kingdom). A door is a hinged or otherwise movable barrier that allows ingress (entry) into and egress (exit) from an enclosure. The created opening in the wall is a doorway or portal.", "faiss_indices": [306, 108, 43]}
{"image_path": "data/images/000000497344.jpg", "query": "What can be seen here?", "caption": "A little boy talking on the phone and playing with a computer. A telephone, colloquially referred to as a phone, is a telecommunications device that enables two or more users to conduct a conversation when they are too far apart to be easily heard directly. A telephone converts sound, typically and most efficiently the human voice, into electronic signals that are transmitted via cables and other communication channels to another telephone which reproduces the sound to the receiving user. A computer is a machine that can be programmed to automatically carry out sequences of arithmetic or logical operations (computation). Modern digital electronic computers can perform generic sets of operations known as programs, which enable computers to perform a wide range of tasks. A boy is a young male human. The term is commonly used for a child or an adolescent.", "faiss_indices": [20, 255, 170]}
{"image_path": "data/images/000000462629.jpg", "query": "Provide a description of this image.", "caption": "Tall boxes are stacked on a brown sidewalk.outside. A box (plural: boxes) is a container with rigid sides used for the storage or transportation of its contents. Most boxes have flat, parallel, rectangular sides (typically rectangular prisms).", "faiss_indices": [174, 149, 99]}
{"image_path": "data/images/000000080273.jpg", "query": "What is the subject of this image?", "caption": "A man snowboards down a snowy hill. A hill is a landform that extends above the surrounding terrain. It often has a distinct summit, and is usually applied to peaks which are above elevation compared to the relative landmass, though not as prominent as mountains. A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father.", "faiss_indices": [187, 122, 317]}
