{"title": "building", "content": "A building or edifice is an enclosed structure with a roof, walls and often windows, usually standing permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for numerous factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, prestige, and aesthetic reasons. To better understand the concept, see Nonbuilding structure for contrast.  \nBuildings serve several societal needs – occupancy, primarily as shelter from weather, security, living space, privacy, to store belongings, and to comfortably live and work. A building as a shelter represents a physical separation of the human habitat (a place of comfort and safety) from the outside (a place that may be harsh and harmful at times).\nbuildings have been objects or canvasses of much artistic expression. In recent years, interest in sustainable planning and building practices has become "}
{"title": "bed", "content": "A bed is a piece of furniture that is used as a place to sleep, rest, and relax.\nMost modern beds consist of a soft, cushioned mattress on a bed frame. The mattress rests either on a solid base, often wood slats, or a sprung base. Many beds include a box spring inner-sprung base, which is a large mattress-sized box containing wood and springs that provide additional support and suspension for the mattress. Beds are available in many sizes, ranging from infant-sized bassinets and cribs, to small beds for a single person or adult, to large queen and king-size beds designed for two people. While most beds are single mattresses on a fixed frame, there are other varieties, such as the murphy bed, which folds into a wall, the sofa bed, which folds out of a sofa, the trundle bed, which is stored under a low, twin-sized bed and can be rolled out to create a larger sleeping area, and the bunk bed, which provides two mattresses on two tiers as well as a ladder to access the upper tier. Temporary"}
{"title": "heads", "content": "A head is the part of an organism which usually includes the ears, brain, forehead, cheeks, chin, eyes, nose, and mouth, each of which aid in various sensory functions such as sight, hearing, smell, and taste. Some very simple animals may not have a head, but many bilaterally symmetric forms do, regardless of size. \nHeads develop in animals by an evolutionary trend known as cephalization. In bilaterally symmetrical animals, nervous tissue concentrate at the anterior region, forming structures responsible for information processing. Through biological evolution, sense organs and feeding structures also concentrate into the anterior region; these collectively form the head."}
{"title": "restaurant", "content": "A restaurant is an establishment that prepares and serves food and drinks to customers. Meals are generally served and eaten on the premises, but many restaurants also offer take-out and food delivery services. Restaurants vary greatly in appearance and offerings, including a wide variety of cuisines and service models ranging from inexpensive fast-food restaurants and cafeterias to mid-priced family restaurants, to high-priced luxury establishments."}
{"title": "lady", "content": "Lady is a term for a woman who behaves in a polite way. Once used to describe only women of a high social class or status, the female counterpart of lord, now it may refer to any adult woman, as gentleman can be used for men.  \n\"Lady\" is also a formal title in the United Kingdom. \"Lady\" is used before the family name or peerage of a woman with a title of nobility or honorary title suo jure (in her own right), such as female members of the Order of the Garter and Order of the Thistle, or the wife of a lord, a baronet, Scottish feudal baron, laird, or a knight, and also before the first name of the daughter of a duke, marquess, or earl."}
{"title": "phone", "content": "A telephone, colloquially referred to as a phone, is a telecommunications device that enables two or more users to conduct a conversation when they are too far apart to be easily heard directly. A telephone converts sound, typically and most efficiently the human voice, into electronic signals that are transmitted via cables and other communication channels to another telephone which reproduces the sound to the receiving user. The term is derived from Ancient Greek: τῆλε, romanized: tēle, lit. 'far' and φωνή (phōnē, voice), together meaning distant voice.\nIn 1876, Alexander Graham Bell was the first to be granted a United States patent for a device that produced clearly intelligible replication of the human voice at a second device. This instrument was further developed by many others, and became rapidly indispensable in business, government, and in households.\nThe essential elements of a telephone are a microphone (transmitter) to speak into and an earphone (receiver) which reproduces"}
{"title": "surfers", "content": "Surfing is a surface water sport in which an individual, a surfer (or two in tandem surfing), uses a board to ride on the forward section, or face, of a moving wave of water, which usually carries the surfer towards the shore. Waves suitable for surfing are primarily found on ocean shores, but can also be found as standing waves in the open ocean, in lakes, in rivers in the form of a tidal bore, or wave pools.\nSurfing includes all forms of wave-riding using a board, regardless of the stance. There are several types of boards. The Moche of Peru would often surf on reed craft, while the native peoples of the Pacific surfed waves on alaia, paipo, and other such watercraft. Ancient cultures often surfed on their belly and knees, while modern-day surfing is most often stand-up surfing, in which a surfer rides a wave while standing on a surfboard.\nAnother prominent form of surfing is body boarding, where a surfer rides the wave on a bodyboard, either lying on their belly, drop knee (one foot"}
{"title": "skiers", "content": "Skiing is the use of skis to glide on snow for basic transport, a recreational activity, or a competitive winter sport. Many types of competitive skiing events are recognized by the International Olympic Committee (IOC), and the International Ski and Snowboard Federation (FIS)."}
{"title": "picture", "content": "An image or picture is a visual representation. An image can be two-dimensional, such as a drawing, painting, or photograph, or three-dimensional, such as a carving or sculpture. Images may be displayed through other media, including a projection on a surface, activation of electronic signals, or digital displays; they can also be reproduced through mechanical means, such as photography, printmaking, or photocopying. Images can also be animated through digital or physical processes.\nIn the context of signal processing, an image is a distributed amplitude of color(s). In optics, the term image (or optical image) refers specifically to the reproduction of an object formed by light waves coming from the object.\nA volatile image exists or is perceived only for a short period. This may be a reflection of an object by a mirror, a projection of a camera obscura, or a scene displayed on a cathode-ray tube. A fixed image, also called a hard copy, is one that has been recorded on a material obje"}
{"title": "colors", "content": "Color (or colour in Commonwealth English; see spelling differences) is the visual perception based on the electromagnetic spectrum. Though color is not an inherent property of matter, color perception is related to an object's light absorption, emission, reflection and transmission. For most humans, colors are perceived in the visible light spectrum with three types of cone cells (trichromacy). Other animals may have a different number of cone cell types or have eyes sensitive to different wavelengths, such as bees that can distinguish ultraviolet, and thus have a different color sensitivity range. Animal perception of color originates from different light wavelength or spectral sensitivity in cone cell types, which is then processed by the brain.\nColors have perceived properties such as hue, colorfulness (saturation), and luminance. Colors can also be additively mixed (commonly used for actual light) or subtractively mixed (commonly used for materials). If the colors are mixed in the "}
{"title": "seat", "content": "A seat is a place to sit. The term may encompass additional features, such as back, armrest, head restraint but may also refer to concentrations of power in a wider sense (i.e \"seat (legal entity)\"). See disambiguation."}
{"title": "people", "content": "The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty. In contrast, a people is any plurality of persons considered as a whole. Used in politics and law, the term \"a people\" refers to the collective or community of an ethnic group or nation."}
{"title": "top", "content": "Top most commonly refers to:\n\nTop, a basic term of orientation, distinguished from bottom, front, back, and sides\nSpinning top, a ubiquitous traditional toy\nTop (clothing), clothing designed to be worn over the torso\nMountain top, a mountain peak located at some distance from the nearest point of higher elevation\nTop may also refer to:"}
{"title": "area", "content": "Area is the measure of a region's size on a surface. The area of a plane region or plane area refers to the area of a shape or planar lamina, while surface area refers to the area of an open surface or the boundary of a three-dimensional object. Area can be understood as the amount of material with a given thickness that would be necessary to fashion a model of the shape, or the amount of paint necessary to cover the surface with a single coat. It is the two-dimensional analogue of the length of a curve (a one-dimensional concept) or the volume of a solid (a three-dimensional concept).\nTwo different regions may have the same area (as in squaring the circle); by synecdoche, \"area\" sometimes is used to refer to the region, as in a \"polygonal area\".\nThe area of a shape can be measured by comparing the shape to squares of a fixed size. In the International System of Units (SI), the standard unit of area is the square metre (written as m2), which is the area of a square whose sides are one "}
{"title": "crowd", "content": "A crowd is as a group of people that have gathered for a common purpose or intent. Examples are a demonstration, a sports event, or a looting (classified in sociology as an acting crowd). A crowd may also simply be made up of many people going about their business in a busy area.\nThe term \"the crowd\" may sometimes refer to the lower orders of people in general."}
{"title": "bike", "content": "A bicycle, also called a pedal cycle, bike, push-bike or cycle, is a human-powered or motor-assisted, pedal-driven, single-track vehicle, with two wheels attached to a frame, one behind the other. A bicycle rider is called a cyclist, or bicyclist.\nBicycles were introduced in the 19th century in Europe. By the early 21st century there were more than 1 billion bicycles. There are many more bicycles than cars. Bicycles are the principal means of transport in many regions. They also provide a popular form of recreation, and have been adapted for use as children's toys. Bicycles are used for fitness, military and police applications, courier services, bicycle racing, and artistic cycling.\nThe basic shape and configuration of a typical upright or \"safety\" bicycle, has changed little since the first chain-driven model was developed around 1885. However, many details have been improved, especially since the advent of modern materials and computer-aided design. These have allowed for a prolifer"}
{"title": "blvd", "content": "A boulevard is a type of broad avenue planted with rows of trees, or in parts of North America, any urban highway or wide road in a commercial district.\nIn Europe, boulevards were originally circumferential roads following the line of former city walls.\nIn North American usage, boulevards may be wide, multi-lane thoroughfares divided with only a central median."}
{"title": "back", "content": "The human back, also called the dorsum (pl.: dorsa), is the large posterior area of the human body, rising from the top of the buttocks to the back of the neck. It is the surface of the body opposite from the chest and the abdomen. The vertebral column runs the length of the back and creates a central area of recession. The breadth of the back is created by the shoulders at the top and the pelvis at the bottom.\nBack pain is a common medical condition, generally benign in origin."}
{"title": "television", "content": "Television (TV) is a telecommunication medium for transmitting moving images and sound. Additionally, the term can refer to a physical television set rather than the medium of transmission. Television is a mass medium for advertising, entertainment, news, and sports. The medium is capable of more than \"radio broadcasting\", which refers to an audio signal sent to radio receivers.\nTelevision became available in crude experimental forms in the 1920s, but only after several years of further development was the new technology marketed to consumers. After World War II, an improved form of black-and-white television broadcasting became popular in the United Kingdom and the United States, and television sets became commonplace in homes, businesses, and institutions. During the 1950s, television was the primary medium for influencing public opinion. In the mid-1960s, color broadcasting was introduced in the U.S. and most other developed countries.\nThe availability of various types of archival s"}
{"title": "salad", "content": "A salad is a dish consisting of mixed ingredients, frequently vegetables. They are typically served chilled or at room temperature, though some can be served warm. Condiments called salad dressings, which exist in a variety of flavors, are usually used to make a salad. \nGarden salads have a base of raw leafy greens (sometimes young \"baby\" greens) such as lettuce, arugula (rocket), kale or spinach; they are common enough that the word salad alone often refers specifically to garden salads. Other types of salad include bean salad, tuna salad, bread salads (such as fattoush, panzanella), vegetable salads without leafy greens (such as Greek salad, potato salad, coleslaw), rice-, pasta- and noodle-based salads, fruit salads and dessert salads.\nSalads may be served at any point during a meal:\n\nAppetizer salads – light, smaller-portion salads served as the first course of the meal\nSide salads – to accompany the main course as a side dish; examples include potato salad and coleslaw\nMain course"}
{"title": "star", "content": "A star is a luminous spheroid of plasma held together by self-gravity. The nearest star to Earth is the Sun. Many other stars are visible to the naked eye at night; their immense distances from Earth make them appear as fixed points of light. The most prominent stars have been categorised into constellations and asterisms, and many of the brightest stars have proper names. Astronomers have assembled star catalogues that identify the known stars and provide standardized stellar designations. The observable universe contains an estimated 1022 to 1024 stars. Only about 4,000 of these stars are visible to the naked eye—all within the Milky Way galaxy.\nA star's life begins with the gravitational collapse of a gaseous nebula of material largely comprising hydrogen, helium, and traces of heavier elements. Its total mass mainly determines its evolution and eventual fate. A star shines for most of its active life due to the thermonuclear fusion of hydrogen into helium in its core. This process "}
{"title": "donuts", "content": "A doughnut or donut () is a type of pastry made from leavened fried dough.: 275  It is popular in many countries and is prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors. Doughnut is the traditional spelling, while donut is the simplified version; the terms are used interchangeably.\nDoughnuts are usually deep fried from a flour dough, but other types of batters can also be used. Various toppings and flavors are used for different types, such as sugar, chocolate or maple glazing. Doughnuts may also include water, leavening, eggs, milk, sugar, oil, shortening, and natural or artificial flavors.\nThe two most common types are the ring doughnut and the filled doughnut, which is injected with fruit preserves (the jelly doughnut), cream, custard, or other sweet fillings. Small pieces of dough are sometimes cooked as doughnut holes. Once fried, doughnuts may be glazed with a sugar icing, spread "}
{"title": "toilet", "content": "A toilet is a piece of sanitary hardware that collects human waste (urine and feces) and sometimes toilet paper, usually for disposal. Flush toilets use water, while dry or non-flush toilets do not. They can be designed for a sitting position popular in Europe and North America with a toilet seat, with additional considerations for those with disabilities, or for a squatting posture more popular in Asia, known as a squat toilet. In urban areas, flush toilets are usually connected to a sewer system; in isolated areas, to a septic tank. The waste is known as blackwater and the combined effluent, including other sources, is sewage. Dry toilets are connected to a pit, removable container, composting chamber, or other storage and treatment device, including urine diversion with a urine-diverting toilet. \"Toilet\" or \"toilets\" is also widely used for rooms containing only one or more toilets and hand-basins.  Lavatory is an older word for toilet. \nThe technology used for modern toilets varies"}
{"title": "tusks", "content": "Tusks are elongated, continuously growing front teeth that protrude well beyond the mouth of certain mammal species. They are most commonly canine teeth, as with narwhals, chevrotains, musk deer, water deer, muntjac, pigs, peccaries, hippopotamuses and walruses, or, in the case of elephants, elongated incisors. Tusks share common features such as extra-oral position, growth pattern, composition and structure, and lack of contribution to ingestion. Tusks are thought to have adapted to the extra-oral environments, like dry or aquatic or arctic. In most tusked species both the males and the females have tusks although the males' are larger. Most mammals with tusks have a pair of them growing out from either side of the mouth. Tusks are generally curved and have a smooth, continuous surface. The male narwhal's straight single helical tusk, which usually grows out from the left of the mouth, is an exception to the typical features of tusks described above. Continuous growth of tusks is enab"}
{"title": "chicken", "content": "The chicken (Gallus gallus domesticus) is a domesticated subspecies of the red junglefowl (Gallus gallus), originally native to Southeast Asia. It was first domesticated around 8,000 years ago and has become one of the most common and widespread domesticated animals in the world. Chickens are primarily kept for their meat and eggs, though they are also kept as pets.\nAs of 2023, the global chicken population exceeds 26.5 billion, with more than 50 billion birds produced annually for consumption. Specialized breeds such as broilers and laying hens have been developed for meat and egg production, respectively. A hen bred for laying can produce over 300 eggs per year. Chickens are social animals with complex vocalizations and behaviors, and feature prominently in folklore, religion, and literature across many societies. Their economic importance makes them a central component of global animal husbandry and agriculture."}
{"title": "portrait", "content": "A portrait is a painting, photograph, sculpture, or other artistic representation of a person, in which the face is always predominant. In arts, a portrait may be represented as half body and even full body. If the subject in full body better represents personality and mood, this type of presentation may be chosen. The intent is to display the likeness, personality, and even the mood of the person. For this reason, in photography a portrait is generally not a snapshot, but a composed image of a person in a still position. A portrait often shows a person looking directly at the painter or photographer, to most successfully engage the subject with the viewer, but portrait may be represented as a profile (from aside) and 3/4."}
{"title": "hair", "content": "Hair is a protein filament that grows from follicles found in the dermis. Hair is one of the defining characteristics of mammals.\nThe human body, apart from areas of glabrous skin, is covered in follicles which produce thick terminal and fine vellus hair. Most common interest in hair is focused on hair growth, hair types, and hair care, but hair is also an important biomaterial primarily composed of protein, notably alpha-keratin.\nAttitudes towards different forms of hair, such as hairstyles and hair removal, vary widely across different cultures and historical periods, but it is often used to indicate a person's personal beliefs or social position, such as their age, gender, or religion."}
{"title": "drink", "content": "A drink or beverage is a liquid intended for human consumption. In addition to their basic function of satisfying thirst, drinks play important roles in human culture. Common types of drinks include plain drinking water, milk, juice, smoothies and soft drinks. Traditionally warm beverages include coffee, tea, and hot chocolate. Caffeinated drinks that contain the stimulant caffeine have a long history.\nIn addition, alcoholic drinks such as wine, beer, and liquor, which contain the drug ethanol, have been part of human culture for more than 8,000 years. Non-alcoholic drinks often signify drinks that would normally contain alcohol, such as beer, wine and cocktails, but are made with a sufficiently low concentration of alcohol by volume. The category includes drinks that have undergone an alcohol removal process such as non-alcoholic beers and de-alcoholized wines."}
{"title": "white", "content": "White is the lightest color and is achromatic (having no chroma). It is the color of objects such as snow, chalk, and milk, and is the opposite of black. White objects fully (or almost fully) reflect and scatter all the visible wavelengths of light. White on television and computer screens is created by a mixture of red, blue, and green light. The color white can be given with white pigments, especially titanium dioxide.\nIn ancient Egypt and ancient Rome, priestesses wore white as a symbol of purity, and Romans wore white togas as symbols of citizenship. In the Middle Ages and Renaissance a white unicorn symbolized chastity, and a white lamb sacrifice and purity. It was the royal color of the kings of France as well as the flag of monarchist France from 1815 to 1830, and of the monarchist movement that opposed the Bolsheviks during the Russian Civil War (1917–1922). Greek temples and Roman temples were faced with white marble, and beginning in the 18th century, with the advent of neocl"}
{"title": "adult", "content": "An adult is an animal that has reached full growth. The biological definition of the word means an animal reaching sexual maturity and thus capable of reproduction. In the human context, the term adult has meanings associated with social and legal concepts. In contrast to a non-adult or \"minor\", a legal adult is a person who has attained the age of majority and is therefore regarded as independent, self-sufficient, and responsible. They may also be regarded as \"majors\". The typical age of attaining legal adulthood is 18 although definition may vary by legal rights, country, and psychological development.\nHuman adulthood encompasses psychological adult development. Definitions of adulthood are often inconsistent and contradictory; a person may be biologically an adult, and have adult behavior, but still be treated as a child if they are under the legal age of majority. Conversely, one may legally be an adult but possess none of the maturity and responsibility that may define an adult ch"}
{"title": "blender", "content": "A blender (sometimes called a mixer (from Latin mixus, the PPP of miscere eng. to Mix) or liquidiser in British English) is a kitchen and laboratory appliance used to mix, crush, purée or emulsify food and other substances. A stationary blender consists of a blender container with a rotating metal or plastic  blade at the bottom, powered by an electric motor that is in the base. Some powerful models can also crush ice and other frozen foods. The newer immersion blender configuration has a motor on top connected by a shaft to a rotating blade at the bottom, which can be used with any container."}
{"title": "buses", "content": "A bus (contracted from omnibus, with variants multibus, motorbus, autobus, etc.) is a motor vehicle that carries significantly more passengers than an average car or van, but fewer than the average rail transport. It is most commonly used in public transport, but is also in use for charter purposes, or through private ownership. Although the average bus carries between 30 and 100 passengers, some buses have a capacity of up to 300 passengers. The most common type is the single-deck rigid bus, with double-decker and articulated buses carrying larger loads, and midibuses and minibuses carrying smaller loads. Coaches are used for longer-distance services. Many types of buses, such as city transit buses and inter-city coaches, charge a fare. Other types, such as elementary or secondary school buses or shuttle buses within a post-secondary education campus, are free. In many jurisdictions, bus drivers require a special large vehicle licence above and beyond a regular driving license.\nBuses "}
{"title": "museum", "content": "A museum is an institution dedicated to displaying or preserving culturally or scientifically significant objects. Many museums have exhibitions of these objects on public display, and some have private collections that are used by researchers and specialists. Museums host a much wider range of objects than a library, and they usually focus on a specific theme, such as the arts, science, natural history or local history. Public museums that host exhibitions and interactive demonstrations are often tourist attractions, and many draw large numbers of visitors from outside of their host country, with the most visited museums in the world attracting millions of visitors annually.\nSince the establishment of the earliest known museum in ancient times, museums have been associated with academia and the preservation of rare items. Museums originated as private collections of interesting items, and not until much later did the emphasis on educating the public take root."}
{"title": "boys", "content": "A boy is a young male human. The term is commonly used for a child or an adolescent. When a male human reaches adulthood, he is usually described as a man."}
{"title": "neck", "content": "The neck is the part of the body in many vertebrates that connects the head to the torso. It supports the weight of the head and protects the nerves that transmit sensory and motor information between the brain and the rest of the body. Additionally, the neck is highly flexible, allowing the head to turn and move in all directions. Anatomically, the human neck is divided into four compartments: vertebral, visceral, and two vascular compartments. Within these compartments, the neck houses the cervical vertebrae, the cervical portion of the spinal cord, upper parts of the respiratory and digestive tracts, endocrine glands, nerves, arteries⁣⁣ and veins. The muscles of the neck, which are separate from the compartments, form the boundaries of the neck triangles.\nIn anatomy, the neck is also referred to as the cervix or collum. However, when the term cervix is used alone, it often refers to the uterine cervix, the neck of the ⁣⁣uterus⁣⁣. Therefore, the adjective cervical can refer either to"}
{"title": "luggage", "content": "Baggage, or luggage, consists of bags, cases, and containers which hold a traveler's personal articles while the traveler is in transit. A modern traveler can be expected to have packages containing clothing, toiletries, small possessions, trip necessities. On the return trip, travelers may have souvenirs and gifts. For some people, luggage and the style thereof is representative of the owner's wealth and status. Luggage is constructed to protect the items during travel either with a hard shell or a durable soft material. Luggage often has internal subdivisions or sections to aid in securing items. Handles are typically provided to facilitate carrying, and some luggage may have wheels and/or telescoping handles or leashes to make moving them easier.\nBaggage (not luggage), or baggage train, can also refer to the train of people and goods, both military and of a personal nature, which commonly followed pre-modern armies on campaign."}
{"title": "statue", "content": "A statue is a free-standing sculpture in which the realistic, full-length figures of persons or animals are carved or cast in a durable material such as wood, metal or stone.  Typical statues are life-sized or close to life-size. A sculpture that represents persons or animals in full figure, but that is small enough to lift and carry is a statuette or figurine, whilst those that are more than twice life-size are regarded as colossal statues.\nStatues have been produced in many cultures from prehistory to the present; the oldest-known statue dating to about 30,000 years ago. Statues represent many different people and animals, real and mythical. Many statues are placed in public places as public art. The world's tallest statue, Statue of Unity, is 182 metres (597 ft) tall and is located near the Narmada dam in Gujarat, India."}
{"title": "horses", "content": "The horse (Equus ferus caballus) is a domesticated, one-toed, hoofed mammal. It belongs to the taxonomic family Equidae and is one of two extant subspecies of Equus ferus. The horse has evolved over the past 45 to 55 million years from a small multi-toed creature, Eohippus, into the large, single-toed animal of today. Humans began domesticating horses around 4000 BCE in Central Asia, and their domestication is believed to have been widespread by 3000 BCE. Horses in the subspecies caballus are domesticated, although some domesticated populations live in the wild as feral horses. These feral populations are not true wild horses, which are horses that have never been domesticated. There is an extensive, specialized vocabulary used to describe equine-related concepts, covering everything from anatomy to life stages, size, colors, markings, breeds, locomotion, and behavior.\nHorses are adapted to run, allowing them to quickly escape predators, and possess a good sense of balance and a strong"}
{"title": "acts", "content": "The Acts of the Apostles (Koinē Greek: Πράξεις Ἀποστόλων, Práxeis Apostólōn; Latin: Actūs Apostolōrum) is the fifth book of the New Testament; it tells of the founding of the Christian Church and the spread of its message to the Roman Empire.\nActs and the Gospel of Luke make up a two-part work, Luke–Acts, by the same anonymous author. Traditionally, the author is believed to be Luke the Evangelist, a doctor who travelled with Paul the Apostle. It is usually dated to around 80–90 AD, although some scholars suggest 110–120 AD.  Many modern scholars doubt the attribution to the physician Luke, and critical opinion on the subject was assessed to be roughly evenly divided near the end of the 20th century. Most scholars maintain that the author of Luke–Acts, whether named Luke or not, was a companion of Paul,  though objections include contradictions with the authentic Pauline letters. The first part, the Gospel of Luke, tells how God fulfilled his plan for the world's salvation through the "}
{"title": "purple", "content": "Purple is a color similar in appearance to violet light. In the RYB color model historically used in the arts, purple is a secondary color created by combining red and blue pigments. In the CMYK color model used in modern printing, purple is made by combining magenta pigment with either cyan pigment, black pigment, or both. In the RGB color model used in computer and television screens, purple is created by mixing red and blue light in order to create colors that appear similar to violet light. According to color theory, purple is considered a cool color.\nPurple has long been associated with royalty, originally because Tyrian purple dye—made from the secretions of sea snails—was extremely expensive in antiquity. Purple was the color worn by Roman magistrates; it became the imperial color worn by the rulers of the Byzantine Empire and the Holy Roman Empire, and later by Roman Catholic bishops. Similarly in Japan, the color is traditionally associated with the emperor and aristocracy.\nAc"}
{"title": "dusk", "content": "Dusk occurs at the darkest stage of twilight, or at the very end of astronomical twilight after sunset and just before nightfall. At predusk, during early to intermediate stages of twilight, enough light in the sky under clear conditions may occur to read outdoors without artificial illumination; however, at the end of civil twilight (when Earth rotates to a point at which the center of the Sun's disk is 6° below the local horizon), such lighting is required to read outside. The term dusk usually refers to astronomical dusk, or the darkest part of twilight before night begins."}
{"title": "legs", "content": "A leg is a weight-bearing and locomotive anatomical structure, usually having a columnar shape. During locomotion, legs function as \"extensible struts\".  The combination of movements at all joints can be modeled as a single, linear element capable of changing length and rotating about an omnidirectional \"hip\" joint.\nAs an anatomical animal structure, it is used for locomotion. The distal end is often modified to distribute force (such as a foot). Most animals have an even number of legs.\nAs a component of furniture, it is used for the economy of materials needed to provide the support for the useful surface, such as the table top or chair seat."}
{"title": "strawberries", "content": "The garden strawberry (or simply strawberry; Fragaria × ananassa) is a widely grown hybrid plant cultivated worldwide for its fruit. The genus Fragaria, the strawberries, is in the rose family, Rosaceae. The fruit is appreciated for its aroma, bright red colour, juicy texture, and sweetness. It is eaten either fresh or in prepared foods such as jam, ice cream, and chocolates. Artificial strawberry flavourings and aromas are widely used in commercial products. Botanically, the strawberry is not a berry, but an aggregate accessory fruit. Each apparent 'seed' on the outside of the strawberry is actually an achene, a botanical fruit with a seed inside it.\nThe garden strawberry was first bred in Brittany, France, in the 1750s via a cross of F. virginiana from eastern North America and F. chiloensis, which was brought from Chile by Amédée-François Frézier in 1714. Cultivars of F. × ananassa have replaced the woodland strawberry F. vesca in commercial production. In 2023, world production of "}
{"title": "skateboarder", "content": "Skateboarding is an action sport that involves riding and performing tricks using a skateboard, as well as a recreational activity, an art form, an entertainment industry job, and a method of transportation. Originating in the United States, skateboarding has been shaped and influenced by many skateboarders throughout the years. A 2009 report found that the skateboarding market is worth an estimated $4.8 billion in annual revenue, with 11.08 million active skateboarders in the world. In 2016, it was announced that skateboarding would be represented at the 2020 Summer Olympics in Tokyo, for both male and female teams. Skateboarding made its Olympic debut in 2020 and was included in the 2024 games.\nSince the 1970s, skateparks have been constructed specifically for use by skateboarders, freestyle BMXers, aggressive skaters, and more recently, scooters. However, skateboarding has become controversial in areas in which the activity, although legal, has damaged curbs, stoneworks, steps, benc"}
{"title": "chalkboard", "content": "A blackboard or a chalkboard is a reusable writing surface on which text or drawings are made with sticks of calcium sulphate or calcium carbonate, better known as chalk. \nBlackboards were originally made of smooth, thin sheets of black or dark grey slate stone."}
{"title": "vegetables", "content": "Vegetables are edible parts of plants that are consumed by humans or other animals as food. This original meaning is still commonly used, and is applied to plants collectively to refer to all edible plant matter, including flowers, fruits, stems, leaves, roots, and seeds. An alternative definition is applied somewhat arbitrarily, often by culinary and cultural tradition; it may include savoury fruits such as tomatoes and courgettes, flowers such as broccoli, and seeds such as pulses, but exclude foods derived from some plants that are fruits, flowers, nuts, and cereal grains.\nOriginally, vegetables were collected from the wild by hunter-gatherers and entered cultivation in several parts of the world, probably during the period 10,000 BC to 7,000 BC, when a new agricultural way of life developed. At first, plants that grew locally were cultivated, but as time went on, trade brought common and exotic crops from elsewhere to add to domestic types. Nowadays, most vegetables are grown all o"}
{"title": "beach", "content": "A beach is a landform alongside a body of water which consists of loose particles. The particles composing a beach are typically made from rock, such as sand, gravel, shingle, pebbles, etc., or biological sources, such as mollusc shells or coralline algae. Sediments settle in different densities and structures, depending on the local wave action and weather, creating different textures, colors and gradients or layers of material.\nThough some beaches form on inland freshwater locations such as lakes and rivers, most beaches are in coastal areas where wave or current action deposits and reworks sediments. Erosion and changing of beach geologies happens through natural processes, like wave action and extreme weather events.  Where wind conditions are correct, beaches can be backed by coastal dunes which offer protection and regeneration for the beach.  However, these natural forces have become more extreme due to climate change, permanently altering beaches at very rapid rates. Some estim"}
{"title": "trees", "content": "In botany, a tree is a perennial plant with an elongated stem, or trunk, usually supporting branches and leaves. In some usages, the definition of a tree may be narrower, e.g., including only woody plants with secondary growth, only plants that are usable as lumber, or only plants above a specified height. But wider definitions include taller palms, tree ferns, bananas, and bamboos. \nTrees are not a monophyletic taxonomic group but consist of a wide variety of plant species that have independently evolved a trunk and branches as a way to tower above other plants to compete for sunlight. The majority of tree species are angiosperms or hardwoods; of the rest, many are gymnosperms or softwoods. Trees tend to be long-lived, some trees reaching several thousand years old. Trees evolved around 400 million years ago, and it is estimated that there are around three trillion mature trees in the world currently.\nA tree typically has many secondary branches supported clear of the ground by the tr"}
{"title": "photo", "content": "A photograph (also known as a photo, or more generically referred to as an image or picture) is an image created by light falling on a photosensitive surface, usually photographic film or an electronic image sensor. The process and practice of creating such images is called photography.\nMost photographs are now created using a smartphone or camera, which uses a lens to focus the scene's visible wavelengths of light into a reproduction of what the human eye would perceive."}
{"title": "window", "content": "A window is an opening in a wall, door, roof, or vehicle that allows the exchange of light and may also allow the passage of sound and sometimes air. Modern windows are usually glazed or covered in some other transparent or translucent material, a sash set in a frame in the opening; the sash and frame are also referred to as a window. Many glazed windows may be opened, to allow ventilation, or closed to exclude inclement weather. Windows may have a latch or similar mechanism to lock the window shut or to hold it open by various amounts.\nTypes include the eyebrow window, fixed windows, hexagonal windows, single-hung, and double-hung sash windows, horizontal sliding sash windows, casement windows, awning windows, hopper windows, tilt, and slide windows (often door-sized), tilt and turn windows, transom windows, sidelight windows, jalousie or louvered windows, clerestory windows, lancet windows, skylights, roof windows, roof lanterns, bay windows, oriel windows, thermal, or Diocletian, wi"}
{"title": "light", "content": "Light, visible light, or visible radiation is electromagnetic radiation that can be perceived by the human eye. Visible light spans the visible spectrum and is usually defined as having wavelengths in the range of 400–700 nanometres (nm), corresponding to frequencies of 750–420 terahertz. The visible band sits adjacent to the infrared (with longer wavelengths and lower frequencies) and the ultraviolet (with shorter wavelengths and higher frequencies), called collectively optical radiation.\nIn physics, the term \"light\" may refer more broadly to electromagnetic radiation of any wavelength, whether visible or not. In this sense, gamma rays, X-rays, microwaves and radio waves are also light. The primary properties of light are intensity, propagation direction, frequency or wavelength spectrum, and polarization. Its speed in vacuum, 299792458 m/s, is one of the fundamental constants of nature. All electromagnetic radiation exhibits some properties of both particles and waves. Single, massle"}
{"title": "day", "content": "A day is the time period of a full rotation of the Earth with respect to the Sun.  On average, this is 24 hours (86,400 seconds). As a day passes at a given location it experiences morning, afternoon, evening, and night. This daily cycle drives circadian rhythms in many organisms, which are vital to many life processes.\nA collection of sequential days is organized into calendars as dates, almost always into weeks, months and years. A solar calendar organizes dates based on the Sun's annual cycle, giving consistent start dates for the four seasons from year to year. A lunar calendar organizes dates based on the Moon's lunar phase.\nIn common usage, a day starts at midnight, written as 00:00 or 12:00 am in 24- or 12-hour clocks, respectively. Because the time of midnight varies between locations, time zones are set up to facilitate the use of a uniform standard time.  Other conventions are sometimes used, for example the Jewish religious calendar counts days from sunset to sunset, so the "}
{"title": "container", "content": "A container is any receptacle or enclosure for holding a product used in storage, packaging, and transportation, including shipping.\nThings kept inside of a container are protected on several sides by being inside of its structure. The term is most frequently applied to devices made from materials that are durable and are often partly or completely rigid.\nA container can also be considered as a basic tool, consisting of any device creating a partially or fully enclosed space that can be used to contain, store, and transport objects or materials."}
{"title": "hat", "content": "A hat is a head covering which is worn for various reasons, including protection against weather conditions, ceremonial reasons such as university graduation, religious reasons, safety, or as a fashion accessory. Hats which incorporate mechanical features, such as visors, spikes, flaps, braces or beer holders shade into the broader category of headgear.\nIn the past, hats were an indicator of social status. In the military, hats may denote nationality, branch of service, rank or regiment. Police typically wear distinctive hats such as peaked caps or brimmed hats, such as those worn by the Royal Canadian Mounted Police. Some hats have a protective function. As examples, the hard hat protects construction workers' heads from injury by falling objects, a British police Custodian helmet protects the officer's head, a sun hat shades the face and shoulders from the sun, a cowboy hat protects against sun and rain and an ushanka fur hat with fold-down earflaps keeps the head and ears warm. Some"}
{"title": "city", "content": "A city is a human settlement of a substantial size. The term \"city\" has different meanings around the world and in some places the settlement can be very small. Even where the term is limited to larger settlements, there is no universally agreed definition of the lower boundary for their size. In a narrower sense, a city can be defined as a permanent and densely populated place with administratively defined boundaries whose members work primarily on non-agricultural tasks. Cities generally have extensive systems for housing, transportation, sanitation, utilities, land use, production of goods, and communication. Their density facilitates interaction between people, government organizations, and businesses, sometimes benefiting different parties in the process, such as improving the efficiency of goods and service distribution.\nHistorically, city dwellers have been a small proportion of humanity overall, but following two centuries of unprecedented and rapid urbanization, more than half"}
{"title": "kites", "content": "A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag forces. A kite consists of wings, tethers and anchors. Kites often have a bridle and tail to guide the face of the kite so the wind can lift it. Some kite designs do not need a bridle; box kites can have a single attachment point. A kite may have fixed or moving anchors that can balance the kite. The name is derived from the kite, the hovering bird of prey.\nThere are several shapes of kites. \nThe lift that sustains the kite in flight is generated when air moves around the kite's surface, producing low pressure above and high pressure below the wings. The interaction with the wind also generates horizontal drag along the direction of the wind. The resultant force vector from the lift and drag force components is opposed by the tension of one or more of the lines or tethers to which the kite is attached. The anchor point of the kite line may be static or moving (e.g., the tow"}
{"title": "pizzas", "content": "Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples. In 2009, Neapolitan pizza was registered with the European Union as a traditional speciality guaranteed (TSG) dish. In 2017, the art of making Neapolitan pizza was included on UNESCO's list of intangible cultural heritage.\nPizza and its variants are among the most popular foods in the world. Pizza is sold at a variety of restaurants, including pizzerias (pizza specialty restaurants), Mediterranean restaurants, via delivery, and as street food. In Italy, pizza served in a restaurant is presented unsliced, and is eaten with the use of a kn"}
{"title": "flowers", "content": "Flowers, also known as blooms and blossoms, are the reproductive structures of flowering plants (angiosperms). Typically, they are structured in four circular levels, called whorls, around the end of a stalk. These whorls include: calyx, modified leaves; corolla, the petals; androecium, the male reproductive unit consisting of stamens and pollen; and gynoecium, the female part, containing style and stigma, which receives the pollen at the tip of the style, and ovary, which contains the ovules. When flowers are arranged in groups, they are known collectively as inflorescences.\nFloral growth originates at stem tips and is controlled by MADS-box genes. In most plant species flowers are heterosporous, and so can produce sex cells of both sexes. Pollination mediates the transport of pollen to the ovules in the ovaries, to facilitate sexual reproduction. It can occur between different plants, as in cross-pollination, or between flowers on the same plant or even the same flower, as in self-po"}
{"title": "truck", "content": "A truck or lorry is a motor vehicle designed to transport freight, carry specialized payloads, or perform other utilitarian work. Trucks vary greatly in size, power, and configuration, but the vast majority feature body-on-frame construction, with a cabin that is independent of the payload portion of the vehicle. Smaller varieties may be mechanically similar to some automobiles. Commercial trucks can be very large and powerful and may be configured to be mounted with specialized equipment, such as in the case of refuse trucks, fire trucks, concrete mixers, and suction excavators. In American English, a commercial vehicle without a trailer or other articulation is formally a \"straight truck\" while one designed specifically to pull a trailer is not a truck but a \"tractor\".\nThe majority of trucks currently in use are powered by diesel engines, although small- to medium-size trucks with gasoline engines exist in North America. Electrically powered trucks are more popular in China and Europ"}
{"title": "bicycle", "content": "A bicycle, also called a pedal cycle, bike, push-bike or cycle, is a human-powered or motor-assisted, pedal-driven, single-track vehicle, with two wheels attached to a frame, one behind the other. A bicycle rider is called a cyclist, or bicyclist.\nBicycles were introduced in the 19th century in Europe. By the early 21st century there were more than 1 billion bicycles. There are many more bicycles than cars. Bicycles are the principal means of transport in many regions. They also provide a popular form of recreation, and have been adapted for use as children's toys. Bicycles are used for fitness, military and police applications, courier services, bicycle racing, and artistic cycling.\nThe basic shape and configuration of a typical upright or \"safety\" bicycle, has changed little since the first chain-driven model was developed around 1885. However, many details have been improved, especially since the advent of modern materials and computer-aided design. These have allowed for a prolifer"}
{"title": "bucket", "content": "A bucket is typically a watertight, vertical cylinder or truncated cone or square, with an open top and a flat bottom that is attached to a semicircular carrying handle called the bail.\nA bucket is usually an open-top container. In contrast, a pail can have a top or lid and is a shipping container. In non-technical usage, the two terms are often used interchangeably."}
{"title": "cream", "content": "Cream is a dairy product composed of the higher-fat layer skimmed from the top of milk before homogenization. In un-homogenized milk, the fat, which is less dense, eventually rises to the top. In the industrial production of cream, this process is accelerated by using centrifuges called \"separators\". In many countries, it is sold in several grades depending on the total butterfat content. It can be dried to a powder for shipment to distant markets, and contains high levels of saturated fat.\nCream skimmed from milk may be called \"sweet cream\" to distinguish it from cream skimmed from whey, a by-product of cheese-making. Whey cream has a lower fat content and tastes more salty, tangy, and \"cheesy\". In many countries partially fermented cream is also sold as: sour cream, crème fraîche, and so on.  Both forms have many culinary uses in both sweet and savoury dishes.\nCream produced by cattle (particularly Jersey cattle) grazing on natural pasture often contains some fat-soluble carotenoid p"}
{"title": "forest", "content": "A forest is an ecosystem characterized by a dense community of trees. Hundreds of definitions of forest are used throughout the world, incorporating factors such as tree density, tree height, land use, legal standing, and ecological function. The United Nations' Food and Agriculture Organization (FAO) defines a forest as, \"Land spanning more than 0.5 hectares with trees higher than 5 meters and a canopy cover of more than 10 percent, or trees able to reach these thresholds in situ. It does not include land that is predominantly under agricultural or urban use.\" Using this definition, Global Forest Resources Assessment 2020 found that forests covered 4.06 billion hectares (10.0 billion acres; 40.6 million square kilometres; 15.7 million square miles), or approximately 31 percent of the world's land area in 2020.\nForests are the largest terrestrial ecosystems of Earth by area, and are found around the globe. 45 percent of forest land is in the tropical latitudes. The next largest share o"}
{"title": "prices", "content": "A price is the (usually not negative) quantity of payment or compensation expected, required, or given by one party to another in return for goods or services. In some situations, especially when the product is a service rather than a physical good, the price for the service may be called something else such as \"rent\" or \"tuition\". Prices are influenced by production costs, supply of the desired product, and demand for the product. A price may be determined by a monopolist or may be imposed on the firm by market conditions.\nPrice can be quoted in currency, quantities of goods or vouchers.\n\nIn modern economies, prices are generally expressed in units of some form of currency. (More specifically, for raw materials they are expressed as currency per unit weight, e.g. euros per kilogram or Rands per KG.)\nAlthough prices could be quoted as quantities of other goods or services, this sort of barter exchange is rarely seen. Prices are sometimes quoted in terms of vouchers such as trading stam"}
{"title": "egg", "content": "An egg is an organic vessel grown by an animal to carry a possibly fertilized egg cell (a zygote) and to incubate from it an embryo within the egg until the embryo has become an animal fetus that can survive on its own, at which point the animal hatches.\nMost arthropods, vertebrates (excluding live-bearing mammals), and mollusks lay eggs, although some, such as scorpions, do not.\nReptile eggs, bird eggs, and monotreme eggs are laid out of water and are surrounded by a protective shell, either flexible or inflexible. Eggs laid on land or in nests are usually kept within a warm and favorable temperature range while the embryo grows. When the embryo is adequately developed it hatches, i.e., breaks out of the egg's shell. Some embryos have a temporary egg tooth they use to crack, pip, or break the eggshell or covering.\nThe largest recorded egg is from a whale shark and was 30 cm × 14 cm × 9 cm (11.8 in × 5.5 in × 3.5 in) in size. Whale shark eggs typically hatch within the mother. At 1.5 k"}
{"title": "glasses", "content": "Glasses, also known as eyeglasses (American English), spectacles (Commonwealth English), or colloquially as specs, are vision eyewear with clear or tinted lenses mounted in a frame that holds them in front of a person's eyes, typically utilizing a bridge over the nose and hinged arms, known as temples or temple pieces, that rest over the ears for support.\nGlasses are typically used for vision correction, such as with reading glasses and glasses used for nearsightedness; however, without the specialized lenses, they are sometimes used for cosmetic purposes. \nSafety glasses are eye protection, a form of personal protective equipment (PPE) that are worn by workers around their eyes for protection. Safety glasses act as a shield to protect the eyes from any type of foreign debris that may cause irritation or injury; these glasses may have protection on the sides of the eyes as well as in the lenses. Some types of safety glasses are used to protect against visible and near-visible light or "}
{"title": "wave", "content": "In physics, mathematics, engineering, and related fields, a wave is a propagating dynamic disturbance (change from equilibrium) of one or more quantities. Periodic waves oscillate repeatedly about an equilibrium (resting) value at some frequency. When the entire waveform moves in one direction, it is said to be a travelling wave; by contrast, a pair of superimposed periodic waves traveling in opposite directions makes a standing wave. In a standing wave, the amplitude of vibration has nulls at some positions where the wave amplitude appears smaller or even zero.\nThere are two types of waves that are most commonly studied in classical physics: mechanical waves and electromagnetic waves. In a mechanical wave, stress and strain fields oscillate about a mechanical equilibrium. A mechanical wave is a local deformation (strain) in some physical medium that propagates from particle to particle by creating local stresses that cause strain in neighboring particles too. For example, sound waves "}
{"title": "district", "content": "A district is a type of administrative division that in some countries is managed by the local government. Across the world, areas known as \"districts\" vary greatly in size, spanning regions or counties, several municipalities, subdivisions of municipalities, school district, or political district."}
{"title": "log", "content": "Log most often refers to:\n\nTrunk (botany), the stem and main wooden axis of a tree, called logs when cut\nLogging, cutting down trees for logs\nFirewood, logs used for fuel\nLumber or timber, converted from wood logs\nLogarithm, in mathematics\nLog, LOG or LoG may also refer to:"}
{"title": "mattress", "content": "A mattress is a large, usually rectangular pad for supporting a person lying down, especially for sleeping. It is designed to be used as a bed, or on a bed frame as part of a bed. Mattresses may consist of a quilted or similarly fastened case, usually of heavy cloth, containing materials such as hair, straw, cotton, foam rubber, or a framework of metal springs. Mattresses may also be filled with air or water.\nMattresses are usually placed on top of a bed base which may be solid, as in the case of a platform bed, or elastic, such as an upholstered wood and wire box spring or a slatted foundation. Popular in Europe, a divan incorporates both mattress and foundation in a single upholstered, footed unit. Divans have at least one innerspring layer as well as cushioning materials. They may be supplied with a secondary mattress or a removable \"topper\". Mattresses may also be filled with air or water, or a variety of natural fibers, such as in futons. Kapok is a common mattress material in Sou"}
{"title": "cub", "content": "A cub is the young of certain large predatory animals, such as big cats and bears.\nCub or CUB may also refer to:"}
{"title": "gate", "content": "A gate or gateway is a point of entry to or from a space enclosed by walls. The word is derived from Proto-Germanic *gatan, meaning an opening or passageway. Synonyms include yett (which comes from the same root word) and portal. The concept originally referred to the gap or hole in the wall or fence, rather than a barrier which closed it. Gates may prevent or control the entry or exit of individuals, or they may be merely decorative. The moving part or parts of a gateway may be considered \"doors\", as they are fixed at one side whilst opening and closing like one.\nA gate may have a latch that can be raised and lowered to both open a gate or prevent it from swinging. Gate operation can be either automated or manual. Locks are also used on gates to increase security. \nLarger gates can be used for a whole building, such as a castle or fortified town. Doors can also be considered gates when they are used to block entry as prevalent within a gatehouse."}
{"title": "motor", "content": "An engine or motor is a machine designed to convert one or more forms of energy into mechanical energy.\nAvailable energy sources include potential energy (e.g. energy of the Earth's gravitational field as exploited in hydroelectric power generation), heat energy (e.g. geothermal), chemical energy, electric potential and nuclear energy (from nuclear fission or nuclear fusion). Many of these processes generate heat as an intermediate energy form; thus heat engines have special importance. Some natural processes, such as atmospheric convection cells convert environmental heat into motion (e.g. in the form of rising air currents). Mechanical energy is of particular importance in transportation, but also plays a role in many industrial processes such as cutting, grinding, crushing, and mixing.\nMechanical heat engines convert heat into work via various thermodynamic processes. The internal combustion engine is perhaps the most common example of a mechanical heat engine in which heat from the"}
{"title": "thumb", "content": "The thumb is the first digit of the hand, next to the index finger. When a person is standing in the medical anatomical position (where the palm is facing to the front), the thumb is the outermost digit. The Medical Latin English noun for thumb is pollex (compare hallux for big toe), and the corresponding adjective for thumb is pollical."}
{"title": "bag", "content": "A bag, also known regionally as a sack, is a common tool in the form of a floppy container, typically made of cloth, leather, bamboo, paper, or plastic. The use of bags predates recorded history, with the earliest bags being lengths of animal skin, cotton, or woven plant fibers, folded up at the edges and secured in that shape with strings of the same material. Bags can be used to carry items such as personal belongings, groceries, and other objects. They come in various shapes and sizes, often equipped with handles or straps for easier carrying.\nBags have been fundamental for the development of human civilization, as they allow people to easily collect and carry loose materials, such as berries or food grains, while also allowing them to carry more items in their hands.\nThe English word probably originates from the Norse word baggi, from the reconstructed Proto-Indo-European bʰak, but is also comparable to the Welsh baich (load, bundle), and the Greek Τσιαντουλίτσα (Chandulícha, load)"}
{"title": "branch", "content": "A branch, also called a ramus in botany, is a stem that grows off from another stem, or when structures like veins in leaves are divided into smaller veins."}
{"title": "butter", "content": "Butter is a dairy product made from the fat and protein components of churned cream. It is a semi-solid emulsion at room temperature, consisting of approximately 81% butterfat. It is used at room temperature as a spread, melted as a condiment, and used as a fat in baking, sauce-making, pan frying, and other cooking procedures.\nMost frequently made from cow's milk, butter can also be manufactured from the milk of other mammals, including sheep, goats, buffalo, and yaks. It is made by churning milk or cream to separate the fat globules from the buttermilk. Salt has been added to butter since antiquity to help preserve it, particularly when being transported; salt may still play a preservation role but is less important today as the entire supply chain is usually refrigerated. In modern times, salt may be added for taste and food coloring added for color. Rendering butter, removing the water and milk solids, produces clarified butter (including ghee), which is almost entirely butterfat.\nB"}
{"title": "hockey", "content": "Hockey is a family of stick sports where two opposing teams use hockey sticks to propel a ball or disk into a goal. There are many types of hockey, and the individual sports vary in rules, numbers of players, apparel, and playing surface. Hockey includes both summer and winter variations that may be played on an outdoor field, sheet of ice, or an indoor gymnasium. Some forms of hockey require skates, either inline, roller or ice, while others do not. The various games are usually distnguished by proceding the word hockey with a qualifier, as in field hockey, ice hockey, roller hockey, rink hockey, or floor hockey.\nIn each of these sports, two teams play against each other by trying to manoeuvre the object of play, either a type of ball or a disk (such as a puck), into the opponent's goal using a hockey stick. Two notable exceptions use a straight stick and an open disk (still referred to as a puck) with a hole in the center instead. The first case is a style of floor hockey whose rules"}
{"title": "cup", "content": "A cup is a small container used to hold liquids for drinking, typically with a flattened hemispherical shape, and often with a capacity of about 6–16 US fluid ounces (177–473 ml).  Cups may be made of pottery (including porcelain), glass, metal, wood, stone, polystyrene, plastic, lacquerware, or other materials. Normally, a cup is brought in contact with the mouth for drinking, distinguishing it from other tableware and drinkware forms such as jugs; however, a straw and/or lid may also be used. They also often have handles, though a beaker has no handle or stem, and small bowl shapes are very common in Asia. \nCups of different styles may be used for different types of liquids or other foodstuffs (e.g. teacups and measuring cups), in different situations (e.g. at water stations or in ceremonies and rituals), or for decoration. \n\nThe history of cups goes back well into prehistory, initially mostly as handle-less beakers or bowls, and they have been found in most cultures across the world"}
{"title": "glass", "content": "Glass is an amorphous (non-crystalline) solid. Because it is often transparent and chemically inert, glass has found widespread practical, technological, and decorative use in window panes, tableware, and optics. Some common objects made of glass are named after the material, e.g., a \"glass\" for drinking, \"glasses\" for vision correction, and a \"magnifying glass\".\nGlass is most often formed by rapid cooling (quenching) of the molten form. Some glasses such as volcanic glass are naturally occurring, and obsidian has been used to make arrowheads and knives since the Stone Age. Archaeological evidence suggests glassmaking dates back to at least 3600 BC in Mesopotamia, Egypt, or Syria. The earliest known glass objects were beads, perhaps created accidentally during metalworking or the production of faience, which is a form of pottery using lead glazes.\nDue to its ease of formability into any shape, glass has been traditionally used for vessels, such as bowls, vases, bottles, jars and drinki"}
{"title": "tv", "content": "Television (TV) is a telecommunication medium for transmitting moving images and sound. Additionally, the term can refer to a physical television set rather than the medium of transmission. Television is a mass medium for advertising, entertainment, news, and sports. The medium is capable of more than \"radio broadcasting\", which refers to an audio signal sent to radio receivers.\nTelevision became available in crude experimental forms in the 1920s, but only after several years of further development was the new technology marketed to consumers. After World War II, an improved form of black-and-white television broadcasting became popular in the United Kingdom and the United States, and television sets became commonplace in homes, businesses, and institutions. During the 1950s, television was the primary medium for influencing public opinion. In the mid-1960s, color broadcasting was introduced in the U.S. and most other developed countries.\nThe availability of various types of archival s"}
{"title": "hotdog", "content": "A hot dog is a grilled, steamed, or boiled sausage served in the slit of a partially sliced bun. The term hot dog can also refer to the sausage itself. The sausage used is a wiener (Vienna sausage) or a frankfurter (Frankfurter Würstchen, also just called frank). The names of these sausages commonly refer to their assembled dish. Hot dog preparation and condiments vary worldwide. Common condiments include mustard, ketchup, relish, onions in tomato sauce, and cheese sauce. Other toppings include sauerkraut, diced onions, jalapeños, chili, grated cheese, coleslaw, bacon and olives. Hot dog variants include the corn dog and pigs in a blanket. The hot dog's cultural traditions include the Nathan's Hot Dog Eating Contest and the Oscar Mayer Wienermobile.\nThese types of sausages were culturally imported from Germany and became popular in the United States. It became a working-class street food in the U.S., sold at stands and carts. The hot dog has become closely associated with baseball and "}
{"title": "dishwasher", "content": "A dishwasher is a machine that is used to clean dishware, cookware, and cutlery automatically. Unlike manual dishwashing, which relies on physical scrubbing to remove soiling, the mechanical dishwasher cleans by spraying hot water, typically between 45 and 75 °C (110 and 170 °F), at the dishes, with lower temperatures of water used for delicate items.\nA mix of water and dishwasher detergent is pumped to one or more rotating sprayers, cleaning the dishes with the cleaning mixture. The mixture is recirculated to save water and energy. Often there is a pre-rinse, which may or may not include detergent, and the water is then drained. This is followed by the main wash with fresh water and detergent. Once the wash is finished, the water is drained; more hot water enters the tub by means of an electromechanical solenoid valve, and the rinse cycle(s) begin. After the rinse process finishes, the water is drained again and the dishes are dried using one of several drying methods. Typically a rin"}
{"title": "suv", "content": "A sport utility vehicle (SUV) is a car classification that combines elements of road-going passenger cars with features from off-road vehicles, such as raised ground clearance and four-wheel drive.\nThere is no commonly agreed-upon definition of an SUV, and usage of the term varies between countries. Thus, it is \"a loose term that traditionally covers a broad range of vehicles with four-wheel drive.\" Some definitions claim that an SUV must be built on a light truck chassis; however, broader definitions consider any vehicle with off-road design features to be an SUV. A crossover SUV is often defined as an SUV built with a unibody construction (as with passenger cars); however, the designations are increasingly blurred because of the capabilities of the vehicles, the labelling by marketers, and the electrification of new models.\nThe predecessors to SUVs date back to military and low-volume models from the late 1930s, and the four-wheel-drive station wagons and carryalls that began to be i"}
{"title": "them", "content": "Them or THEM, a third-person singular or plural accusative personal pronoun, may refer to:"}
{"title": "basket", "content": "A basket is a container that is traditionally constructed from stiff fibers, and can be made from a range of materials, including wood splints, runners, and cane. While most baskets are made from plant materials, other materials such as horsehair, baleen, or metal wire can be used. Baskets are generally woven by hand. Some baskets are fitted with a lid, while others are left open on top."}
{"title": "bite", "content": "Biting is an action involving a set of teeth closing down on an object. It is a common zoological behavior, being found in toothed animals such as mammals, reptiles, amphibians, fishes, and arthropods. Biting is also an action humans participate in, most commonly when chewing food. Myocytic contraction of the muscles of mastication is responsible for generating the force that initiates the preparatory jaw abduction (opening), then rapidly adducts (closes) the jaw and moves the top and bottom teeth towards each other, resulting in the forceful action of a bite. Biting is one of the main functions in the lives of larger organisms, providing them the ability to forage, hunt, eat, build, play, fight, protect, and much more. Biting may be a form of physical aggression due to predatory or territorial intentions. In animals, biting can also be a normal activity, being used for eating, scratching, carrying objects, preparing food for young, removing ectoparasites or irritating foreign objects,"}
{"title": "wine", "content": "Wine is an alcoholic drink made from fermented fruit. Yeast consumes the sugar in the fruit and converts it to ethanol and carbon dioxide, releasing heat in the process. Wine is most often made from grapes, and the term \"wine\" generally refers to grape wine when used without any qualification. Even so, wine can be made from a variety of fruit crops, including plum, cherry, pomegranate, blueberry, currant, and elderberry. \nDifferent varieties of grapes and strains of yeasts are major factors in different styles of wine. These differences result from the complex interactions between the biochemical development of the grape, the reactions involved in fermentation, the grape's growing environment (terroir), and the wine production process. Many countries enact legal appellations intended to define styles and qualities of wine. These typically restrict the geographical origin and permitted varieties of grapes, as well as other aspects of wine production. \nWine has been produced for thousand"}
{"title": "zebra", "content": "Zebras (US: , UK: ) (subgenus Hippotigris) are African equines with distinctive black-and-white striped coats. There are three living species: Grévy's zebra (Equus grevyi), the plains zebra (E. quagga), and the mountain zebra (E. zebra). Zebras share the genus Equus with horses and asses, the three groups being the only living members of the family Equidae. Zebra stripes come in different patterns, unique to each individual. Several theories have been proposed for the function of these patterns, with most evidence supporting them as a deterrent for biting flies. Zebras inhabit eastern and southern Africa and can be found in a variety of habitats such as savannahs, grasslands, woodlands, shrublands, and mountainous areas.\nZebras are primarily grazers and can subsist on lower-quality vegetation. They are preyed on mainly by lions, and typically flee when threatened but also bite and kick. Zebra species differ in social behaviour, with plains and mountain zebra living in stable harems con"}
{"title": "dress", "content": "A dress (also known as a frock or a gown) is a one-piece outer garment that is worn on the torso, hangs down over the legs, and is primarily worn by women or girls. Dresses often consist of a bodice attached to a skirt. \nDress shapes, silhouettes, textiles, and colors vary. In particular, dresses can vary by sleeve length, neckline, skirt length, or hemline. These variances may be based on considerations such as fashion trends, modesty, weather, and personal taste. Dresses are generally suitable for both formal wear and casual wear in the West.\nHistorically, foundation garments and other structural garments—including items such as corsets, partlets, petticoats, panniers, and bustles—were used to achieve the desired silhouette."}
{"title": "officer", "content": "An officer is a person who has a position of authority in a hierarchical organization. The term derives from Old French oficier \"officer, official\" (early 14c., Modern French officier), from Medieval Latin officiarius \"an officer,\" from Latin officium \"a service, a duty\" the late Latin from officiarius, meaning \"official.\""}
{"title": "wall", "content": "A wall is a structure and a surface that defines an area; carries a load; provides security, shelter, or soundproofing; or serves a decorative purpose. There are various types of walls, including border barriers between countries, brick walls, defensive walls in fortifications, and retaining walls that hold back dirt, stone, water, or noise. Walls can also be found in buildings, where they support roofs, floors, and ceilings, enclose spaces, and provide shelter and security.\nThe construction of walls can be categorized into framed walls and mass-walls. Framed walls transfer the load to the foundation through posts, columns, or studs and typically consist of structural elements, insulation, and finish elements. Mass-walls are made of solid materials such as masonry, concrete, adobe, or rammed earth. Walls may also house utilities like electrical wiring or plumbing and must conform to local building and fire codes.\nWalls have historically served defensive purposes, with the term \"wall\" o"}
{"title": "stable", "content": "A stable is a building in which working animals are kept, especially horses or oxen.: 200 : 42  The building is usually divided into stalls, and may include storage for equipment and feed."}
{"title": "court", "content": "A court is an institution, often a government entity, with the authority to adjudicate legal disputes between parties  and administer justice in civil, criminal, and administrative matters in accordance with the rule of law.\nCourts generally consist of judges or other judicial officers, and are usually established and dissolved through legislation enacted by a legislature. Courts may also be established by constitution or an equivalent constituting instrument.\nThe practical authority given to the court is known as its jurisdiction, which describes the court's power to decide certain kinds of questions, or petitions put to it. There are various kinds of courts, including trial courts, appellate courts, administrative courts, international courts, and tribunals."}
{"title": "motorcycles", "content": "A motorcycle (motorbike, bike; uni (if one-wheeled); trike (if three-wheeled); quad (if four-wheeled)) is a lightweight private 1-to-2 passenger personal motor vehicle steered by a handlebar from a saddle-style seat.\nMotorcycle designs vary greatly to suit a range of different purposes: long-distance travel, commuting, cruising, sport (including racing), and off-road riding. Motorcycling is riding a motorcycle and being involved in other related social activities such as joining a motorcycle club and attending motorcycle rallies.\nThe 1885 Daimler Reitwagen made by Gottlieb Daimler and Wilhelm Maybach in Germany was the first internal combustion, petroleum-fueled motorcycle. In 1894, Hildebrand & Wolfmüller became the first series production motorcycle.\nGlobally, motorcycles are comparable numerically to cars as a method of transport: in 2021, approximately 58.6 million new motorcycles were sold around the world, while 66.7 million cars were sold over the same period.\nIn 2022, the top f"}
{"title": "buildings", "content": "A building or edifice is an enclosed structure with a roof, walls and often windows, usually standing permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for numerous factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, prestige, and aesthetic reasons. To better understand the concept, see Nonbuilding structure for contrast.  \nBuildings serve several societal needs – occupancy, primarily as shelter from weather, security, living space, privacy, to store belongings, and to comfortably live and work. A building as a shelter represents a physical separation of the human habitat (a place of comfort and safety) from the outside (a place that may be harsh and harmful at times).\nbuildings have been objects or canvasses of much artistic expression. In recent years, interest in sustainable planning and building practices has become "}
{"title": "freeway", "content": "A controlled-access highway is a type of highway that has been designed for high-speed vehicular traffic, with all traffic flow—ingress and egress—regulated. Common English terms are freeway, motorway, and expressway. Other similar terms include throughway or thruway and parkway. Some of these may be limited-access highways, although this term can also refer to a class of highways with somewhat less isolation from other traffic.\nIn countries following the Vienna convention, the motorway qualification implies that walking and parking are forbidden.\nA fully controlled-access highway provides an unhindered flow of traffic, with no traffic signals, intersections or property access. They are free of any at-grade crossings with other roads, railways, or pedestrian paths, which are instead carried by overpasses and underpasses. Entrances and exits to the highway are provided at interchanges by slip roads (ramps), which allow for speed changes between the highway and arterials and collector ro"}
{"title": "game", "content": "A game is a structured type of play usually undertaken for entertainment or fun, and sometimes used as an educational tool. Many games are also considered to be work (such as professional players of spectator sports or video games) or art (such as games involving an artistic layout such as mahjong, solitaire, or some video games).\nGames have a wide range of occasions, reflecting both the generality of its concept and the variety of its play. Games are sometimes played purely for enjoyment, sometimes for achievement or reward as well. They can be played alone, in teams, or online; by amateurs or by professionals. The players may have an audience of non-players, such as when people are entertained by watching a chess championship. On the other hand, players in a game may constitute their own audience as they take their turn to play. Often, part of the entertainment for children playing a game is deciding who is part of their audience and who participates as a player. A toy and a game are"}
{"title": "starbucks", "content": "Starbucks Corporation is an American multinational chain of coffeehouses and roastery reserves headquartered in Seattle, Washington. It was founded in 1971 by Jerry Baldwin, Zev Siegl, and Gordon Bowker at Seattle's Pike Place Market initially as a coffee bean wholesaler. Starbucks was converted into a coffee shop serving espresso-based drinks under the ownership of Howard Schultz, who was chief executive officer from 1986 to 2000 and led the aggressive expansion of the franchise across the West Coast of the United States.\nAs of November 2022, the company had 35,711 stores in 80 countries, 15,873 of which were located in the United States. Of Starbucks' U.S.-based stores, over 8,900 are company-operated, while the remainder are licensed. It is the world's largest coffeehouse chain. The company is ranked 120th on the Fortune 500 and 303rd on the Forbes Global 2000, as of 2022.\nThe rise of the second wave of coffee culture is generally attributed to Starbucks, which introduced a wider va"}
{"title": "fries", "content": "French fries, or simply fries, also known as chips, and finger chips (Indian English), are batonnet or julienne-cut deep-fried potatoes of disputed origin. They are prepared by cutting potatoes into even strips, drying them, and frying them, usually in a deep fryer. Pre-cut, blanched, and frozen russet potatoes are widely used, and sometimes baked in a regular or convection oven, such as an air fryer.\nFrench fries are served hot, either soft or crispy, and are generally eaten as part of lunch or dinner or by themselves as a snack, and they commonly appear on the menus of diners, fast food restaurants, pubs, and bars. They are typically salted and may be served with ketchup, vinegar, mayonnaise, tomato sauce, or other sauces. Fries can be topped more heavily, as in the dishes of poutine, loaded fries or chili cheese fries, and are occasionally made from sweet potatoes instead of potatoes."}
{"title": "animals", "content": "Animals are multicellular, eukaryotic organisms in the biological kingdom Animalia (). With few exceptions, animals consume organic material, breathe oxygen, have myocytes and are able to move, can reproduce sexually, and grow from a hollow sphere of cells, the blastula, during embryonic development. Animals form a clade, meaning that they arose from a single common ancestor. Over 1.5 million living animal species have been described, of which around 1.05 million are insects, over 85,000 are molluscs, and around 65,000 are vertebrates. It has been estimated there are as many as 7.77 million animal species on Earth. Animal body lengths range from 8.5 μm (0.00033 in) to 33.6 m (110 ft). They have complex ecologies and interactions with each other and their environments, forming intricate food webs. The scientific study of animals is known as zoology, and the study of animal behaviour is known as ethology.\nThe animal kingdom is divided into five major clades, namely Porifera, Ctenophora, "}
{"title": "person", "content": "A person (pl.: people or persons, depending on context) is a being who has certain capacities or attributes such as reason, morality, consciousness or self-consciousness, and being a part of a culturally established form of social relations such as kinship, ownership of property, or legal responsibility. The defining features of personhood and, consequently, what makes a person count as a person, differ widely among cultures and contexts.\nIn addition to the question of personhood, of what makes a being count as a person to begin with, there are further questions about personal identity and self: both about what makes any particular person that particular person instead of another, and about what makes a person at one time the same person as they were or will be at another time despite any intervening changes.\nThe plural form \"people\" is often used to refer to an entire nation or ethnic group (as in \"a people\"), and this was the original meaning of the word; it subsequently acquired its"}
{"title": "man", "content": "A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. Sex differentiation of the male fetus is governed by the SRY gene on the Y chromosome. During puberty, hormones which stimulate androgen production result in the development of secondary sexual characteristics that result in even more differences between the sexes. These include greater muscle mass, greater height, the growth of facial hair and a lower body fat composition. Male anatomy is distinguished from female anatomy by the male reproductive system, which includes the testicles, sperm ducts, prostate gland and epididymides, and penis. Secondary sex characteristics include a narrower pelvis and hips, and smaller breasts and nipples.\nThroughout human history, traditional gender roles have often defined men's activities and opportunities. Men often face con"}
{"title": "sidewalk", "content": "A sidewalk (North American English),\n\n \npavement (British English, South African English), or footpath (Irish English, Indian English, Australian English, New Zealand English) is a path along the side of a road. Usually constructed of concrete, pavers, brick, stone, or asphalt, it is designed for pedestrians. A sidewalk is normally higher than the roadway, and separated from it by a curb. There may also be a planted strip between the sidewalk and the roadway and between the roadway and the adjacent land."}
{"title": "atm", "content": "An automated teller machine (ATM) is an electronic telecommunications device that enables customers of financial institutions to perform financial transactions, such as cash withdrawals, deposits, funds transfers, balance inquiries or account information inquiries, at any time and without the need for direct interaction with bank staff.\nATMs are known by a variety of other names, including automatic teller machines (ATMs) in the United States (sometimes redundantly as \"ATM machine\"). In Canada, the term automated banking machine (ABM) is also used, although ATM is also very commonly used in Canada, with many Canadian organizations using ATM rather than ABM. In British English, the terms cashpoint, cash machine and hole in the wall are also used. ATMs that are not operated by a financial institution are known as \"white-label\" ATMs.\nUsing an ATM, customers can access their bank deposit or credit accounts in order to make a variety of financial transactions, most notably cash withdrawals "}
{"title": "teenager", "content": "Adolescence (from Latin  adolescere 'to mature') is a transitional stage of human physical and psychological development that generally occurs during the period from puberty to adulthood (typically corresponding to the age of majority). Adolescence is usually associated with the teenage years, but its physical, psychological or cultural expressions may begin earlier or end later. Puberty typically begins during preadolescence, particularly in females. Physical growth (particularly in males) and cognitive development can extend past the teens. Age provides only a rough marker of adolescence, and scholars have not agreed upon a precise definition. Some definitions start as early as 10 and end as late as 30. The World Health Organization definition officially designates adolescence as the phase of life from ages 10 to 19."}
{"title": "boar", "content": "The wild boar (Sus scrofa), also known as the wild swine, common wild pig, Eurasian wild pig, or simply wild pig, is a suid native to much of Eurasia and North Africa, and has been introduced to the Americas and Oceania. The species is now one of the widest-ranging mammals in the world, as well as the most widespread suiform. It has been assessed as least concern on the IUCN Red List due to its wide range, high numbers, and adaptability to a diversity of habitats. It has become an invasive species in part of its introduced range. Wild boars probably originated in Southeast Asia during the Early Pleistocene and outcompeted other suid species as they spread throughout the Old World.\nAs of 2005, up to 16 subspecies are recognized, which are divided into four regional groupings based on skull height and lacrimal bone length. The species lives in matriarchal societies consisting of interrelated females and their young (both male and female). Fully grown males are usually solitary outside th"}
{"title": "urinal", "content": "A urinal (US: , UK: ) is a sanitary plumbing fixture similar to a toilet, but for urination only. Urinals are often provided in men's public restrooms in Western countries (less so in Muslim countries). They are usually used in a standing position. Urinals can be equipped with manual flushing, automatic flushing, or without flushing, as is the case for waterless urinals. They can be arranged as single sanitary fixtures (with or without privacy walls), or in a trough design without privacy walls.\nUrinals designed for females (\"female urinals\") also exist but are rare. It is possible for females to use stand-up urinals using a female urination device. The term \"urinal\" may also apply to a small building or other structure containing such fixtures. It can also refer to a small container in which urine can be collected for medical analysis, or for use where access to toilet facilities is not possible, such as in small aircraft, during extended stakeouts, or for the bedridden."}
{"title": "children", "content": "A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. In English-speaking countries, the legal definition of child generally refers to a minor, in this case as a person younger than the local age of majority (there are exceptions such as, for example, the consume and purchase of alcoholic beverage even after said age of majority), regardless of their physical, mental and sexual development as biological adults. Children generally have fewer rights and responsibilities than adults. They are generally classed as unable to make serious decisions. \nChild may also describe a relationship with a parent (such as sons and daughters of any age) or, metaphorically, an authority figure, or signify group membership in a clan, tribe, or religion; it can also signify being strongly affected by a specific time, place, or circumstance, as in \"a child of nature\" or \"a"}
{"title": "lawn", "content": "A lawn () is an area of soil-covered land planted with grasses and other durable plants such as clover which are maintained at a short height with a lawn mower (or sometimes grazing animals) and used for aesthetic and recreational purposes—it is also commonly referred to as part of a garden. Lawns are usually composed only of grass species, subject to weed and pest control, maintained in a green color (e.g., by watering), and are regularly mowed to ensure an acceptable length. Lawns are used around houses, apartments, commercial buildings and offices. Many city parks also have large lawn areas. In recreational contexts, the specialised names turf, parade, pitch, field or green may be used, depending on the sport and the continent.\nThe term \"lawn\", referring to a managed grass space, dates to at least the 16th century. With suburban expansion, the lawn has become culturally ingrained in some areas of the world as part of the desired household aesthetic. However, awareness of the negativ"}
{"title": "fruits", "content": "In botany, a fruit is the seed-bearing structure in flowering plants (angiosperms) that is formed from the ovary after flowering.\nFruits are the means by which angiosperms disseminate their seeds. Edible fruits in particular have long propagated using the movements of humans and other animals in a symbiotic relationship that is the means for seed dispersal for the one group and nutrition for the other; humans, and many other animals, have become dependent on fruits as a source of food. Consequently, fruits account for a substantial fraction of the world's agricultural output, and some (such as the apple and the pomegranate) have acquired extensive cultural and symbolic meanings.\nIn common language and culinary usage, fruit normally means the seed-associated fleshy structures (or produce) of plants that typically are sweet (or sour) and edible in the raw state, such as apples, bananas, grapes, lemons, oranges, and strawberries. In botanical usage, the term fruit also includes many struc"}
{"title": "child", "content": "A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. In English-speaking countries, the legal definition of child generally refers to a minor, in this case as a person younger than the local age of majority (there are exceptions such as, for example, the consume and purchase of alcoholic beverage even after said age of majority), regardless of their physical, mental and sexual development as biological adults. Children generally have fewer rights and responsibilities than adults. They are generally classed as unable to make serious decisions. \nChild may also describe a relationship with a parent (such as sons and daughters of any age) or, metaphorically, an authority figure, or signify group membership in a clan, tribe, or religion; it can also signify being strongly affected by a specific time, place, or circumstance, as in \"a child of nature\" or \"a"}
{"title": "beans", "content": "A bean is the seed of some plants in the legume family (Fabaceae) used as a vegetable for human consumption or animal feed. The seeds are often preserved through drying (a pulse), but fresh beans are also sold. Dried beans are traditionally soaked and boiled, and used in many traditional dishes throughout the world. They can be cooked in different ways, however, including frying and baking. The unripe seedpods of some varieties are also eaten whole as green beans or edamame (immature soybean), but many fully ripened beans contain toxins like phytohemagglutinin and require cooking."}
{"title": "path", "content": "A path is a route for physical travel – see Trail.\nPath or PATH may also refer to:"}
{"title": "neighborhood", "content": "A neighbourhood (Commonwealth English) or neighborhood (American English) is a geographically localized community within a larger town, city, suburb or rural area, sometimes consisting of a single street and the buildings lining it. Neighbourhoods are often social communities with considerable face-to-face interaction among members. Researchers have not agreed on an exact definition, but the following may serve as a starting point: \"Neighbourhood is generally defined spatially as a specific geographic area and functionally as a set of social networks. Neighbourhoods, then, are the spatial units in which face-to-face social interactions occur—the personal settings and situations where residents seek to realise common values, socialise youth, and maintain effective social control.\""}
{"title": "pineapples", "content": "The pineapple (Ananas comosus) is a tropical plant with an edible fruit; it is the most economically significant plant in the family Bromeliaceae.\nThe pineapple is indigenous to South America, where it has been cultivated for many centuries. The introduction of the pineapple plant to Europe in the 17th century made it a significant cultural icon of luxury. Since the 1820s, pineapple has been commercially grown in greenhouses and many tropical plantations.\nPineapples grow as a small shrub; the individual flowers of the unpollinated plant fuse to form a multiple fruit. The plant normally propagates from the offset produced at the top of the fruit or from a side shoot, and typically matures within a year."}
{"title": "replica", "content": "A replica is an exact (usually 1:1 in scale) copy or remake of an object, made out of the same raw materials, whether a work of art, or a commercial product. The term is also used for copies that closely resemble the original, without claiming to be identical. Copies or reproductions of documents, books, manuscripts, maps or art prints are called facsimiles. \nReplicas have been sometimes sold as originals, a type of fraud. Most replicas have more innocent purposes. Fragile originals need protection, while the public can examine a replica in a museum. Replicas are often manufactured and sold as souvenirs.\nNot all incorrectly attributed items are intentional forgeries. In the same way that a museum shop might sell a print of a painting or a replica of a vase, copies of statues, paintings, and other precious artifacts have been popular through the ages.\nHowever, replicas have often been used illegally for forgery and counterfeits, especially of money and coins, but also commercial merchan"}
{"title": "surfboards", "content": "A surfboard is a narrow plank used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave. They were invented in ancient Hawaii, where they were known as papa heʻe nalu in the Hawaiian language, and were usually made of wood from local trees, such as koa. They were often over 460 cm (15 ft) in length and extremely heavy. Major advances over the years include the addition of one or more fins (skegs) on the bottom rear of the board to improve directional stability, and numerous improvements in materials and shape.\nModern surfboards are made of polyurethane or polystyrene foam. Unlike soft top surfboards, hard top surfboards are also covered with layers of fiberglass cloth, polyester or epoxy resin. The result is a light and strong surfboard that is buoyant and maneuverable. Recent developments in surfboard technology have included the use of carbon fiber and kevlar composites, as well as experimentation in b"}
{"title": "furniture", "content": "Furniture refers to objects intended to support various human activities such as seating (e.g., stools, chairs, and sofas), eating (tables), storing items, working, and sleeping (e.g., beds and hammocks). Furniture is also used to hold objects at a convenient height for work (as horizontal surfaces above the ground, such as tables and desks), or to store things (e.g., cupboards, shelves, and drawers). Furniture can be a product of design and can be considered a form of decorative art. In addition to furniture's functional role, it can serve a symbolic or religious purpose. It can be made from a vast multitude of materials, including metal, plastic, and wood. Furniture can be made using a variety of woodworking joints which often reflects the local culture.\nPeople have been using natural objects, such as tree stumps, rocks and moss, as furniture since the beginning of human civilization and continues today in some households/campsites. Archaeological research shows that from around 30,0"}
{"title": "pasture", "content": "Pasture (from the Latin pastus, past participle of pascere, \"to feed\") is land used for grazing."}
{"title": "rock", "content": "Rock most often refers to:\n\nRock (geology), a naturally occurring solid aggregate of minerals or mineraloids\nRock music, a genre of popular music\nRock or Rocks may also refer to:"}
{"title": "name", "content": "A name is a term used for identification by an external observer. They can identify a class or category of things, or a single thing, either uniquely, or within a given context. The entity identified by a name is called its referent. A personal name identifies, not necessarily uniquely, a specific individual human. The name of a specific entity is sometimes called a proper name (although that term has a philosophical meaning as well) and is, when consisting of only one word, a proper noun. Other nouns are sometimes called \"common names\" or (obsolete) \"general names\". A name can be given to a person, place, or thing; for example, parents can give their child a name or a scientist can give an element a name."}
{"title": "magnets", "content": "A magnet is a material or object that produces a magnetic field. This magnetic field is invisible but is responsible for the most notable property of a magnet: a force that pulls on other ferromagnetic materials, such as iron, steel, nickel, cobalt, etc. and attracts or repels other magnets.\nA permanent magnet is an object made from a material that is magnetized and creates its own persistent magnetic field. An everyday example is a refrigerator magnet used to hold notes on a refrigerator door. Materials that can be magnetized, which are also the ones that are strongly attracted to a magnet, are called ferromagnetic (or ferrimagnetic). These include the elements iron, nickel and cobalt and their alloys, some alloys of rare-earth metals, and some naturally occurring minerals such as lodestone. Although ferromagnetic (and ferrimagnetic) materials are the only ones attracted to a magnet strongly enough to be commonly considered magnetic, all other substances respond weakly to a magnetic f"}
{"title": "carrots", "content": "The carrot (Daucus carota subsp. sativus) is a root vegetable, typically orange in colour, though heirloom variants including purple, black, red, white, and yellow cultivars exist, all of which are domesticated forms of the wild carrot, Daucus carota, native to Europe and Southwestern Asia. The plant probably originated in Iran and was originally cultivated for its leaves and seeds. \nThe carrot is a biennial plant in the umbellifer family, Apiaceae. World production of carrots (combined with turnips) for 2022 was 42 million tonnes, led by China producing 44% of the total. \nThe characteristic orange colour is from beta-carotene, making carrots a rich source of  vitamin A. A myth that carrots help people to see in the dark was spread as propaganda in the Second World War, to account for the ability of British pilots to fight in the dark; the real explanation was the introduction of radar."}
{"title": "hydrant", "content": "A hydrant is an outlet from a fluid main often consisting of an upright pipe with a valve attached, from which fluid (e.g. water or fuel) can be tapped.\nDepending on the fluid involved, the term may refer to:\n\nFire hydrant for firefighting water supply\nFlushing hydrant for cleaning water mains\nHydrant network systems used to transport aviation fuel from an oil depot to an airport, to fuel aircraft\nSnowmaking hydrants, which use water and air\nStandpipe (street), a type of domestic or neighbourhood hydrant for dispensing water when supply is interrupted or absent"}
{"title": "they", "content": "In Modern English, they is a third-person pronoun relating to a grammatical subject."}
{"title": "s", "content": "S, or s, is the nineteenth letter of the Latin alphabet, used in the English alphabet, the alphabets of other western European languages and other latin alphabets worldwide. Its name in English is ess (pronounced  ), plural esses."}
{"title": "surface", "content": "A surface, as the term is most generally used, is the outermost or uppermost layer of a physical object or space. It is the portion or region of the object that can first be perceived by an observer using the senses of sight and touch, and is the portion with which other materials first interact. The surface of an object is more than \"a mere geometric solid\", but is \"filled with, spread over by, or suffused with perceivable qualities such as color and warmth\".\nThe concept of surface has been abstracted and formalized in mathematics, specifically in geometry. Depending on the properties on which the emphasis is given, there are several inequivalent such formalizations that are all called surface, sometimes with a qualifier such as algebraic surface, smooth surface or fractal surface.\nThe concept of surface and its mathematical abstractions are both widely used in physics, engineering, computer graphics, and many other disciplines, primarily in representing the surfaces of physical objec"}
{"title": "bowl", "content": "A bowl is a typically round dish or container generally used for preparing, serving, storing, or consuming food. The interior of a bowl is characteristically shaped like a spherical cap, with the edges and the bottom, forming a seamless curve. This makes bowls especially suited for holding liquids and loose food, as the contents of the bowl are naturally concentrated in its center by the force of gravity. The exterior of a bowl is most often round, but can be of any shape, including rectangular.\nThe size of bowls varies from small bowls used to hold a single serving of food to large bowls, such as punch bowls or salad bowls, that are often used to hold or store more than one portion of food. There is some overlap between bowls, cups, and plates. Very small bowls, such as the tea bowl, are often called cups, while plates with especially deep wells are often called bowls.\nIn many cultures, bowls are the most common kind of vessel used for serving and eating food. Historically, small bowl"}
{"title": "snowboarders", "content": "Snowboards are boards where the user places both feet, usually secured, to the same board. The board itself is wider than most skis, with the ability to glide on snow. Snowboards widths are between 6 and 12 inches or 15 to 30 centimeters. Snowboards are differentiated from monoskis by the stance of the user. In monoskiing, the user stands with feet inline with direction of travel (facing tip of monoski/downhill) (parallel to long axis of board), whereas in snowboarding, users stand with feet transverse (more or less) to the longitude of the board. Users of such equipment may be referred to as snowboarders. Commercial snowboards generally require extra equipment, such as bindings and special boots which help secure both feet of a snowboarder, who generally ride in an upright position. These types of boards are commonly used by people at ski hills, mountains, backcountry, or resorts for leisure, entertainment, and competitive purposes in the activity called snowboarding."}
{"title": "shoe", "content": "A shoe is an item of footwear intended to protect and comfort the human foot. Though the human foot can adapt to varied terrains and climate conditions, it is vulnerable, and shoes provide protection. Form was originally tied to function, but over time, shoes also became fashion items. Some shoes are worn as safety equipment, such as steel-toe boots, which are required footwear at industrial worksites.\nAdditionally, shoes have often evolved into many different designs; high heels, for instance, are most commonly worn by women during fancy occasions. Contemporary footwear varies vastly in style, complexity and cost. Basic sandals may consist of only a thin sole and simple strap and be sold for a low cost. High fashion shoes made by famous designers may be made of expensive materials, use complex construction and sell for large sums of money. Some shoes are designed for specific purposes, such as boots designed specifically for mountaineering or skiing, while others have more generalized"}
{"title": "cabinets", "content": "A cabinet in governing is a group of people with the constitutional or legal task to rule a country or state, or advise a head of state, usually from the executive branch. Their members are known as ministers and  secretaries and they are often appointed by either heads of state or government. Cabinets are typically the body responsible for the day-to-day management of the government and response to sudden events, whereas the legislative and judicial branches work in a measured pace, in sessions according to lengthy procedures.\nThe function of a cabinet varies: in some countries, it is a collegiate decision-making body with collective responsibility, while in others it may function either as a purely advisory body or an assisting institution to a decision-making head of state or head of government. \nIn some countries, particularly those that use a parliamentary system (e.g., the United Kingdom), the cabinet collectively decides the government's direction, especially in regard to legisl"}
{"title": "gear", "content": "A gear or gearwheel is a rotating machine part typically used to transmit rotational motion and/or torque by means of a series of teeth that engage with compatible teeth of another gear or other part.  The teeth can be integral saliences or cavities machined on the part, or separate pegs inserted into it.  In the latter case, the gear is usually called a cogwheel.  A cog may be one of those pegs or the whole gear.  Two or more meshing gears are called a gear train. \nThe smaller member of a pair of meshing gears is often called pinion.  Most commonly, gears and gear trains can be used to trade torque for rotational speed between two axles or other rotating parts and/or to change the axis of rotation and/or to invert the sense of rotation. A gear may also be used to transmit linear force and/or linear motion to a rack, a straight bar with a row of compatible teeth.  \n\nGears are among the most common mechanical parts.  They come in a great variety of shapes and materials, and are used for"}
{"title": "wedges", "content": "A wedge is a triangular shaped tool, a portable inclined plane, and one of the six simple machines. It can be used to separate two objects or portions of an object, lift up an object, or hold an object in place. It functions by converting a force applied to its blunt end into forces perpendicular (normal) to its inclined surfaces.  The mechanical advantage of a wedge is given by the ratio of the length of its slope to its width. Although a short wedge with a wide angle may do a job faster, it requires more force than a long wedge with a narrow angle.\nThe force is applied on a flat, broad surface. This energy is transported to the pointy, sharp end of the wedge, hence the force is transported.\nThe wedge simply transports energy in the form of friction and collects it to the pointy end, consequently breaking the item."}
{"title": "images", "content": "An image or picture is a visual representation. An image can be two-dimensional, such as a drawing, painting, or photograph, or three-dimensional, such as a carving or sculpture. Images may be displayed through other media, including a projection on a surface, activation of electronic signals, or digital displays; they can also be reproduced through mechanical means, such as photography, printmaking, or photocopying. Images can also be animated through digital or physical processes.\nIn the context of signal processing, an image is a distributed amplitude of color(s). In optics, the term image (or optical image) refers specifically to the reproduction of an object formed by light waves coming from the object.\nA volatile image exists or is perceived only for a short period. This may be a reflection of an object by a mirror, a projection of a camera obscura, or a scene displayed on a cathode-ray tube. A fixed image, also called a hard copy, is one that has been recorded on a material obje"}
{"title": "elephants", "content": "Elephants are the largest living land animals. Three living species are currently recognised: the African bush elephant (Loxodonta africana), the African forest elephant (L. cyclotis), and the Asian elephant (Elephas maximus). They are the only surviving members of the family Elephantidae and the order Proboscidea; extinct relatives include mammoths and mastodons. Distinctive features of elephants include a long proboscis called a trunk, tusks, large ear flaps, pillar-like legs, and tough but sensitive grey skin. The trunk is prehensile, bringing food and water to the mouth and grasping objects. Tusks, which are derived from the incisor teeth, serve both as weapons and as tools for moving objects and digging. The large ear flaps assist in maintaining a constant body temperature as well as in communication. African elephants have larger ears and concave backs, whereas Asian elephants have smaller ears and convex or level backs.\nElephants are scattered throughout sub-Saharan Africa, Sout"}
{"title": "road", "content": "A road is a thoroughfare used primarily for movement of traffic. Roads differ from streets, whose primary use is local access. They also differ from stroads, which combine the features of streets and roads. Most modern roads are paved.\nThe words \"road\" and \"street\" are commonly considered to be interchangeable, but the distinction is important in urban design.\nThere are many types of roads, including parkways, avenues, controlled-access highways (freeways, motorways, and expressways), tollways, interstates, highways, and local roads.\nThe primary features of roads include lanes, sidewalks (pavement), roadways (carriageways), medians, shoulders, verges, bike paths (cycle paths), and shared-use paths."}
{"title": "clown", "content": "A clown is a person who performs physical comedy and arts in an open-ended fashion, typically while wearing distinct makeup or costuming and reversing folkway-norms. The art of performing as a clown is known as clowning or buffoonery, and the term \"clown\" may be used synonymously with predecessors like jester, joker, buffoon, fool, or harlequin. Clowns have a diverse tradition with significant variations in costume and performance. The most recognisable clowns are those that commonly perform in the circus, characterized by colorful wigs, red noses, and oversized shoes. However, clowns have also played roles in theater and folklore, like the court jesters of the Middle Ages and the jesters and ritual clowns of various indigenous cultures. Their performances can elicit a range of emotions, from humor and laughter to fear and discomfort, reflecting complex societal and psychological dimensions. Through the centuries, clowns have continued to play significant roles in society, evolving alo"}
{"title": "land", "content": "Land, also known as dry land, ground, or earth, is the solid terrestrial surface of Earth not submerged by the ocean or another body of water. It makes up 29.2% of Earth's surface and includes all continents and islands. Earth's land surface is almost entirely covered by regolith, a layer of rock, soil, and minerals that forms the outer part of the crust. Land plays an important role in Earth's climate system, being involved in the carbon cycle, nitrogen cycle, and water cycle. One-third of land is covered in trees, another third is used for agriculture, and one-tenth is covered in permanent snow and glaciers. The remainder consists of desert, savannah, and prairie.\nLand terrain varies greatly, consisting of mountains, deserts, plains, plateaus, glaciers, and other landforms. In physical geology, the land is divided into two major categories: Mountain ranges and relatively flat interiors called cratons. Both form over millions of years through plate tectonics. Streams – a major part of"}
{"title": "fruit", "content": "In botany, a fruit is the seed-bearing structure in flowering plants (angiosperms) that is formed from the ovary after flowering.\nFruits are the means by which angiosperms disseminate their seeds. Edible fruits in particular have long propagated using the movements of humans and other animals in a symbiotic relationship that is the means for seed dispersal for the one group and nutrition for the other; humans, and many other animals, have become dependent on fruits as a source of food. Consequently, fruits account for a substantial fraction of the world's agricultural output, and some (such as the apple and the pomegranate) have acquired extensive cultural and symbolic meanings.\nIn common language and culinary usage, fruit normally means the seed-associated fleshy structures (or produce) of plants that typically are sweet (or sour) and edible in the raw state, such as apples, bananas, grapes, lemons, oranges, and strawberries. In botanical usage, the term fruit also includes many struc"}
{"title": "photograph", "content": "A photograph (also known as a photo, or more generically referred to as an image or picture) is an image created by light falling on a photosensitive surface, usually photographic film or an electronic image sensor. The process and practice of creating such images is called photography.\nMost photographs are now created using a smartphone or camera, which uses a lens to focus the scene's visible wavelengths of light into a reproduction of what the human eye would perceive."}
{"title": "hamburger", "content": "A hamburger (or simply a burger) consists of fillings—usually a patty of ground meat, typically beef—placed inside a sliced bun or bread roll. The patties are often served with cheese, lettuce, tomato, onion, pickles, bacon, or chilis with condiments such as ketchup, mustard, mayonnaise, relish or a \"special sauce\", often a variation of Thousand Island dressing, and are frequently placed on sesame seed buns. A hamburger patty topped with cheese is called a cheeseburger. Under some definitions, and in some cultures, a hamburger is considered a sandwich.\nHamburgers are typically associated with fast-food restaurants and diners but are also sold at other restaurants, including high-end establishments. There are many international and regional variations of hamburgers. Some of the largest multinational fast-food chains feature burgers as one of their core products: McDonald's Big Mac and Burger King's Whopper have become global icons of American culture."}
{"title": "cheese", "content": "Cheese is a type of dairy product produced in a range of flavors, textures, and forms by coagulation of the milk protein casein. It comprises proteins and fat from milk (usually the milk of cows, buffalo, goats or sheep). During production, milk is usually acidified and either the enzymes of rennet or bacterial enzymes with similar activity are added to cause the casein to coagulate. The solid curds are then separated from the liquid whey and pressed into finished cheese. Some cheeses have aromatic molds on the rind, the outer layer, or throughout.\nOver a thousand types of cheese exist, produced in various countries. Their styles, textures and flavors depend on the origin of the milk (including the animal's diet), whether they have been pasteurised, the butterfat content, the bacteria and mold, the processing, and how long they have been aged. Herbs, spices, or wood smoke may be used as flavoring agents.  Other added ingredients may include black pepper, garlic, chives or cranberries. "}
{"title": "pizza", "content": "Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples. In 2009, Neapolitan pizza was registered with the European Union as a traditional speciality guaranteed (TSG) dish. In 2017, the art of making Neapolitan pizza was included on UNESCO's list of intangible cultural heritage.\nPizza and its variants are among the most popular foods in the world. Pizza is sold at a variety of restaurants, including pizzerias (pizza specialty restaurants), Mediterranean restaurants, via delivery, and as street food. In Italy, pizza served in a restaurant is presented unsliced, and is eaten with the use of a kn"}
{"title": "group", "content": "A group is a number of persons or things that are located, gathered, or classed together."}
{"title": "photos", "content": "A photograph (also known as a photo, or more generically referred to as an image or picture) is an image created by light falling on a photosensitive surface, usually photographic film or an electronic image sensor. The process and practice of creating such images is called photography.\nMost photographs are now created using a smartphone or camera, which uses a lens to focus the scene's visible wavelengths of light into a reproduction of what the human eye would perceive."}
{"title": "air", "content": "An atmosphere (from Ancient Greek  ἀτμός (atmós) 'vapour, steam' and  σφαῖρα (sphaîra) 'sphere') is a layer of gases that envelop an astronomical object, held in place by the gravity of the object. A planet retains an atmosphere when the gravity is great and the temperature of the atmosphere is low. A stellar atmosphere is the outer region of a star, which includes the layers above the opaque photosphere; stars of low temperature might have outer atmospheres containing compound molecules.\nThe atmosphere of Earth is composed of nitrogen (78%), oxygen (21%), argon (0.9%), carbon dioxide (0.04%) and trace gases. Most organisms use oxygen for respiration; lightning and bacteria perform nitrogen fixation which produces ammonia that is used to make nucleotides and amino acids; plants, algae, and cyanobacteria use carbon dioxide for photosynthesis. The layered composition of the atmosphere minimises the harmful effects of sunlight, ultraviolet radiation, solar wind, and cosmic rays and thus p"}
{"title": "aircraft", "content": "An aircraft (pl. aircraft) is a vehicle that is able to fly by gaining support from the air. It counters the force of gravity by using either static lift or the dynamic lift of an airfoil, or, in a few cases, direct downward thrust from its engines. Common examples of aircraft include airplanes, rotorcraft (including helicopters), airships (including blimps), gliders, paramotors, and hot air balloons. Part 1 (Definitions and Abbreviations) of Subchapter A of Chapter I of Title 14 of the U. S. Code of Federal Regulations states that aircraft \"means a device that is used or intended to be used for flight in the air.\"\nThe human activity that surrounds aircraft is called aviation. The science of aviation, including designing and building aircraft, is called aeronautics. Crewed aircraft are flown by an onboard pilot, whereas unmanned aerial vehicles may be remotely controlled or self-controlled by onboard computers. Aircraft may be classified by different criteria, such as lift type, aircra"}
{"title": "park", "content": "A park is an area of natural, semi-natural or planted space set aside for human enjoyment and recreation or for the protection of wildlife or natural habitats. Urban parks are green spaces set aside for recreation inside towns and cities. National parks and country parks are green spaces used for recreation in the countryside. State parks and provincial parks are administered by sub-national government states and agencies. Parks may consist of grassy areas, rocks, soil and trees, but may also contain buildings and other artifacts such as monuments, fountains or playground structures. Many parks have fields for playing sports such as baseball and football, and paved areas for games such as basketball. Many parks have trails for walking, biking and other activities. Some parks are built adjacent to bodies of water or watercourses and may comprise a beach or boat dock area. Urban parks often have benches for sitting and may contain picnic tables and barbecue grills.\nThe largest parks can "}
{"title": "male", "content": "Male (symbol: ♂) is the sex of an organism that produces the gamete (sex cell) known as sperm, which fuses with the larger female gamete, or ovum, in the process of fertilisation. A male organism cannot reproduce sexually without access to at least one ovum from a female, but some organisms can reproduce both sexually and asexually. Most male mammals, including male humans, have a Y chromosome, which codes for the production of larger amounts of testosterone to develop male reproductive organs.\nIn humans, the word male can also be used to refer to gender, in the social sense of gender role or gender identity."}
{"title": "jacket", "content": "A jacket is a garment for the upper body, usually extending below the hips. A jacket typically has sleeves and fastens in the front or slightly on the side. Jackets without sleeves are vests. A jacket is generally lighter, tighter-fitting, and less insulating than a coat, but both are outerwear. Some jackets are fashionable, while some others serve as protective clothing."}
{"title": "cheeses", "content": "Cheese is a type of dairy product produced in a range of flavors, textures, and forms by coagulation of the milk protein casein. It comprises proteins and fat from milk (usually the milk of cows, buffalo, goats or sheep). During production, milk is usually acidified and either the enzymes of rennet or bacterial enzymes with similar activity are added to cause the casein to coagulate. The solid curds are then separated from the liquid whey and pressed into finished cheese. Some cheeses have aromatic molds on the rind, the outer layer, or throughout.\nOver a thousand types of cheese exist, produced in various countries. Their styles, textures and flavors depend on the origin of the milk (including the animal's diet), whether they have been pasteurised, the butterfat content, the bacteria and mold, the processing, and how long they have been aged. Herbs, spices, or wood smoke may be used as flavoring agents.  Other added ingredients may include black pepper, garlic, chives or cranberries. "}
{"title": "fence", "content": "A fence is a structure that encloses an area, typically outdoors, and is usually constructed from posts that are connected by boards, wire, rails or netting. A fence differs from a wall in not having a solid foundation along its whole length.\nAlternatives to fencing include a ditch (sometimes filled with water, forming a moat)."}
{"title": "guitar", "content": "The guitar is a stringed musical instrument that is usually fretted (with some exceptions) and typically has six or twelve strings. It is usually held flat against the player's body and played by strumming or plucking the strings with the dominant hand, while simultaneously pressing selected strings against frets with the fingers of the opposite hand. A guitar pick may also be used to strike the strings. The sound of the guitar is projected either acoustically, by means of a resonant hollow chamber on the guitar, or amplified by an electronic pickup and an amplifier.\nThe guitar is classified as a chordophone, meaning the sound is produced by a vibrating string stretched between two fixed points.  Historically, a guitar was constructed from wood, with its strings made of catgut. Steel guitar strings were introduced near the end of the nineteenth century in the United States, but nylon and steel strings became mainstream only following World War II. The guitar's ancestors include the git"}
{"title": "helmets", "content": "A helmet is a form of protective gear worn to protect the head. More specifically, a helmet complements the skull in protecting the human brain. Ceremonial or symbolic helmets (e.g., a policeman's helmet in the United Kingdom) without protective function are sometimes worn. Soldiers wear combat helmets, often made from Kevlar or other lightweight synthetic fibers.\nThe word helmet is derived from helm, an Old English word for a protective head covering.\nHelmets are used for most sports (e.g., jockeys, American football, ice hockey, cricket, baseball, skiing, hurling and rock climbing); dangerous work activities such as construction, mining, riot police, military aviation, and in transportation (e.g. motorcycle helmets and bicycle helmets). Since the 1990s, most helmets are made from resin or plastic, which may be reinforced with fibers such as aramids."}
{"title": "grass", "content": "Poaceae ( poh-AY-see-e(y)e), also called Gramineae ( grə-MIN-ee-e(y)e), is a large and nearly ubiquitous family of monocotyledonous flowering plants commonly known as grasses. It includes the cereal grasses, bamboos, the grasses of natural grassland and species cultivated in lawns and pasture. The latter are commonly referred to collectively as grass.\nWith around 780 genera and around 12,000 species, the Poaceae is the fifth-largest plant family, following the Asteraceae, Orchidaceae, Fabaceae and Rubiaceae.\nThe Poaceae are the most economically important plant family, including staple foods from domesticated cereal crops such as maize, wheat, rice, oats, barley, and millet for people and as feed for meat-producing animals. They provide, through direct human consumption, just over one-half (51%) of all dietary energy; rice provides 20%, wheat supplies 20%, maize (corn) 5.5%, and other grains 6%. Some members of the Poaceae are used as building materials (bamboo, thatch, and straw); oth"}
{"title": "racquet", "content": "A racket or racquet is an item of sporting equipment used to strike a ball or shuttlecock in a variety of sports. A racket consists of three major components: a widened distal end known as the head, an elongated handle known as the grip, and a reinforced connection between the head and handle known as the throat or heart.  The head of the racket forms a flattened firm surface, known as the face, which is used to strike the ball or shuttlecock.\nIn the strictest sense, the word \"racket\" specifically refers to a striking implement with a mesh face made of interlaced, tightly stretched strings fixed on an ovoid frame known as the rim. This type of racket is used in sports such as tennis, badminton, and racquetball. Some rackets have a rigid one-piece head with a solid or fenestrated face instead of a meshwork of strings. Such rackets are called a paddle or bat, and are used in sports such as table tennis, pickleball and padel. Collectively, sporting games using rackets and paddles are all "}
{"title": "lights", "content": "Light is an electromagnetic radiation, part of which stimulates the sense of vision.\nLight or Lights may also refer to:"}
{"title": "car", "content": "A car, or an automobile, is a motor vehicle with wheels. Most definitions of cars state that they run primarily on roads, seat one to eight people, have four wheels, and mainly transport people rather than cargo. There are around one billion cars in use worldwide.\nThe French inventor Nicolas-Joseph Cugnot built the first steam-powered road vehicle in 1769, while the Swiss inventor François Isaac de Rivaz designed and constructed the first internal combustion-powered automobile in 1808. The modern car—a practical, marketable automobile for everyday use—was invented in 1886, when the German inventor Carl Benz patented his Benz Patent-Motorwagen. Commercial cars became widely available during the 20th century. The 1901 Oldsmobile Curved Dash and the 1908 Ford Model T, both American cars, are widely considered the first mass-produced and mass-affordable cars, respectively. Cars were rapidly adopted in the US, where they replaced horse-drawn carriages. In Europe and other parts of the world"}
{"title": "animal", "content": "Animals are multicellular, eukaryotic organisms in the biological kingdom Animalia (). With few exceptions, animals consume organic material, breathe oxygen, have myocytes and are able to move, can reproduce sexually, and grow from a hollow sphere of cells, the blastula, during embryonic development. Animals form a clade, meaning that they arose from a single common ancestor. Over 1.5 million living animal species have been described, of which around 1.05 million are insects, over 85,000 are molluscs, and around 65,000 are vertebrates. It has been estimated there are as many as 7.77 million animal species on Earth. Animal body lengths range from 8.5 μm (0.00033 in) to 33.6 m (110 ft). They have complex ecologies and interactions with each other and their environments, forming intricate food webs. The scientific study of animals is known as zoology, and the study of animal behaviour is known as ethology.\nThe animal kingdom is divided into five major clades, namely Porifera, Ctenophora, "}
{"title": "lid", "content": "A lid or cover is part of a container, and serves as the closure or seal, usually one that completely closes the object. Lids can be placed on small containers such as tubs as well as larger lids for open-head pails and drums."}
{"title": "mouse", "content": "A mouse (pl.: mice) is a small rodent. Characteristically, mice are known to have a pointed snout, small rounded ears, a body-length scaly tail, and a high breeding rate. The best known mouse species is the common house mouse (Mus musculus). Mice are also popular as pets. In some places, certain kinds of field mice are locally common. They are known to invade homes for food and shelter.\nMice are typically distinguished from rats by their size. Generally, when a muroid rodent is discovered, its common name includes the term mouse if it is smaller, or rat if it is larger. The common terms rat and mouse are not taxonomically specific. Typical mice are classified in the genus Mus, but the term mouse is not confined to members of Mus and can also apply to species from other genera such as the deer mouse (Peromyscus).\nDomestic mice sold as pets often differ substantially in size from the common house mouse. This is attributable to breeding and different conditions in the wild. The best-known"}
{"title": "cucumbers", "content": "The cucumber (Cucumis sativus) is a widely-cultivated creeping vine plant in the family Cucurbitaceae that bears cylindrical to spherical fruits, which are used as culinary vegetables. Considered an annual plant, there are three main types of cucumber—slicing, pickling, and seedless—within which several cultivars have been created. The cucumber originates in Asia extending from India, Nepal, Bangladesh, China (Yunnan, Guizhou, Guangxi), and Northern Thailand, but now grows on most continents, and many different types of cucumber are grown commercially and traded on the global market. In North America, the term wild cucumber refers to plants in the genera Echinocystis and Marah, though the two are not closely related."}
{"title": "pie", "content": "A pie is a baked dish which is usually made of a pastry dough casing that contains a filling of various sweet or savoury ingredients. Sweet pies may be filled with fruit (as in an apple pie), nuts (pecan pie), fruit preserves (jam tart), brown sugar (sugar pie), sweetened vegetables (rhubarb pie), or with thicker fillings based on eggs and dairy (as in custard pie and cream pie). Savoury pies may be filled with meat (as in a steak pie or a Jamaican patty), eggs and cheese (such as quiches or British flans) or a mixture of meat and vegetables (pot pie).\nPies are defined by their crusts. A filled pie (also single-crust or bottom-crust), has pastry lining the baking dish, and the filling is placed on top of the pastry but left open. A top-crust pie has the filling in the bottom of the dish and is covered with a pastry or other covering before baking. A two-crust pie has the filling completely enclosed in the pastry shell. Shortcrust pastry is a typical kind of pastry used for pie crusts, "}
{"title": "buttons", "content": "A button is a  fastener that joins two pieces of fabric together by slipping through a loop or by sliding through a buttonhole.\nIn modern clothing and fashion design, buttons are commonly made of plastic but also may be made of metal, wood, or seashell. Buttons can also be used on containers such as wallets and bags. Buttons may be sewn onto garments and similar items exclusively for purposes of ornamentation. In the applied arts and craft, a button can be an example of folk art, studio craft, or even a miniature work of art. In archaeology, a button can be a significant artifact."}
{"title": "boy", "content": "A boy is a young male human. The term is commonly used for a child or an adolescent. When a male human reaches adulthood, he is usually described as a man."}
{"title": "shirt", "content": "A shirt is a cloth garment for the upper body (from the neck to the waist).\nOriginally an undergarment worn exclusively by men, it has become, in American English, a catch-all term for a broad variety of upper-body garments and undergarments. In British English, a shirt is more specifically a garment with a collar, sleeves with cuffs, and a full vertical opening with buttons or snaps (North Americans would call that a \"dress shirt\", a specific type of collared shirt). A shirt can also be worn with a necktie under the shirt collar."}
{"title": "cat", "content": "The cat (Felis catus), also referred to as the domestic cat or house cat, is a small domesticated carnivorous mammal. It is the only domesticated species of the family Felidae. Advances in archaeology and genetics have shown that the domestication of the cat occurred in the Near East around 7500 BC. It is commonly kept as a pet and working cat, but also ranges freely as a feral cat avoiding human contact. It is valued by humans for companionship and its ability to kill vermin. Its retractable claws are adapted to killing small prey species such as mice and rats. It has a strong, flexible body, quick reflexes, and sharp teeth, and its night vision and sense of smell are well developed. It is a social species, but a solitary hunter and a crepuscular predator.\nCat intelligence is evident in their ability to adapt, learn through observation, and solve problems. Research has shown they possess strong memories, exhibit neuroplasticity, and display cognitive skills comparable to those of a yo"}
{"title": "figurines", "content": "A figurine is a small statuette that represents a human, deity or animal.\nFigurine or Figurines may also refer to:\n\nFigurine (band), American electronica band\nFigurines (band), Danish indie rock band\nThe Figurine, a 2009 thriller film produced and directed by Kunle Afolayan"}
{"title": "toothbrush", "content": "A toothbrush is a special type of brush used to clean the teeth, gums, and tongue. It consists of a head of tightly clustered bristles, atop of which toothpaste can be applied, mounted on a handle which facilitates the cleaning of hard-to-reach areas of the mouth. They should be used in conjunction with something to clean between the teeth where the bristles of the toothbrush cannot reach - for example floss, tape, interdental brushes or toothpicks.\nThey are available with different bristle textures, sizes, and forms. Most dentists recommend using a soft toothbrush since hard-bristled toothbrushes can damage tooth enamel and irritate the gums.\nBecause many common and effective ingredients in toothpaste are harmful if swallowed in large doses, tooth paste should instead be spat out. The act of brushing teeth is most often done at a sink within the kitchen or bathroom, where the brush may be rinsed off afterwards to remove any debris remaining and then dried to reduce conditions ideal fo"}
{"title": "pink", "content": "Pink is a pale tint of red, the color of the pink flower. It was first used as a color name in the late 17th century. According to surveys in Europe and the United States, pink is the color most often associated with charm, politeness, sensitivity, tenderness, sweetness, childhood, femininity, and romance. A combination of pink and white is associated with innocence, whereas a combination of pink and black links to eroticism and seduction. In the 21st century, pink is seen as a symbol of femininity, though it has not always been seen this way. In the 1920s, light red, which is similar to pink, was seen as a color that reflected masculinity."}
{"title": "waffle", "content": "A waffle is a dish made from leavened batter or dough that is cooked between two plates that are patterned to give a characteristic size, shape, and surface impression. There are many variations based on the type of waffle iron and recipe used. Waffles are eaten throughout the world, particularly in Belgium, which has over a dozen regional varieties.  Waffles may be made fresh or simply heated after having been commercially cooked and frozen."}
{"title": "surfing", "content": "Surfing is a surface water sport in which an individual, a surfer (or two in tandem surfing), uses a board to ride on the forward section, or face, of a moving wave of water, which usually carries the surfer towards the shore. Waves suitable for surfing are primarily found on ocean shores, but can also be found as standing waves in the open ocean, in lakes, in rivers in the form of a tidal bore, or wave pools.\nSurfing includes all forms of wave-riding using a board, regardless of the stance. There are several types of boards. The Moche of Peru would often surf on reed craft, while the native peoples of the Pacific surfed waves on alaia, paipo, and other such watercraft. Ancient cultures often surfed on their belly and knees, while modern-day surfing is most often stand-up surfing, in which a surfer rides a wave while standing on a surfboard.\nAnother prominent form of surfing is body boarding, where a surfer rides the wave on a bodyboard, either lying on their belly, drop knee (one foot"}
{"title": "cave", "content": "Caves or caverns are natural voids under the Earth's surface. Caves often form by the weathering of rock and often extend deep underground. Exogene caves are smaller openings that extend a relatively short distance underground (such as rock shelters). Caves which extend further underground than the opening is wide are called endogene caves.\nSpeleology is the science of exploration and study of all aspects of caves and the cave environment. Visiting or exploring caves for recreation may be called caving, potholing, or spelunking."}
{"title": "sky", "content": "The sky is an unobstructed view upward from the surface of the Earth. It includes the atmosphere and outer space. It may also be considered a place between the ground and outer space, thus distinct from outer space.\nIn the field of astronomy, the sky is also called the celestial sphere. This is an abstract sphere, concentric to the Earth, on which the Sun, Moon, planets, and stars appear to be drifting. The celestial sphere is conventionally divided into designated areas called constellations.\nUsually, the term sky informally refers to a perspective from the Earth's surface; however, the meaning and usage can vary. An observer on the surface of the Earth can see a small part of the sky, which resembles a dome (sometimes called the sky bowl) appearing flatter during the day than at night. In some cases, such as in discussing the weather, the sky refers to only the lower, denser layers of the atmosphere.\nThe daytime sky appears blue because air molecules scatter shorter wavelengths of su"}
{"title": "bottle", "content": "A bottle is a narrow-necked container made of an impermeable material (such as glass, plastic or aluminium) in various shapes and sizes that stores and transports liquids. Its mouth, at the bottling line, can be sealed with an internal stopper, an external bottle cap, a closure, or induction sealing."}
{"title": "sandwiches", "content": "A sandwich is a dish typically consisting variously of meat, cheese, sauces, and vegetables used as a filling between slices of bread, or placed atop a slice of bread; or, more generally, any dish in which bread serves as a container or wrapper for another food type, and allows it to be a finger food. The sandwich began as a portable, convenient food in the Western world, though over time it has become prevalent worldwide.\nThere has been social media debate over the precise definition of sandwich, specifically whether a hot dog or open sandwich can be categorized as such. Other items, like hamburgers and burritos, were also considered. In the United States, the Department of Agriculture (USDA) and the Food and Drug Administration (FDA) are the responsible agencies for protecting the definition of sandwich. The USDA uses the definition, \"at least 35% cooked meat and no more than 50% bread\" for closed sandwiches, and \"at least 50% cooked meat\" for open sandwiches. However, the same USDA "}
{"title": "bread", "content": "Bread is a baked food product made from water, flour, and often yeast. It is a staple food across the world, particularly in Europe and the Middle East. Throughout recorded history and around the world, it has been an important part of many cultures' diets. It is one of the oldest human-made foods, having been of significance since the dawn of agriculture, and plays an essential role in both religious rituals and secular culture.\nBread may be leavened by naturally occurring microbes (e.g. sourdough), chemicals (e.g. baking soda), industrially produced yeast, or high-pressure aeration, which creates the gas bubbles that fluff up bread. Bread may also be unleavened. In many countries, mass-produced bread often contains additives to improve flavor, texture, color, shelf life, nutrition, and ease of production."}
{"title": "trucks", "content": "A truck or lorry is a motor vehicle designed to transport freight, carry specialized payloads, or perform other utilitarian work. Trucks vary greatly in size, power, and configuration, but the vast majority feature body-on-frame construction, with a cabin that is independent of the payload portion of the vehicle. Smaller varieties may be mechanically similar to some automobiles. Commercial trucks can be very large and powerful and may be configured to be mounted with specialized equipment, such as in the case of refuse trucks, fire trucks, concrete mixers, and suction excavators. In American English, a commercial vehicle without a trailer or other articulation is formally a \"straight truck\" while one designed specifically to pull a trailer is not a truck but a \"tractor\".\nThe majority of trucks currently in use are powered by diesel engines, although small- to medium-size trucks with gasoline engines exist in North America. Electrically powered trucks are more popular in China and Europ"}
{"title": "plane", "content": "Plane most often refers to:\n\nAero- or airplane, a powered, fixed-wing aircraft\nPlane (geometry), a flat, 2-dimensional surface\nPlane (mathematics), generalizations of a geometrical plane\nPlane or planes may also refer to:"}
{"title": "cake", "content": "Cake is a flour confection usually made from flour, sugar, and other ingredients and is usually baked. In their oldest forms, cakes were modifications of bread, but cakes now cover a wide range of preparations that can be simple or elaborate and which share features with desserts such as pastries, meringues, custards, and pies.\nThe most common ingredients include flour, sugar, eggs, fat (such as butter, oil, or margarine), a liquid, and a leavening agent, such as baking soda or baking powder. Common additional ingredients include dried, candied, or fresh fruit, nuts, cocoa, and extracts such as vanilla, with numerous substitutions for the primary ingredients. Cakes can also be filled with fruit preserves, nuts, or dessert sauces (like custard, jelly, cooked fruit, whipped cream, or syrups), iced with buttercream or other icings, and decorated with marzipan, piped borders, or candied fruit.\nCake is often served as a celebratory dish on ceremonial occasions, such as weddings, anniversari"}
{"title": "rackett", "content": "The rackett, raggett, cervelas, or sausage bassoon is a Renaissance-era double reed wind instrument, introduced late in the sixteenth century and already superseded by bassoons at the end of the seventeenth century."}
{"title": "line", "content": "Line most often refers to:\n\nLine (geometry), object that has zero thickness and curvature and stretches to infinity\nTelephone line, a single-user circuit on a telephone communication system\nLine, lines, The Line, or LINE may also refer to:"}
{"title": "laptop", "content": "A laptop computer or notebook computer, also known as a laptop or notebook, is a small, portable personal computer (PC). Laptops typically have a clamshell form factor with a flat-panel screen on the inside of the upper lid and an alphanumeric keyboard and pointing device on the inside of the lower lid. Most of the computer's internal hardware is in the lower part, under the keyboard, although many modern laptops have a built-in webcam at the top of the screen, and some even feature a touchscreen display. In most cases, unlike tablet computers which run on mobile operating systems, laptops tend to run on desktop operating systems, which were originally developed for desktop computers.\nLaptops are used in a variety of settings, such as at work (especially on business trips), in education, for playing games, content creating, web browsing, for personal multimedia, and for general home computer use. They can run on both AC power and rechargable battery packs and can be folded shut for con"}
{"title": "officers", "content": "An officer is a person who has a position of authority in a hierarchical organization. The term derives from Old French oficier \"officer, official\" (early 14c., Modern French officier), from Medieval Latin officiarius \"an officer,\" from Latin officium \"a service, a duty\" the late Latin from officiarius, meaning \"official.\""}
{"title": "closeup", "content": "A close-up or closeup in filmmaking, television production, still photography, and the comic strip medium is a type of shot that tightly frames a person or object. Close-ups are one of the standard shots used regularly with medium and long shots (cinematic techniques). Close-ups display the most detail, but they do not include the broader scene. Moving toward or away from a close-up is a common type of zooming. A close up is taken from head to neck, giving the viewer a detailed view of the subject's face."}
{"title": "bears", "content": "Bears are carnivoran mammals of the family Ursidae (). They are classified as caniforms, or doglike carnivorans.  Although only eight species of bears are extant, they are widespread, appearing in a wide variety of habitats throughout most of the Northern Hemisphere and partially in the Southern Hemisphere. Bears are found on the continents of North America, South America, and Eurasia. Common characteristics of modern bears include large bodies with stocky legs, long snouts, small rounded ears, shaggy hair, plantigrade paws with five nonretractile claws, and short tails.\nWhile the polar bear is mostly carnivorous, and the giant panda is mostly herbivorous, the remaining six species are omnivorous with varying diets. With the exception of courting individuals and mothers with their young, bears are typically solitary animals. They may be diurnal or nocturnal and have an excellent sense of smell. Despite their heavy build and awkward gait, they are adept runners, climbers, and swimmers. "}
{"title": "nose", "content": "A nose is a sensory organ and respiratory structure in vertebrates. It consists of a nasal cavity inside the head, and an external nose on the face. The external nose houses the nostrils, or nares, a pair of tubes providing airflow through the nose for respiration. Where the nostrils pass through the nasal cavity they widen, are known as nasal fossae, and contain turbinates and olfactory mucosa. The nasal cavity also connects to the paranasal sinuses (dead-end air cavities for pressure buffering and humidification). From the nasal cavity, the nostrils continue into the pharynx, a switch track valve connecting the respiratory and digestive systems.\nIn humans, the nose is located centrally on the face and serves as an alternative respiratory passage especially during suckling for infants.\nThe protruding nose that is completely separate from the mouth part is a characteristic found only in therian mammals. It has been theorized that this unique mammalian nose evolved from the anterior par"}
{"title": "skis", "content": "Skis are runners, attached to the user's feet, designed to glide over snow. Typically employed in pairs, skis are attached to ski boots with ski bindings, with either a free, lockable, or partially secured heel. For climbing slopes, ski skins can be affixed to the base of each ski to prevent them from sliding backwards. Originally used as a means of travel over snow, skis have become specialized for recreational and competitive alpine and cross-country skiing."}
{"title": "cupcake", "content": "A cupcake (AmE, CanE), fairy cake (BrE), or bun (IrE) is a small cake designed to serve one person, which may be baked in a small thin paper or aluminum cup. As with larger cakes, frosting, icing and various other cake decorations such as fruit and candy may be applied."}
{"title": "bathroom", "content": "A bathroom is a room in which people wash their bodies or parts thereof. It can contain one or more of the following plumbing fixtures: a shower, a bathtub, a bidet, and a sink (also known as a wash basin in the United Kingdom). A toilet is also frequently included. There are also specific toilet rooms, only containing a toilet (often accompanied by a sink), which in American English tend to be called \"bathrooms\", \"powder rooms\" or \"washrooms\", as euphemisms to conceal their actual purpose, while they in British English are known as just \"toilets\" or possibly \"cloakrooms\" - but also as \"lavatories\" when they are public.\nHistorically, bathing was often a collective activity, which took place in public baths. In some countries, the shared social aspect of cleansing the body is still important, for example with sento in Japan and, throughout the Islamic world, the hammam (also known in the West as a \"Turkish bath\")."}
{"title": "cupboard", "content": "A cupboard is a piece of furniture for enclosing dishware or grocery items that are stored in a home. The term is sometimes also used for any form of cabinet or enclosed bookcase. It gradually evolved from its original meaning: an open-shelved side table for displaying dishware, more specifically plates, cups and saucers. These open cupboards typically had between one and three display tiers, and at the time, a drawer or multiple drawers fitted to them."}
{"title": "clock", "content": "A clock or chronometer is a device that measures and displays time. The clock is one of the oldest human inventions, meeting the need to measure intervals of time shorter than the natural units such as the day, the lunar month, and the year. Devices operating on several physical processes have been used over the millennia.\nSome predecessors to the modern clock may be considered \"clocks\" that are based on movement in nature: A sundial shows the time by displaying the position of a shadow on a flat surface. There is a range of duration timers, a well-known example being the hourglass. Water clocks, along with sundials, are possibly the oldest time-measuring instruments. A major advance occurred with the invention of the verge escapement, which made possible the first mechanical clocks around 1300 in Europe, which kept time with oscillating timekeepers like balance wheels.\nTraditionally, in horology (the study of timekeeping), the term clock was used for a striking clock, while a clock th"}
{"title": "sink", "content": "A sink (also known as basin in the UK) is a bowl-shaped plumbing fixture for washing hands, dishwashing, and other purposes. Sinks have a tap (faucet) that supplies hot and cold water and may include a spray feature to be used for faster rinsing. They also include a drain to remove used water; this drain may itself include a strainer and/or shut-off device and an overflow-prevention device. Sinks may also have an integrated soap dispenser. Many sinks, especially in kitchens, are installed adjacent to or inside a counter.\nWhen a sink becomes clogged, a person will often resort to using a chemical drain cleaner or a plunger, though most professional plumbers will remove the clog with a drain auger (often called a \"plumber's snake\")."}
{"title": "ear", "content": "In vertebrates, an ear is the organ that enables hearing and (in mammals) body balance using the vestibular system. In humans, the ear is described as having three parts:  the outer ear, the middle ear and the inner ear. The outer ear consists of the auricle and the ear canal. Since the outer ear is the only visible portion of the ear, the word \"ear\" often refers to the external part (auricle) alone. The middle ear includes the tympanic cavity and the three ossicles. The inner ear sits in the bony labyrinth, and contains structures which are key to several senses: the semicircular canals, which enable balance and eye tracking when moving; the utricle and saccule, which enable balance when stationary; and the cochlea, which enables hearing. The ear canal is cleaned via earwax, which naturally migrates to the auricle. \nThe ear develops from the first pharyngeal pouch and six small swellings that develop in the early embryo called otic placodes, which are derived from the ectoderm.\nThe ea"}
{"title": "ball", "content": "A ball is a round object (usually spherical, but sometimes ovoid) with several uses. It is used in ball games, where the play of the game follows the state of the ball as it is hit, kicked or thrown by players. Balls can also be used for simpler activities, such as catch or juggling. Balls made from hard-wearing materials are used in engineering applications to provide very low friction bearings, known as ball bearings. Black-powder weapons use stone and metal balls as projectiles.\nAlthough many types of balls are today made from rubber, this form was unknown outside the Americas until after the voyages of Columbus. The Spanish were the first Europeans to see the bouncing rubber balls (although solid and not inflated) which were employed most notably in the Mesoamerican ballgame. Balls used in various sports in other parts of the world prior to Columbus were made from other materials such as animal bladders or skins, stuffed with various materials.\nAs balls are one of the most familiar"}
{"title": "frame", "content": "A frame is often a structural system that supports other components of a physical construction and/or steel frame that limits the construction's extent.\nFrame and FRAME may also refer to:"}
{"title": "surfboard", "content": "A surfboard is a narrow plank used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave. They were invented in ancient Hawaii, where they were known as papa heʻe nalu in the Hawaiian language, and were usually made of wood from local trees, such as koa. They were often over 460 cm (15 ft) in length and extremely heavy. Major advances over the years include the addition of one or more fins (skegs) on the bottom rear of the board to improve directional stability, and numerous improvements in materials and shape.\nModern surfboards are made of polyurethane or polystyrene foam. Unlike soft top surfboards, hard top surfboards are also covered with layers of fiberglass cloth, polyester or epoxy resin. The result is a light and strong surfboard that is buoyant and maneuverable. Recent developments in surfboard technology have included the use of carbon fiber and kevlar composites, as well as experimentation in b"}
{"title": "soccer", "content": "Association football, more commonly known as football or soccer, is a team sport played between two teams of 11 players who almost exclusively use their feet to propel a ball around a rectangular field called a pitch. The objective of the game is to score more goals than the opposing team by moving the ball beyond the goal line into a rectangular-framed goal defended by the opposing team. Traditionally, the game has been played over two 45-minute halves, for a total match time of 90 minutes. With an estimated 250 million players active in over 200 countries and territories, it is the world's most popular sport.\nAssociation football is played in accordance with the Laws of the Game, a set of rules that has been in effect since 1863 and maintained by the IFAB since 1886. The game is played with a football that is 68–70 cm (27–28 in) in circumference. The two teams compete to score goals by getting the ball into the other team's goal (between the posts, under the bar, and fully across the"}
{"title": "factory", "content": "A factory, manufacturing plant or production plant is an industrial facility, often a complex consisting of several buildings filled with machinery, where workers manufacture items or operate machines which process each item into another. They are a critical part of modern economic production, with the majority of the world's goods being created or processed within factories.\nFactories arose with the introduction of machinery during the Industrial Revolution, when the capital and space requirements became too great for cottage industry or workshops. Early factories that contained small amounts of machinery, such as one or two spinning mules, and fewer than a dozen workers have been called \"glorified workshops\".\nMost modern factories have large warehouses or warehouse-like facilities that contain heavy equipment used for assembly line production. Large factories tend to be located with access to multiple modes of transportation, some having rail, highway and water loading and unloading "}
{"title": "that", "content": "That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe. Once it came into being, it was spelt as þæt (among others, such as þet), taking the role of the modern that. It also took on the role of the modern word what, though this has since changed, and that has recently replaced some usage of the modern which.\nPronunciation of the word varies according to its role within a sentence, with a strong form,   and a weak form,  ."}
{"title": "her", "content": "Her is the objective and possessive form of the English-language feminine pronoun she. \nHer, HER or H.E.R. may also refer to:"}
{"title": "face", "content": "The face is the front of the head that features the eyes, nose and mouth, and through which animals express many of their emotions. The face is crucial for human identity, and damage such as scarring or developmental deformities may affect the psyche adversely."}
{"title": "oven", "content": "An oven is a tool that is used to expose materials to a hot environment. Ovens contain a hollow chamber and provide a means of heating the chamber in a controlled way. In use since antiquity, they have been used to accomplish a wide variety of tasks requiring controlled heating. Because they are used for a variety of purposes, there are many different types of ovens. These types differ depending on their intended purpose and based upon how they generate heat.\nOvens are often used for cooking, usually baking, sometimes broiling; they can be used to heat food to a desired temperature. Ovens are also used in the manufacturing of ceramics and pottery; these ovens are sometimes referred to as kilns. Metallurgical furnaces are ovens used in the manufacturing of metals, while glass furnaces are ovens used to produce glass.\nThere are many methods by which different types of ovens produce heat. Some ovens heat materials using the combustion of a fuel, such as wood, coal, or natural gas, while m"}
{"title": "goat", "content": "The goat or domestic goat (Capra hircus) is a species of goat-antelope that is mostly kept as livestock. It was domesticated from the wild goat (C. aegagrus) of Southwest Asia and Eastern Europe. The goat is a member of the family Bovidae, meaning it is closely related to the sheep. It was one of the first animals to be domesticated, in Iran around 10,000 years ago.\nGoats have been used for milk, meat, wool, and skins across much of the world. Milk from goats is often turned into cheese. In 2022, there were more than 1.1 billion goats living in the world, of which 150 million were in India.\nGoats feature in mythology, folklore, and religion in many parts of the world, including in the classical myth of Amalthea, in the goats that pulled the chariot of the Norse god Thor, in the Scandinavian Yule goat, and in Hinduism's goat-headed Daksha. In Christianity and Satanism, the devil is sometimes depicted as a goat."}
{"title": "coat", "content": "A coat is typically an outer garment for the upper body, worn by any gender for warmth or fashion. Coats typically have long sleeves and are open down the front, and closing by means of buttons, zippers, hook-and-loop fasteners (AKA velcro), toggles, a belt, or a combination of some of these. Other possible features include collars, shoulder straps, and hoods."}
{"title": "airplane", "content": "An airplane (American English), or aeroplane (Commonwealth English), informally plane, is a fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller, or rocket engine. Airplanes come in a variety of sizes, shapes, and wing configurations. The broad spectrum of uses for airplanes includes recreation, transportation of goods and people, military, and research. Worldwide, commercial aviation transports more than four billion passengers annually on airliners and transports more than 200 billion tonne-kilometers of cargo annually, which is less than 1% of the world's cargo movement. Most airplanes are flown by a pilot on board the aircraft, but some are designed to be remotely or computer-controlled such as drones.\nThe Wright brothers invented and flew the first airplane in 1903, recognized as \"the first sustained and controlled heavier-than-air powered flight\". They built on the works of George Cayley dating from 1799, when he set forth the concept of the modern"}
{"title": "computer", "content": "A computer is a machine that can be programmed to automatically carry out sequences of arithmetic or logical operations (computation). Modern digital electronic computers can perform generic sets of operations known as programs, which enable computers to perform a wide range of tasks. The term computer system may refer to a nominally complete computer that includes the hardware, operating system, software, and peripheral equipment needed and used for full operation; or to a group of computers that are linked and function together, such as a computer network or computer cluster.\nA broad range of industrial and consumer products use computers as control systems, including simple special-purpose devices like microwave ovens and remote controls, and factory devices like industrial robots. Computers are at the core of general-purpose devices such as personal computers and mobile devices such as smartphones. Computers power the Internet, which links billions of computers and users.\nEarly com"}
{"title": "vase", "content": "A vase ( or ) is an open container. It can be made from a number of materials, such as ceramics, glass, non-rusting metals, such as aluminium, brass, bronze, or stainless steel. Even wood has been used to make vases, either by using tree species that naturally resist rot, such as teak, or by applying a protective coating to conventional wood or plastic. Vases are often decorated, and they are often used to hold cut flowers. Vases come in different sizes to support whatever flower is being held or kept in place.\nVases generally share a similar shape. The foot or the base may be bulbous, flat, carinate, or another shape. The body forms the main portion of the piece. Some vases have a shoulder, where the body curves inward, a neck, which gives height, and a lip, where the vase flares back out at the top. Some vases are also given handles.\nVarious styles and types of vases have been developed around the world in different time periods, such as Chinese ceramics and Native American pottery. "}
{"title": "helmet", "content": "A helmet is a form of protective gear worn to protect the head. More specifically, a helmet complements the skull in protecting the human brain. Ceremonial or symbolic helmets (e.g., a policeman's helmet in the United Kingdom) without protective function are sometimes worn. Soldiers wear combat helmets, often made from Kevlar or other lightweight synthetic fibers.\nThe word helmet is derived from helm, an Old English word for a protective head covering.\nHelmets are used for most sports (e.g., jockeys, American football, ice hockey, cricket, baseball, skiing, hurling and rock climbing); dangerous work activities such as construction, mining, riot police, military aviation, and in transportation (e.g. motorcycle helmets and bicycle helmets). Since the 1990s, most helmets are made from resin or plastic, which may be reinforced with fibers such as aramids."}
{"title": "green", "content": "Green is the color between cyan and yellow on the visible spectrum. It is evoked by light which has a dominant wavelength of roughly 495–570 nm. In subtractive color systems, used in painting and color printing, it is created by a combination of yellow and cyan; in the RGB color model, used on television and computer screens, it is one of the additive primary colors, along with red and blue, which are mixed in different combinations to create all other colors. By far the largest contributor to green in nature is chlorophyll, the chemical by which plants photosynthesize and convert sunlight into chemical energy. Many creatures have adapted to their green environments by taking on a green hue themselves as camouflage. Several minerals have a green color, including the emerald, which is colored green by its chromium content.\nDuring post-classical and early modern Europe, green was the color commonly associated with wealth, merchants, bankers, and the gentry, while red was reserved for the"}
{"title": "cats", "content": "The cat (Felis catus), also referred to as the domestic cat or house cat, is a small domesticated carnivorous mammal. It is the only domesticated species of the family Felidae. Advances in archaeology and genetics have shown that the domestication of the cat occurred in the Near East around 7500 BC. It is commonly kept as a pet and working cat, but also ranges freely as a feral cat avoiding human contact. It is valued by humans for companionship and its ability to kill vermin. Its retractable claws are adapted to killing small prey species such as mice and rats. It has a strong, flexible body, quick reflexes, and sharp teeth, and its night vision and sense of smell are well developed. It is a social species, but a solitary hunter and a crepuscular predator.\nCat intelligence is evident in their ability to adapt, learn through observation, and solve problems. Research has shown they possess strong memories, exhibit neuroplasticity, and display cognitive skills comparable to those of a yo"}
{"title": "lemons", "content": "The lemon (Citrus × limon) is a species of small evergreen tree in the Citrus genus of the flowering plant family Rutaceae. A true lemon is a hybrid of the citron and the bitter orange. Its origins are uncertain, but some evidence suggests lemons originated during the 1st millennium BC in what is now northeastern India. Some other citrus fruits are called lemon.\nThe yellow fruit of the lemon tree is used throughout the world, primarily for its juice. The pulp and rind are used in cooking and baking. The juice of the lemon is about 5–6% citric acid, giving it a sour taste. This makes it a key ingredient in drinks and foods such as lemonade and lemon meringue pie.\nIn 2022, world production was 22 million tonnes, led by India with 18% of the total."}
{"title": "bartender", "content": "A bartender (also known as a barkeep or barman or barmaid or a mixologist) is a person who formulates and serves alcoholic or soft drink beverages behind the bar, usually in a licensed establishment as well as in restaurants and nightclubs, but also occasionally at private parties. Bartenders also usually maintain the supplies and inventory for the bar. As well as serving beer and wine, a bartender can generally also mix classic cocktails such as a cosmopolitan, Manhattan, old fashioned, and negroni.\nBartenders are also responsible for confirming that customers meet the legal drinking age requirements before serving them alcoholic beverages. In certain countries, such as the United States, Canada, the United Kingdom, Ireland and Sweden, bartenders are legally required to refuse more alcohol to drunk customers.\nMixology is defined as the art or skill of preparing mixed drinks. At its core, the purpose of this practice is to craft cocktails. However, the science and skills required to su"}
{"title": "broccoli", "content": "Broccoli (Brassica oleracea var. italica) is an edible green plant in the cabbage family (family Brassicaceae, genus Brassica) whose large flowering head, stalk and small associated leaves are eaten as a vegetable. Broccoli is classified in the Italica cultivar group of the species Brassica oleracea. Broccoli has large flower heads, or florets, usually dark green, arranged in a tree-like structure branching out from a thick stalk, which is usually light green. Leaves surround the mass of flower heads. Broccoli resembles cauliflower, a different but closely related cultivar group of the same Brassica species.\nIt can be eaten either raw or cooked. Broccoli is a particularly rich source of vitamin C and vitamin K. Contents of its characteristic sulfur-containing glucosinolate compounds, isothiocyanates and sulforaphane, are diminished by boiling but are better preserved by steaming, microwaving or stir-frying.\nRapini, sometimes called \"broccoli rabe\", is a distinct species from broccoli, "}
{"title": "bus", "content": "A bus (contracted from omnibus, with variants multibus, motorbus, autobus, etc.) is a motor vehicle that carries significantly more passengers than an average car or van, but fewer than the average rail transport. It is most commonly used in public transport, but is also in use for charter purposes, or through private ownership. Although the average bus carries between 30 and 100 passengers, some buses have a capacity of up to 300 passengers. The most common type is the single-deck rigid bus, with double-decker and articulated buses carrying larger loads, and midibuses and minibuses carrying smaller loads. Coaches are used for longer-distance services. Many types of buses, such as city transit buses and inter-city coaches, charge a fare. Other types, such as elementary or secondary school buses or shuttle buses within a post-secondary education campus, are free. In many jurisdictions, bus drivers require a special large vehicle licence above and beyond a regular driving license.\nBuses "}
{"title": "sandwich", "content": "A sandwich is a dish typically consisting variously of meat, cheese, sauces, and vegetables used as a filling between slices of bread, or placed atop a slice of bread; or, more generally, any dish in which bread serves as a container or wrapper for another food type, and allows it to be a finger food. The sandwich began as a portable, convenient food in the Western world, though over time it has become prevalent worldwide.\nThere has been social media debate over the precise definition of sandwich, specifically whether a hot dog or open sandwich can be categorized as such. Other items, like hamburgers and burritos, were also considered. In the United States, the Department of Agriculture (USDA) and the Food and Drug Administration (FDA) are the responsible agencies for protecting the definition of sandwich. The USDA uses the definition, \"at least 35% cooked meat and no more than 50% bread\" for closed sandwiches, and \"at least 50% cooked meat\" for open sandwiches. However, the same USDA "}
{"title": "ropes", "content": "A rope is a group of yarns, plies, fibres, or strands that are twisted or braided together into a larger and stronger form. Ropes have high tensile strength and can be used for dragging and lifting. Rope is thicker and stronger than similarly constructed cord, string, and twine."}
{"title": "groom", "content": "A bridegroom (often shortened to groom) is a man who is about to be married or who is newlywed. \nWhen marrying, the bridegroom's future spouse is usually referred to as the bride.  A bridegroom is typically attended by a best man and groomsmen."}
{"title": "zebras", "content": "Zebras (US: , UK: ) (subgenus Hippotigris) are African equines with distinctive black-and-white striped coats. There are three living species: Grévy's zebra (Equus grevyi), the plains zebra (E. quagga), and the mountain zebra (E. zebra). Zebras share the genus Equus with horses and asses, the three groups being the only living members of the family Equidae. Zebra stripes come in different patterns, unique to each individual. Several theories have been proposed for the function of these patterns, with most evidence supporting them as a deterrent for biting flies. Zebras inhabit eastern and southern Africa and can be found in a variety of habitats such as savannahs, grasslands, woodlands, shrublands, and mountainous areas.\nZebras are primarily grazers and can subsist on lower-quality vegetation. They are preyed on mainly by lions, and typically flee when threatened but also bite and kick. Zebra species differ in social behaviour, with plains and mountain zebra living in stable harems con"}
{"title": "arrows", "content": "An arrow is a projectile launched from a bow.\nArrow or Arrows may also refer to:"}
{"title": "women", "content": "A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause. More generally, sex differentiation of the female fetus is governed by the lack of a present, or functioning, SRY gene on either one of the respective sex chromosomes. Female anatomy is distinguished from male anatomy by the female reproductive system, which includes the ovaries, fallopian tubes, uterus, vagina, and vulva. An adult woman generally has a wider pelvis, broader hips, and larger breasts than an adult man. These characteristics facilitate childbirth and breastfeeding. Women typically have less facial and other body hair, have a higher body fat composition, and are on average shorter and less muscular than men.\nThroughout human history, traditional gender roles within "}
{"title": "snow", "content": "Snow consists of individual ice crystals that grow while suspended in the atmosphere—usually within clouds—and then fall, accumulating on the ground where they undergo further changes. It consists of frozen crystalline water throughout its life cycle, starting when, under suitable conditions, the ice crystals form in the atmosphere, increase to millimeter size, precipitate and accumulate on surfaces, then metamorphose in place, and ultimately melt, slide, or sublimate away.\nSnowstorms organize and develop by feeding on sources of atmospheric moisture and cold air. Snowflakes nucleate around particles in the atmosphere by attracting supercooled water droplets, which freeze in hexagonal-shaped crystals. Snowflakes take on a variety of shapes, basic among these are platelets, needles, columns, and rime. As snow accumulates into a snowpack, it may blow into drifts. Over time, accumulated snow metamorphoses, by sintering, sublimation, and freeze-thaw. Where the climate is cold enough for ye"}
{"title": "tree", "content": "In botany, a tree is a perennial plant with an elongated stem, or trunk, usually supporting branches and leaves. In some usages, the definition of a tree may be narrower, e.g., including only woody plants with secondary growth, only plants that are usable as lumber, or only plants above a specified height. But wider definitions include taller palms, tree ferns, bananas, and bamboos. \nTrees are not a monophyletic taxonomic group but consist of a wide variety of plant species that have independently evolved a trunk and branches as a way to tower above other plants to compete for sunlight. The majority of tree species are angiosperms or hardwoods; of the rest, many are gymnosperms or softwoods. Trees tend to be long-lived, some trees reaching several thousand years old. Trees evolved around 400 million years ago, and it is estimated that there are around three trillion mature trees in the world currently.\nA tree typically has many secondary branches supported clear of the ground by the tr"}
{"title": "beard", "content": "A beard is the hair that grows on the jaw, chin, upper lip, lower lip, cheeks, and neck of humans and some non-human animals. In humans, beards are most commonly seen on pubescent or adult males, though women have been observed with beards as well.\nThroughout the course of human history, societal attitudes toward male beards have varied widely depending on factors such as prevailing cultural traditions and the current era's fashion trends. Several religions have considered a full beard to be essential and mandate it as part of their observance. Other cultures, even while not officially mandating it, view a beard as central to a man's virility, exemplifying such virtues as virtue, beauty, wisdom, strength, fertility, sexual prowess, and high social status. In cultures where facial hair is uncommon (or currently out of fashion), beards may be associated with poor hygiene or an unconventional demeanor. In countries with colder climates, beards help protect the wearer's face from the eleme"}
{"title": "canoe", "content": "A canoe is a lightweight, narrow water vessel, typically pointed at both ends and open on top, propelled by one or more seated or kneeling paddlers facing the direction of travel and using paddles.\nIn British English, the term canoe can also refer to a kayak, whereas canoes are then called Canadian or open canoes to distinguish them from kayaks. However, for official competition purposes, the American distinction between a kayak and a canoe is almost always adopted. At the Olympics, both conventions are used: under the umbrella terms Canoe Slalom and Canoe Sprint, there are separate events for canoes and kayaks."}
{"title": "herd", "content": "A herd is a social group of certain animals of the same species, either wild or domestic. The form of collective animal behavior associated with this is called herding. These animals are known as gregarious animals.\nThe term herd is generally applied to mammals, and most particularly to the grazing ungulates that classically display this behaviour. Different terms are used for similar groupings in other species; in the case of birds, for example, the word is flocking, but flock may also be used for mammals, particularly sheep or goats. Large groups of carnivores are usually called packs, and in nature a herd is classically subject to predation from pack hunters.\nSpecial collective nouns may be used for particular taxa (for example a flock of geese, if not in flight, is sometimes called a gaggle) but for theoretical discussions of behavioural ecology, the generic term herd can be used for all such kinds of assemblage.\nThe word herd, as a noun, can also refer to one who controls, possess"}
{"title": "ceiling", "content": "A ceiling  is an overhead interior roof that covers the upper limits of a room. It is not generally considered a structural element, but a finished surface concealing the underside of the roof structure or the floor of a story above. Ceilings can be decorated to taste, and there are many examples of frescoes and artwork on ceilings, especially within religious buildings. A ceiling can also be the upper limit of a tunnel.\nThe most common type of ceiling is the dropped ceiling, which is suspended from structural elements above. Panels of drywall are fastened either directly to the ceiling joists or to a few layers of moisture-proof plywood which are then attached to the joists. Pipework or ducts can be run in the gap above the ceiling, and insulation and fireproofing material can be placed here. Alternatively, ceilings may be spray painted instead, leaving the pipework and ducts exposed but painted, and using spray foam.  \nA subset of the dropped ceiling is the suspended ceiling, wherein"}
{"title": "room", "content": "In a building or a ship, a room is any enclosed space within a number of walls to which entry is possible only via a door or other dividing structure. The entrance connects it to either a passageway, another room, or the outdoors. The space is typically large enough for several people to move about. The size, fixtures, furnishings, and sometimes placement of the room within the building or ship (or sometimes a train) support the activity to be conducted in it."}
{"title": "frisbee", "content": "A  frisbee (pronounced  FRIZ-bee), also called a flying disc or simply a disc, is a gliding toy or sporting item generally made of injection-molded plastic and roughly 20 to 25 centimetres (8 to 10 in) in diameter with a pronounced lip. It is used recreationally and competitively for throwing and catching, as in flying disc games. The shape of the disc is an airfoil in cross-section which allows it to fly by reducing the drag and increasing lift as it moves through the air, compared to a flat plate. Spinning the disc imparts a stabilizing gyroscopic force, allowing it to be both aimed with accuracy and thrown for distance.\nA wide range is available of flying disc variants. Those for disc golf are usually smaller but denser compared to ultimate frisbee, and tailored for particular flight profiles to increase or decrease stability and distance. The longest recorded disc throw is by David Wiggins Jr. with a distance of 338 metres (1,109 ft). Disc dog sports use relatively slow-flying disc"}
{"title": "door", "content": "A door is a hinged or otherwise movable barrier that allows ingress (entry) into and egress (exit) from an enclosure. The created opening in the wall is a doorway or portal. A door's essential and primary purpose is to provide security by controlling access to the doorway (portal). Conventionally, it is a panel that fits into the doorway of a building, room, or vehicle. Doors are generally made of a material suited to the door's task. They are commonly attached by hinges, but can move by other means, such as slides or counterbalancing.\nThe door may be able to move in various ways (at angles away from the doorway/portal, by sliding on a plane parallel to the frame, by folding in angles on a parallel plane, or by spinning along an axis at the center of the frame) to allow or prevent ingress or egress. In most cases, a door's interior matches its exterior side. But in other cases (e.g., a vehicle door) the two sides are radically different.\nMany doors incorporate locking mechanisms to ens"}
{"title": "box", "content": "A box (plural: boxes) is a container with rigid sides used for the storage or transportation of its contents. Most boxes have flat, parallel, rectangular sides (typically rectangular prisms). Boxes can be very small (like a matchbox) or very large (like a shipping box for furniture) and can be used for a variety of purposes, from functional to decorative. \nBoxes may be made of a variety of materials, both durable (such as wood and metal) and non-durable (such as corrugated fiberboard and paperboard). Corrugated metal boxes are commonly used as shipping containers.\nBoxes may be closed and shut with flaps, doors, or a separate lid. They can be secured shut with adhesives, tapes, string, or more decorative or elaborately functional mechanisms, such as catches, clasps or locks."}
{"title": "doughnut", "content": "A doughnut or donut () is a type of pastry made from leavened fried dough.: 275  It is popular in many countries and is prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors. Doughnut is the traditional spelling, while donut is the simplified version; the terms are used interchangeably.\nDoughnuts are usually deep fried from a flour dough, but other types of batters can also be used. Various toppings and flavors are used for different types, such as sugar, chocolate or maple glazing. Doughnuts may also include water, leavening, eggs, milk, sugar, oil, shortening, and natural or artificial flavors.\nThe two most common types are the ring doughnut and the filled doughnut, which is injected with fruit preserves (the jelly doughnut), cream, custard, or other sweet fillings. Small pieces of dough are sometimes cooked as doughnut holes. Once fried, doughnuts may be glazed with a sugar icing, spread "}
{"title": "bicycles", "content": "A bicycle, also called a pedal cycle, bike, push-bike or cycle, is a human-powered or motor-assisted, pedal-driven, single-track vehicle, with two wheels attached to a frame, one behind the other. A bicycle rider is called a cyclist, or bicyclist.\nBicycles were introduced in the 19th century in Europe. By the early 21st century there were more than 1 billion bicycles. There are many more bicycles than cars. Bicycles are the principal means of transport in many regions. They also provide a popular form of recreation, and have been adapted for use as children's toys. Bicycles are used for fitness, military and police applications, courier services, bicycle racing, and artistic cycling.\nThe basic shape and configuration of a typical upright or \"safety\" bicycle, has changed little since the first chain-driven model was developed around 1885. However, many details have been improved, especially since the advent of modern materials and computer-aided design. These have allowed for a prolifer"}
{"title": "house", "content": "A house is a single-unit residential building. It may range in complexity from a rudimentary hut to a complex structure of wood, masonry, concrete or other material, outfitted with plumbing, electrical, and heating, ventilation, and air conditioning systems. Houses use a range of different roofing systems to keep precipitation such as rain from getting into the dwelling space. Houses generally have doors or locks to secure the dwelling space and protect its inhabitants and contents from burglars or other trespassers. Most conventional modern houses in Western cultures will contain one or more bedrooms and bathrooms, a kitchen or cooking area, and a living room. A house may have a separate dining room, or the eating area may be integrated into the kitchen or another room. Some large houses in North America have a recreation room. In traditional agriculture-oriented societies, domestic animals such as chickens or larger livestock (like cattle) may share part of the house with humans.\nThe"}
{"title": "desk", "content": "A desk or bureau is a piece of furniture with a flat table-style work surface used in a school, office, home or the like for academic, professional or domestic activities such as reading, writing, or using equipment such as a computer. Desks often have one or more drawers, compartments, or pigeonholes to store items such as office supplies and papers. Desks are usually made of wood or metal, although materials such as glass are sometimes seen.\nSome desks have the form of a table, although usually only one side of a desk is suitable to sit at (there are some exceptions, such as a partners desk) Some desks do not have the form of a table, for instance, an armoire desk is a desk built within a large wardrobe-like cabinet, and a portable desk is light enough to be placed on a person's lap. Since many people lean on a desk while using it, a desk must be sturdy. In most cases, people sit at a desk, either on a separate chair or a built-in chair (e.g., in some school desks). Some people use s"}
{"title": "dog", "content": "The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers. The dog was the first species to be domesticated by humans, over 14,000 years ago and before the development of agriculture. Due to their long association with humans, dogs have gained the ability to thrive on a starch-rich diet that would be inadequate for other canids.\nDogs have been bred for desired behaviors, sensory capabilities, and physical attributes. Dog breeds vary widely in shape, size, and color. They have the same number of bones (with the exception of the tail), powerful jaws that house around 42 teeth, and well-developed senses of smell, hearing, and sight. Compared to humans, dogs possess a superior sense of smell and hearing, but inferior visual acuity. Dogs perform many roles for humans, such as hunting, herding, pulling loads, protection, c"}
{"title": "teeth", "content": "A tooth (pl.: teeth) is a hard, calcified structure found in the jaws (or mouths) of many vertebrates and used to break down food. Some animals, particularly carnivores and omnivores, also use teeth to help with capturing or wounding prey, tearing food, for defensive purposes, to intimidate other animals often including their own, or to carry prey or their young. The roots of teeth are covered by gums. Teeth are not made of bone, but rather of multiple tissues of varying density and hardness that originate from the outermost embryonic germ layer, the ectoderm.\nThe general structure of teeth is similar across the vertebrates, although there is considerable variation in their form and position. The teeth of mammals have deep roots, and this pattern is also found in some fish, and in crocodilians. In most teleost fish, however, the teeth are attached to the outer surface of the bone, while in lizards they are attached to the inner surface of the jaw by one side. In cartilaginous fish, suc"}
{"title": "barrier", "content": "A barrier or barricade is a physical structure which blocks or impedes something.\nBarrier may also refer to:"}
{"title": "reading", "content": "Reading is the process of taking in the sense or meaning of symbols, often specifically those of a written language, by means of sight or touch.\nFor educators and researchers, reading is a multifaceted process involving such areas as word recognition, orthography (spelling), alphabetics, phonics, phonemic awareness, vocabulary, comprehension, fluency, and motivation.\nOther types of reading and writing, such as pictograms (e.g., a hazard symbol and an emoji), are not based on speech-based writing systems. The common link is the interpretation of symbols to extract the meaning from the visual notations or tactile signals (as in the case of braille)."}
{"title": "donut", "content": "A doughnut or donut () is a type of pastry made from leavened fried dough.: 275  It is popular in many countries and is prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors. Doughnut is the traditional spelling, while donut is the simplified version; the terms are used interchangeably.\nDoughnuts are usually deep fried from a flour dough, but other types of batters can also be used. Various toppings and flavors are used for different types, such as sugar, chocolate or maple glazing. Doughnuts may also include water, leavening, eggs, milk, sugar, oil, shortening, and natural or artificial flavors.\nThe two most common types are the ring doughnut and the filled doughnut, which is injected with fruit preserves (the jelly doughnut), cream, custard, or other sweet fillings. Small pieces of dough are sometimes cooked as doughnut holes. Once fried, doughnuts may be glazed with a sugar icing, spread "}
{"title": "surfer", "content": "Surfing is a surface water sport in which an individual, a surfer (or two in tandem surfing), uses a board to ride on the forward section, or face, of a moving wave of water, which usually carries the surfer towards the shore. Waves suitable for surfing are primarily found on ocean shores, but can also be found as standing waves in the open ocean, in lakes, in rivers in the form of a tidal bore, or wave pools.\nSurfing includes all forms of wave-riding using a board, regardless of the stance. There are several types of boards. The Moche of Peru would often surf on reed craft, while the native peoples of the Pacific surfed waves on alaia, paipo, and other such watercraft. Ancient cultures often surfed on their belly and knees, while modern-day surfing is most often stand-up surfing, in which a surfer rides a wave while standing on a surfboard.\nAnother prominent form of surfing is body boarding, where a surfer rides the wave on a bodyboard, either lying on their belly, drop knee (one foot"}
{"title": "meats", "content": "Meat is animal tissue, often muscle, that is eaten as food. Humans have hunted and farmed other animals for meat since prehistory. The Neolithic Revolution allowed the domestication of vertebrates, including chickens, sheep, goats, pigs, horses, and cattle, starting around 11,000 years ago. Since then, selective breeding has enabled farmers to produce meat with the qualities desired by producers and consumers.\nMeat is mainly composed of water, protein, and fat. Its quality is affected by many factors, including the genetics, health, and nutritional status of the animal involved. Without preservation, bacteria and fungi decompose and spoil unprocessed meat within hours or days. Meat is edible raw, but it is mostly eaten cooked, such as by stewing or roasting, or processed, such as by smoking or salting. \nThe consumption of meat (especially red and processed meat, as opposed to fish and poultry) increases the risk of certain negative health outcomes including cancer, coronary heart disea"}
{"title": "kite", "content": "A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag forces. A kite consists of wings, tethers and anchors. Kites often have a bridle and tail to guide the face of the kite so the wind can lift it. Some kite designs do not need a bridle; box kites can have a single attachment point. A kite may have fixed or moving anchors that can balance the kite. The name is derived from the kite, the hovering bird of prey.\nThere are several shapes of kites. \nThe lift that sustains the kite in flight is generated when air moves around the kite's surface, producing low pressure above and high pressure below the wings. The interaction with the wind also generates horizontal drag along the direction of the wind. The resultant force vector from the lift and drag force components is opposed by the tension of one or more of the lines or tethers to which the kite is attached. The anchor point of the kite line may be static or moving (e.g., the tow"}
{"title": "towel", "content": "A towel () is a piece of absorbent cloth or paper used for drying or wiping a surface. Towels draw moisture through direct contact.\nBathing towels and hand towels are usually made of cotton, linen, bamboo and synthetic microfibers.\nIn households, several types of towels are used, such as hand towels, bath towels, and kitchen towels.\nPaper towels are provided in commercial or office bathrooms, via a dispenser, for users to dry their hands. They are also used for such duties such as wiping, cleaning, and drying."}
{"title": "liquid", "content": "Liquid is a state of matter with a definite volume but no fixed shape. Liquids adapt to the shape of their container and are nearly incompressible, maintaining their volume even under pressure. The density of a liquid is usually close to that of a solid, and much higher than that of a gas. Therefore, liquid and solid are classified as condensed matter. Meanwhile, since both liquids and gases can flow, they are categorized as fluids.\nA liquid is composed of atoms or molecules held together by intermolecular bonds of intermediate strength. These forces allow the particles to move around one another while remaining closely packed. In contrast, solids have particles that are tightly bound by strong intermolecular forces, limiting their movement to small vibrations in fixed positions. Gases, on the other hand, consist of widely spaced, freely moving particles with only weak intermolecular forces.\nAs temperature increases, the molecules in a liquid vibrate more intensely, causing the distanc"}
{"title": "refrigerator", "content": "A refrigerator, commonly shortened to fridge, is a commercial and home appliance consisting of a thermally insulated compartment and a heat pump (mechanical, electronic or chemical) that transfers heat from its inside to its external environment so that its inside is cooled to a temperature below the room temperature. Refrigeration is an essential food storage technique around the world. The low temperature reduces the reproduction rate of bacteria, so the refrigerator lowers the rate of spoilage. A refrigerator maintains a temperature a few degrees above the freezing point of water. The optimal temperature range for perishable food storage is 3 to 5 °C (37 to 41 °F). A freezer is a specialized refrigerator, or portion of a refrigerator, that maintains its contents’ temperature below the freezing point of water. The refrigerator replaced the icebox, which had been a common household appliance for almost a century and a half. The United States Food and Drug Administration recommends tha"}
{"title": "ocean", "content": "The ocean is the body of salt water that covers approximately 70.8% of Earth. The ocean is conventionally divided into large bodies of water, which are also referred to as oceans (the Pacific, Atlantic, Indian, Antarctic/Southern, and Arctic Ocean),  and are themselves mostly divided into seas, gulfs and subsequent bodies of water. The ocean contains 97% of Earth's water and is the primary component of Earth's hydrosphere, acting as a huge reservoir of heat for Earth's energy budget, as well as for its carbon cycle and water cycle, forming the basis for climate and weather patterns worldwide. The ocean is essential to life on Earth, harbouring most of Earth's animals and protist life, originating photosynthesis and therefore Earth's atmospheric oxygen, still supplying half of it.\nOcean scientists split the ocean into vertical and horizontal zones based on physical and biological conditions. Horizontally the ocean covers the oceanic crust, which it shapes. Where the ocean meets dry land"}
{"title": "girls", "content": "A girl is a young female human, usually a child or an adolescent.  While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture.  In cultures where women have or had a low social position, girls may be unwanted by their parents, and society may invest less in girls.  The difference in girls' and boys' upbringing ranges from slight to completely different.  Mixing of the sexes may vary by age, and from totally mixed to total sex segregation."}
{"title": "cars", "content": "A car, or an automobile, is a motor vehicle with wheels. Most definitions of cars state that they run primarily on roads, seat one to eight people, have four wheels, and mainly transport people rather than cargo. There are around one billion cars in use worldwide.\nThe French inventor Nicolas-Joseph Cugnot built the first steam-powered road vehicle in 1769, while the Swiss inventor François Isaac de Rivaz designed and constructed the first internal combustion-powered automobile in 1808. The modern car—a practical, marketable automobile for everyday use—was invented in 1886, when the German inventor Carl Benz patented his Benz Patent-Motorwagen. Commercial cars became widely available during the 20th century. The 1901 Oldsmobile Curved Dash and the 1908 Ford Model T, both American cars, are widely considered the first mass-produced and mass-affordable cars, respectively. Cars were rapidly adopted in the US, where they replaced horse-drawn carriages. In Europe and other parts of the world"}
{"title": "tray", "content": "A tray is a shallow platform designed for the carrying of items. It can be fashioned from numerous materials, including silver, brass, sheet iron, paperboard, wood, melamine, and molded pulp. Trays range in cost from inexpensive molded pulp trays which are disposable and inexpensive melamine trays used in cafeterias, to mid-priced wooden trays used in a home, to expensive silver trays used in luxury hotels. Some examples have raised galleries, handles, and short feet for support.\nTrays are flat, but with raised edges to stop things from sliding off them. They are made in a range of shapes but are commonly found in oval or rectangular forms, sometimes with cutout or attached handles with which to carry them.\nA more elaborate device is the tray table, which is designed to accommodate a tray, or to serve as a tray itself. There are two primary kinds of tray tables. The TV tray table is typically a small table, which may have legs that fold to allow it to be carried like a tray. The airpla"}
{"title": "horse", "content": "The horse (Equus ferus caballus) is a domesticated, one-toed, hoofed mammal. It belongs to the taxonomic family Equidae and is one of two extant subspecies of Equus ferus. The horse has evolved over the past 45 to 55 million years from a small multi-toed creature, Eohippus, into the large, single-toed animal of today. Humans began domesticating horses around 4000 BCE in Central Asia, and their domestication is believed to have been widespread by 3000 BCE. Horses in the subspecies caballus are domesticated, although some domesticated populations live in the wild as feral horses. These feral populations are not true wild horses, which are horses that have never been domesticated. There is an extensive, specialized vocabulary used to describe equine-related concepts, covering everything from anatomy to life stages, size, colors, markings, breeds, locomotion, and behavior.\nHorses are adapted to run, allowing them to quickly escape predators, and possess a good sense of balance and a strong"}
{"title": "patron", "content": "Patronage is the support, encouragement, privilege, or financial aid that an organization or individual bestows on another. In the history of art, art patronage refers to the support that princes, popes, and other wealthy and influential people have provided to artists such as musicians, painters, and sculptors. It can also refer to the right of bestowing offices or church benefices, the business given to a store by a regular customer, and the guardianship of saints. The word patron derives from the Latin patronus ('patron'), one who gives benefits to his clients (see patronage in ancient Rome).\nIn some countries, the term is used to describe political patronage or patronal politics, which is the use of state resources to reward individuals for their electoral support. Some patronage systems are legal, as in the Canadian tradition of the prime minister appointing senators and the heads of a number of commissions and agencies; in many cases, these appointments go to people who have supp"}
{"title": "hill", "content": "A hill is a landform that extends above the surrounding terrain. It often has a distinct summit, and is usually applied to peaks which are above elevation compared to the relative landmass, though not as prominent as mountains. Hills fall under the category of slope landforms."}
{"title": "time", "content": "Time is the continuous progression of existence that occurs in an apparently irreversible succession from the past, through the present, and into the future. It is a component quantity of various measurements used to sequence events, to compare the duration of events (or the intervals between them), and to quantify rates of change of quantities in material reality or in the conscious experience. Time is often referred to as a fourth dimension, along with three spatial dimensions.\nTime is one of the seven fundamental physical quantities in both the International System of Units (SI) and International System of Quantities. The SI base unit of time is the second, which is defined by measuring the electronic transition frequency of caesium atoms. General relativity is the primary framework for understanding how spacetime works. Through advances in both theoretical and experimental investigations of spacetime, it has been shown that time can be distorted and dilated, particularly at the edg"}
{"title": "skateboard", "content": "A skateboard is a type of sports equipment used for skateboarding. It is usually made of a specially designed 7–8-ply maple plywood deck and has polyurethane wheels attached to the underside by a pair of skateboarding trucks.\nThe skateboard moves by pushing with one foot while the other foot remains balanced on the board, or by pumping one's legs in structures such as a bowl or half pipe. A skateboard can also be used by standing on the deck while on a downward slope and allowing gravity to propel the board and the rider. If the rider's leading foot is their left foot, they are said to ride \"regular\". Conversely, they are said to ride \"goofy\" if their leading foot is their right foot. \nThe two main types of skateboards are the longboard and shortboard. The shape of the board is also important: the skateboard must be concaved to perform tricks."}
{"title": "males", "content": "Male (symbol: ♂) is the sex of an organism that produces the gamete (sex cell) known as sperm, which fuses with the larger female gamete, or ovum, in the process of fertilisation. A male organism cannot reproduce sexually without access to at least one ovum from a female, but some organisms can reproduce both sexually and asexually. Most male mammals, including male humans, have a Y chromosome, which codes for the production of larger amounts of testosterone to develop male reproductive organs.\nIn humans, the word male can also be used to refer to gender, in the social sense of gender role or gender identity."}
{"title": "kitchen", "content": "A kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment. A modern middle-class residential kitchen is typically equipped with a stove, a sink with hot and cold running water, a refrigerator, and worktops and kitchen cabinets arranged according to a modular design. Many households have a microwave oven, a dishwasher, and other electric appliances. The main functions of a kitchen are to store, prepare and cook food (and to complete related tasks such as dishwashing). The room or area may also be used for dining (or small meals such as breakfast), entertaining and laundry. The design and construction of kitchens is a huge market all over the world.\nCommercial kitchens are found in restaurants, cafeterias, hotels, hospitals, educational and workplace facilities, army barracks, and similar establishments. These kitchens are generally larger and equipped with bigger and more heavy-duty equipment than a residential kitchen. Fo"}
{"title": "alley", "content": "An alley or alleyway is a narrow lane, path, or passageway, often reserved for pedestrians, which usually runs between, behind, or within buildings in towns and cities. It is also a rear access or service road (back lane), or a path, walk, or avenue (French allée) in a park or garden.\nA covered alley or passageway, often with shops, may be called an arcade. The origin of the word alley is late Middle English, from Old French: alee \"walking or passage\", from aller \"to go\", from Latin: ambulare \"to walk\"."}
{"title": "motorcycle", "content": "A motorcycle (motorbike, bike; uni (if one-wheeled); trike (if three-wheeled); quad (if four-wheeled)) is a lightweight private 1-to-2 passenger personal motor vehicle steered by a handlebar from a saddle-style seat.\nMotorcycle designs vary greatly to suit a range of different purposes: long-distance travel, commuting, cruising, sport (including racing), and off-road riding. Motorcycling is riding a motorcycle and being involved in other related social activities such as joining a motorcycle club and attending motorcycle rallies.\nThe 1885 Daimler Reitwagen made by Gottlieb Daimler and Wilhelm Maybach in Germany was the first internal combustion, petroleum-fueled motorcycle. In 1894, Hildebrand & Wolfmüller became the first series production motorcycle.\nGlobally, motorcycles are comparable numerically to cars as a method of transport: in 2021, approximately 58.6 million new motorcycles were sold around the world, while 66.7 million cars were sold over the same period.\nIn 2022, the top f"}
{"title": "temple", "content": "A temple (from the Latin templum) is a place of worship, a building used for spiritual rituals and activities such as prayer and sacrifice.  By convention, the specially built places of worship of some religions are commonly called \"temples\" in English, while those of other religions are not, even though they fulfill very similar functions.  \nThe religions for which the terms are used include the great majority of ancient religions that are now extinct, such as the Ancient Egyptian religion and the Ancient Greek religion.  Among religions still active: Hinduism (whose temples are called Mandir or Kovil), Buddhism (whose temples are called Vihar), Sikhism (whose temples are called gurudwara), Jainism (whose temples are sometimes called derasar),  Zoroastrianism (whose temples are sometimes called Agiary), the Baháʼí Faith (which are often simply referred to as Baháʼí House of Worship), Taoism (which are sometimes called Daoguan), Shinto (which are often called Jinja), Confucianism (whic"}
{"title": "flashlight", "content": "A flashlight (US English) or electric torch (Commonwealth English), usually shortened to torch, is a portable hand-held electric lamp. Formerly, the light source typically was a miniature incandescent light bulb, but these have been displaced by light-emitting diodes (LEDs) since the early 2000s. A typical flashlight consists of the light source mounted in a reflector, a transparent cover (sometimes combined with a lens) to protect the light source and reflector, a battery, and a switch, all enclosed in a case.\nThe invention of the dry cell and miniature incandescent electric lamps made the first battery-powered flashlights possible around 1899. Today, flashlights use mostly light-emitting diodes and run on disposable or rechargeable batteries. Some are powered by the user turning a crank, shaking the lamp, or squeezing it. Some have solar panels to recharge the battery. Flashlights are used as a light source outdoors, in places without permanently installed lighting, during power outa"}
{"title": "giraffe", "content": "The giraffe is a large African hoofed mammal belonging to the genus Giraffa. It is the tallest living terrestrial animal and the largest ruminant on Earth. It is classified under the family Giraffidae, along with its closest extant relative, the okapi. Traditionally, giraffes have been thought of as one species, Giraffa camelopardalis, with nine subspecies. Most recently, researchers proposed dividing them into four extant species which can be distinguished by their fur coat patterns. Six valid extinct species of Giraffa are known from the fossil record.\nThe giraffe's distinguishing characteristics are its extremely long neck and legs, horn-like ossicones, and spotted coat patterns. Its scattered range extends from Chad in the north to South Africa in the south and from Niger in the west to Somalia in the east. Giraffes usually inhabit savannahs and woodlands. Their food source is leaves, fruits, and flowers of woody plants, primarily acacia species, which they browse at heights most o"}
{"title": "rain", "content": "Rain is a form of precipitation where water droplets that have condensed from atmospheric water vapor fall under gravity. Rain is a major component of the water cycle and is responsible for depositing most of the fresh water on the Earth. It provides water for hydroelectric power plants, crop irrigation, and suitable conditions for many types of ecosystems.\nThe major cause of rain production is moisture moving along three-dimensional zones of temperature and moisture contrasts known as weather fronts. If enough moisture and upward motion is present, precipitation falls from convective clouds (those with strong upward vertical motion) such as cumulonimbus (thunder clouds) which can organize into narrow rainbands. In mountainous areas, heavy precipitation is possible where upslope flow is maximized within windward sides of the terrain at elevation which forces moist air to condense and fall out as rainfall along the sides of mountains. On the leeward side of mountains, desert climates ca"}
{"title": "chairs", "content": "A chair is a type of seat, typically designed for one person and consisting of one or more legs, a flat or slightly angled seat and a back-rest. It may be made of wood, metal, or synthetic materials, and may be padded or upholstered in various colors and fabrics.\nChairs vary in design. An armchair has armrests fixed to the seat; a recliner is upholstered and features a mechanism that lowers the chair's back and raises into place a footrest; a rocking chair has legs fixed to two long curved slats; and a wheelchair has wheels fixed to an axis under the seat."}
{"title": "bird", "content": "Birds are a group of warm-blooded vertebrates constituting the class Aves, characterised by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton. Birds live worldwide and range in size from the 5.5 cm (2.2 in) bee hummingbird to the 2.8 m (9 ft 2 in) common ostrich. There are over 11,000 living species and they are split into 44 orders. More than half are passerine or \"perching\" birds. Birds have wings whose development varies according to species; the only known groups without wings are the extinct moa and elephant birds. Wings, which are modified forelimbs, gave birds the ability to fly, although further evolution has led to the loss of flight in some birds, including ratites, penguins, and diverse endemic island species. The digestive and respiratory systems of birds are also uniquely adapted for flight. Some bird species of aquatic environments, particularly seabirds and some waterbird"}
{"title": "coffee", "content": "Coffee is a beverage brewed from roasted, ground coffee beans. Darkly colored, bitter, and slightly acidic, coffee has a stimulating effect on humans, primarily due to its caffeine content, but decaffeinated coffee is also commercially available.  There are also various coffee substitutes. Typically served hot, coffee has the highest sales in the world market for hot drinks.\nCoffee production begins when the seeds from coffee cherries (the Coffea plant's fruits) are separated to produce unroasted green coffee beans. The \"beans\" are roasted and then ground into fine particles. Coffee is brewed from the ground roasted beans, which are typically steeped in hot water before being filtered out. It is usually served hot, although chilled or iced coffee is common. Coffee can be prepared and presented in a variety of ways (e.g., espresso, French press, caffè latte, or already-brewed canned coffee). Sugar, sugar substitutes, milk, and cream are often added to mask the bitter taste or enhance th"}
{"title": "streets", "content": "Streets is the plural of street, a type of road.\nStreets or The Streets may also refer to:"}
{"title": "rug", "content": "A carpet is a textile floor covering typically consisting of an upper layer of pile attached to a backing. The pile was traditionally made from wool, but since the 20th century synthetic fibres such as polypropylene, nylon, and polyester have often been used, as these fibres are less expensive than wool. The pile usually consists of twisted tufts that are typically heat-treated to maintain their structure. The term carpet is often used in a similar context to the term rug, but rugs are mostly considered to be smaller than a room and not attached to the floor.\n\nCarpets are used for a variety of purposes. These include insulating a person's feet from a cold tile or concrete floor, making a room more comfortable as a place to sit on the floor (e.g., when playing with children or as a prayer rug), reducing sound from walking (particularly in apartment buildings), and adding decoration or colour to a room. Carpets can be made in any colour by using differently dyed fibres. Carpets can have "}
{"title": "bear", "content": "Bears are carnivoran mammals of the family Ursidae (). They are classified as caniforms, or doglike carnivorans.  Although only eight species of bears are extant, they are widespread, appearing in a wide variety of habitats throughout most of the Northern Hemisphere and partially in the Southern Hemisphere. Bears are found on the continents of North America, South America, and Eurasia. Common characteristics of modern bears include large bodies with stocky legs, long snouts, small rounded ears, shaggy hair, plantigrade paws with five nonretractile claws, and short tails.\nWhile the polar bear is mostly carnivorous, and the giant panda is mostly herbivorous, the remaining six species are omnivorous with varying diets. With the exception of courting individuals and mothers with their young, bears are typically solitary animals. They may be diurnal or nocturnal and have an excellent sense of smell. Despite their heavy build and awkward gait, they are adept runners, climbers, and swimmers. "}
{"title": "giraffes", "content": "The giraffe is a large African hoofed mammal belonging to the genus Giraffa. It is the tallest living terrestrial animal and the largest ruminant on Earth. It is classified under the family Giraffidae, along with its closest extant relative, the okapi. Traditionally, giraffes have been thought of as one species, Giraffa camelopardalis, with nine subspecies. Most recently, researchers proposed dividing them into four extant species which can be distinguished by their fur coat patterns. Six valid extinct species of Giraffa are known from the fossil record.\nThe giraffe's distinguishing characteristics are its extremely long neck and legs, horn-like ossicones, and spotted coat patterns. Its scattered range extends from Chad in the north to South Africa in the south and from Niger in the west to Somalia in the east. Giraffes usually inhabit savannahs and woodlands. Their food source is leaves, fruits, and flowers of woody plants, primarily acacia species, which they browse at heights most o"}
{"title": "sign", "content": "A sign is an object, quality, event, or entity whose presence or occurrence indicates the probable presence or occurrence of something else. A natural sign bears a causal relation to its object—for instance, thunder is a sign of storm, or medical symptoms a sign of disease. A conventional sign signifies by agreement, as a full stop signifies the end of a sentence; similarly the words and expressions of a language, as well as bodily gestures, can be regarded as signs, expressing particular meanings. The physical objects most commonly referred to as signs (notices, road signs, etc., collectively known as signage) generally inform or instruct using written text, symbols, pictures or a combination of these.\nThe philosophical study of signs and symbols is called semiotics; this includes the study of semiosis, which is the way in which signs (in the semiotic sense) operate."}
{"title": "mountain", "content": "A mountain is an elevated portion of the Earth's crust, generally with steep sides that show significant exposed bedrock. Although definitions vary, a mountain may differ from a plateau in having a limited summit area, and is usually higher than a hill, typically rising at least 300 metres (980 ft) above the surrounding land. A few mountains are isolated summits, but most occur in mountain ranges.\nMountains are formed through tectonic forces, erosion, or volcanism, which act on time scales of up to tens of millions of years. Once mountain building ceases, mountains are slowly leveled through the action of weathering, through slumping and other forms of mass wasting, as well as through erosion by rivers and glaciers.\nHigh elevations on mountains produce colder climates than at sea level at similar latitude. These colder climates strongly affect the ecosystems of mountains: different elevations have different plants and animals. Because of the less hospitable terrain and climate, mountai"}
{"title": "train", "content": "A train (from Old French trahiner, from Latin trahere, \"to pull, to draw\") is a series of connected vehicles that run along a railway track and transport people or freight. Trains are typically pulled or pushed by locomotives (often known simply as \"engines\"), though some are self-propelled, such as multiple units or railcars. Passengers and cargo are carried in railroad cars, also known as wagons or carriages. Trains are designed to a certain gauge, or distance between rails. Most trains operate on steel tracks with steel wheels, the low friction of which makes them more efficient than other forms of transport. Many countries use rail transport.\nTrains have their roots in wagonways, which used railway tracks and were powered by horses or pulled by cables. Following the invention of the steam locomotive in the United Kingdom in 1802, trains rapidly spread around the world, allowing freight and passengers to move over land faster and cheaper than ever possible before. Rapid transit and "}
{"title": "forks", "content": "In cutlery or kitchenware, a fork (from Latin: furca 'pitchfork') is a utensil, now usually made of metal, whose long handle terminates in a head that branches into several narrow and often slightly curved tines with which one can spear foods either to hold them to cut with a knife or to lift them to the mouth."}
{"title": "street", "content": "A street is a public thoroughfare in a city, town or village, typically lined with buildings on one or both sides.  Streets often include pavements (sidewalks), pedestrian crossings, and sometimes amenities like streetlights or benches. A street can be as simple as a level patch of dirt, but is more often paved with a hard, durable surface such as tarmac, concrete, cobblestone or brick. It can be designed for both social activity and movement.\nOriginally, the word street simply meant a paved road (Latin: via strata). The word street is still sometimes used informally as a synonym for road, for example in connection with the ancient Watling Street, but city residents and urban planners draw a significant modern distinction: a road's main function is transportation, while streets facilitate public interaction. Examples of streets include pedestrian streets, alleys, and city-centre streets too crowded for motor vehicles to pass. Conversely, highways and motorways are types of roads, but f"}
{"title": "food", "content": "Food is any substance consumed by an organism for nutritional support. Food is usually of plant, animal, or fungal origin and contains essential nutrients such as carbohydrates, fats, proteins, vitamins, or minerals. The substance is ingested by an organism and assimilated by the organism's cells to provide energy, maintain life, or stimulate growth. Different species of animals have different feeding behaviours that satisfy the needs of their metabolisms and have evolved to fill a specific ecological niche within specific geographical contexts.\nOmnivorous humans are highly adaptable and have adapted to obtaining food in many different ecosystems. Humans generally use cooking to prepare food for consumption. The majority of the food energy required is supplied by the industrial food industry, which produces food through intensive agriculture and distributes it through complex food processing and food distribution systems. This system of conventional agriculture relies heavily on fossil"}
{"title": "chain", "content": "A chain is a serial assembly of connected pieces, called links, typically made of metal, with an overall character similar to that of a rope in that it is flexible and curved in compression but linear, rigid, and load-bearing in tension. A chain may consist of two or more links. Chains can be classified by their design, which can be dictated by their use:\n\nThose designed for lifting, such as when used with a hoist; for pulling; or for securing, such as with a bicycle lock, have links that are torus-shaped, which make the chain flexible in two dimensions (the fixed third dimension being a chain's length). Small chains serving as jewellery are a mostly decorative analogue of such types.\nThose designed for transferring power in machines have links designed to mesh with the teeth of the sprockets of the machine, and are flexible in only one dimension. They are known as roller chains, though there are also non-roller chains such as block chains.\nTwo distinct chains can be connected using a "}
{"title": "men", "content": "A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. Sex differentiation of the male fetus is governed by the SRY gene on the Y chromosome. During puberty, hormones which stimulate androgen production result in the development of secondary sexual characteristics that result in even more differences between the sexes. These include greater muscle mass, greater height, the growth of facial hair and a lower body fat composition. Male anatomy is distinguished from female anatomy by the male reproductive system, which includes the testicles, sperm ducts, prostate gland and epididymides, and penis. Secondary sex characteristics include a narrower pelvis and hips, and smaller breasts and nipples.\nThroughout human history, traditional gender roles have often defined men's activities and opportunities. Men often face con"}
{"title": "cart", "content": "A cart or dray (Australia and New Zealand) is a vehicle designed for transport, using two wheels and normally pulled by draught animals such as horses, donkeys, mules and oxen, or even smaller animals such as goats or large dogs.\nA handcart is pulled or pushed by one or more people.\nOver time, the word \"cart\" has expanded to mean nearly any small conveyance, including shopping carts, golf carts, go-karts, and UTVs, without regard to number of wheels, load carried, or means of propulsion."}
{"title": "sheep", "content": "Sheep (pl.: sheep) or domestic sheep  (Ovis aries) are a domesticated, ruminant mammal typically kept as livestock. Although the term sheep can apply to other species in the genus Ovis, in everyday usage it almost always refers to domesticated sheep. Like all ruminants, sheep are members of the order Artiodactyla, the even-toed ungulates. Numbering a little over one billion, domestic sheep are also the most numerous species of sheep. An adult female is referred to as a ewe ( yoo), an intact male as a ram, occasionally a tup, a castrated male as a wether, and a young sheep as a lamb.\nSheep are most likely descended from the wild mouflon of Europe and Asia, with Iran being a geographic envelope of the domestication center. One of the earliest animals to be domesticated for agricultural purposes, sheep are raised for fleeces, meat (lamb, hogget or mutton), and milk. A sheep's wool is the most widely used animal fiber, and is usually harvested by shearing. In Commonwealth countries, ovine "}
{"title": "floor", "content": "A floor is the bottom surface of a room or vehicle. Floors vary from simple dirt in a cave to many layered surfaces made with modern technology. Floors may be stone, wood, bamboo, metal or any other material that can support the expected load.\nThe levels of a building are often referred to as floors, although sometimes referred to as storeys.\nFloors typically consist of a subfloor for support and a floor covering used to give a good walking surface. In modern buildings the subfloor often has electrical wiring, plumbing, and other services built in. As floors must meet many needs, some essential to safety, floors are built to strict building codes in some regions."}
{"title": "pads", "content": "Pads (also called leg guards) are a type of protective equipment used in a number of sports and serve to protect the legs from the impact of a hard ball, puck, or other object of play travelling at high speed which could otherwise cause injuries to the lower legs. These are used by batters in the sport of cricket, catchers in the sports of baseball and fastpitch softball, and by goaltenders in sports such as ice hockey, ringette, bandy, rinkball, field hockey, rink hockey and box lacrosse."}
{"title": "bridge", "content": "A bridge is a structure built to span a physical obstacle (such as a body of water, valley, road, or railway) without blocking the path underneath. It is constructed for the purpose of providing passage over the obstacle, which is usually something that is otherwise difficult or impossible to cross. There are many different designs of bridges, each serving a particular purpose and applicable to different situations. Designs of bridges vary depending on factors such as the function of the bridge, the nature of the terrain where the bridge is constructed and anchored, the material used to make it, and the funds available to build it.\nThe earliest bridges were likely made with fallen trees and stepping stones. The Neolithic people built boardwalk bridges across marshland. The Arkadiko Bridge, dating from the 13th century BC, in the Peloponnese is one of the oldest arch bridges in existence and use."}
{"title": "weeds", "content": "A weed is an unwanted plant of any species.\nWeed or weeds may also refer to:"}
{"title": "space", "content": "Space is a three-dimensional continuum containing positions and directions. In classical physics, physical space is often conceived in three linear dimensions. Modern physicists usually consider it, with time, to be part of a boundless four-dimensional continuum known as spacetime. The concept of space is considered to be of fundamental importance to an understanding of the physical universe. However, disagreement continues between philosophers over whether it is itself an entity, a relationship between entities, or part of a conceptual framework.\nIn the 19th and 20th centuries mathematicians began to examine geometries that are non-Euclidean, in which space is conceived as curved, rather than flat, as in the Euclidean space. According to Albert Einstein's theory of general relativity, space around gravitational fields deviates from Euclidean space. Experimental tests of general relativity have confirmed that non-Euclidean geometries provide a better model for the shape of space."}
{"title": "collage", "content": "Collage (, from the French: coller, \"to glue\" or \"to stick together\") is a technique of art creation, primarily used in the visual arts, but in music too, by which art results from an assembly of different forms, thus creating a new whole. (Compare with pastiche, which is a \"pasting\" together.)   Collage may refer to the technique as a whole, or more specifically to a two-dimensional work, assembled from flat pieces on a flat substrate, whereas assemblage typically refers to a three-dimensional equivalent.\nA collage may sometimes include magazine and newspaper clippings, ribbons, paint, bits of colored or handmade papers, portions of other artwork or texts, photographs and other found objects, glued to a piece of paper or canvas. The origins of collage can be traced back hundreds of years, but this technique made a dramatic reappearance in the early 20th century as an art form of novelty.\nThe term Papier collé was coined by both Georges Braque and Pablo Picasso in the beginning of the "}
{"title": "books", "content": "A book is a structured presentation of recorded information, primarily verbal and graphical, through a medium. Originally physical, electronic books and audiobooks are now existent. Physical books are objects that contain printed material, mostly of writing and images. Modern books are typically composed of many pages bound together and protected by a cover, what is known as the codex format; older formats include the scroll and the tablet.\nAs a conceptual object, a book often refers to a written work of substantial length by one or more authors, which may also be distributed digitally as an electronic book (ebook). These kinds of works can be broadly classified into fiction (containing invented content, often narratives) and non-fiction (containing content intended as factual truth). But a physical book may not contain a written work: for example, it may contain only drawings, engravings, photographs, sheet music, puzzles, or removable content like paper dolls.\nThe modern book industr"}
{"title": "boat", "content": "A boat is a watercraft of a large range of types and sizes, but generally smaller than a ship, which is distinguished by its larger size or capacity, its shape, or its ability to carry boats.\nSmall boats are typically used on inland waterways such as rivers and lakes, or in protected coastal areas. However, some boats (such as whaleboats) were intended for offshore use. In modern naval terms, a boat is a vessel small enough to be carried aboard a ship.\nBoats vary in proportion and construction methods with their intended purpose, available materials, or local traditions. Canoes have been used since prehistoric times and remain in use throughout the world for transportation, fishing, and sport. Fishing boats vary widely in style partly to match local conditions. Pleasure craft used in recreational boating include ski boats, pontoon boats, and sailboats. House boats may be used for vacationing or long-term residence. Lighters are used to move cargo to and from large ships unable to get c"}
{"title": "book", "content": "A book is a structured presentation of recorded information, primarily verbal and graphical, through a medium. Originally physical, electronic books and audiobooks are now existent. Physical books are objects that contain printed material, mostly of writing and images. Modern books are typically composed of many pages bound together and protected by a cover, what is known as the codex format; older formats include the scroll and the tablet.\nAs a conceptual object, a book often refers to a written work of substantial length by one or more authors, which may also be distributed digitally as an electronic book (ebook). These kinds of works can be broadly classified into fiction (containing invented content, often narratives) and non-fiction (containing content intended as factual truth). But a physical book may not contain a written work: for example, it may contain only drawings, engravings, photographs, sheet music, puzzles, or removable content like paper dolls.\nThe modern book industr"}
{"title": "slope", "content": "In mathematics, the slope or gradient of a line is a number that describes the direction of the line on a plane. Often denoted by the letter m, slope is calculated as the ratio of the vertical change to the horizontal change (\"rise over run\") between two distinct points on the line, giving the same number for any choice of points. \nThe line may be physical – as set by a road surveyor, pictorial as in a diagram of a road or roof, or abstract.\nAn application of the mathematical concept is found in the grade or gradient in geography and civil engineering. \nThe steepness, incline, or grade of a line is the absolute value of its slope: greater absolute value indicates a steeper line. The line trend is defined as follows: \n\nAn \"increasing\" or \"ascending\" line goes up from left to right and has positive slope: \n  \n    \n      \n        m\n        >\n        0\n      \n    \n    {\\displaystyle m>0}\n  \n.\nA \"decreasing\" or \"descending\" line goes down from left to right and has negative slope: \n  \n    \n"}
{"title": "number", "content": "A number is a mathematical object used to count, measure, and label. The most basic examples are the natural numbers 1, 2, 3, 4, and so forth. Numbers can be represented in language with number words. More universally, individual numbers can be represented by symbols, called numerals; for example, \"5\" is a numeral that represents the number five. As only a relatively small number of symbols can be memorized, basic numerals are commonly organized in a numeral system, which is an organized way to represent any number. The most common numeral system is the Hindu–Arabic numeral system, which allows for the representation of any non-negative integer using a combination of ten fundamental numeric symbols, called digits. In addition to their use in counting and measuring, numerals are often used for labels (as with telephone numbers), for ordering (as with serial numbers), and for codes (as with ISBNs). In common usage, a numeral is not clearly distinguished from the number that it represents"}
{"title": "water", "content": "Water is an inorganic compound with the chemical formula H2O. It is a transparent, tasteless, odorless, and nearly colorless chemical substance. It is the main constituent of Earth's hydrosphere and the fluids of all known living organisms (in which it acts as a solvent). It is vital for all known forms of life, despite not providing food energy or organic micronutrients. Its chemical formula, H2O, indicates that each of its molecules contains one oxygen and two hydrogen atoms, connected by covalent bonds. The hydrogen atoms are attached to the oxygen atom at an angle of 104.45°. In liquid form, H2O is also called \"water\" at standard temperature and pressure.\nBecause Earth's environment is relatively close to water's triple point, water exists on Earth as a solid, a liquid, and a gas. It forms precipitation in the form of rain and aerosols in the form of fog. Clouds consist of suspended droplets of water and ice, its solid state. When finely divided, crystalline ice may precipitate in "}
{"title": "umbrellas", "content": "An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain. The term umbrella is traditionally used when protecting oneself from rain, while parasol is used when protecting oneself from sunlight, though the terms continue to be used interchangeably. Often the difference is the material used for the canopy; some parasols are not waterproof, and some umbrellas are transparent. Umbrella canopies may be made of fabric or flexible plastic. There are also combinations of parasol and umbrella that are called en-tout-cas (French for \"in any case\").\nGenerally speaking, parasols and umbrellas are small, handheld, personal use items. Golf umbrellas are the biggest hand-portable umbrellas available. There are two types of umbrellas: completely collapsible umbrellas, which can be folded up into a small enough bag because of the supporting metal pole's ability to retract, an"}
{"title": "cellphone", "content": "A mobile phone or cell phone is a portable telephone that allows users to make and receive calls over a radio frequency link while moving within a designated telephone service area, unlike fixed-location phones (landline phones). This radio frequency link connects to the switching systems of a mobile phone operator, providing access to the public switched telephone network (PSTN). Modern mobile telephony relies on a cellular network architecture, which is why mobile phones are often referred to as 'cell phones' in North America.\nBeyond traditional voice communication, digital mobile phones have evolved to support a wide range of additional services. These include text messaging, multimedia messaging, email, and internet access (via LTE, 5G NR or Wi-Fi), as well as short-range wireless technologies like Bluetooth, infrared, and ultra-wideband (UWB).\nMobile phones also support a variety of multimedia capabilities, such as digital photography, video recording, and gaming. In addition, the"}
{"title": "chair", "content": "A chair is a type of seat, typically designed for one person and consisting of one or more legs, a flat or slightly angled seat and a back-rest. It may be made of wood, metal, or synthetic materials, and may be padded or upholstered in various colors and fabrics.\nChairs vary in design. An armchair has armrests fixed to the seat; a recliner is upholstered and features a mechanism that lowers the chair's back and raises into place a footrest; a rocking chair has legs fixed to two long curved slats; and a wheelchair has wheels fixed to an axis under the seat."}
{"title": "equipment", "content": "Equipment most commonly refers to a set of tools or other objects commonly used to achieve a particular objective. Different jobs require different kinds of equipment."}
{"title": "mirror", "content": "A mirror, also known as a looking glass, is an object that reflects an image. Light that bounces off a mirror forms an image of whatever is in front of it, which is then focused through the lens of the eye or a camera. Mirrors reverse the direction of light at an angle equal to its incidence. This allows the viewer to see themselves or objects behind them, or even objects that are at an angle from them but out of their field of view, such as around a corner. Natural mirrors have existed since prehistoric times, such as the surface of water, but people have been manufacturing mirrors out of a variety of materials for thousands of years, like stone, metals, and glass. In modern mirrors, metals like silver or aluminium are often used due to their high reflectivity, applied as a thin coating on glass because of its naturally smooth and very hard surface.\nA mirror is a wave reflector. Light consists of waves, and when light waves reflect from the flat surface of a mirror, those waves retain"}
{"title": "button", "content": "A button is a  fastener that joins two pieces of fabric together by slipping through a loop or by sliding through a buttonhole.\nIn modern clothing and fashion design, buttons are commonly made of plastic but also may be made of metal, wood, or seashell. Buttons can also be used on containers such as wallets and bags. Buttons may be sewn onto garments and similar items exclusively for purposes of ornamentation. In the applied arts and craft, a button can be an example of folk art, studio craft, or even a miniature work of art. In archaeology, a button can be a significant artifact."}
{"title": "tower", "content": "A tower is a tall structure, taller than it is wide, often by a significant factor. Towers are distinguished from masts by their lack of guy-wires and are therefore, along with tall buildings, self-supporting structures.\nTowers are specifically distinguished from buildings in that they are built not to be habitable but to serve other functions using the height of the tower. For example, the height of a clock tower improves the visibility of the clock, and the height of a tower in a fortified building such as a castle increases the visibility of the surroundings for defensive purposes. Towers may also be built for observation, leisure, or telecommunication purposes. A tower can stand alone or be supported by adjacent buildings, or it may be a feature on top of a larger structure or building."}
{"title": "bowls", "content": "Bowls, also known as lawn bowls or lawn bowling, is a sport in which players try to roll their ball (called a bowl) closest to a smaller ball (known as a \"jack\" or sometimes a \"kitty\"). The bowls are shaped (biased), so that they follow a curved path when being rolled. The game is played either in teams or one against one.\nThe game was first played in the 13th century. The game is played on grass, although other surfaces are sometimes used. Matches are held either until one player gets to a score, or when a number of ends are played.\nThe game is mostly played on a bowling green, which can vary by the type of bowls being played. Whilst the game is often played outdoors, there are indoor bowling venues, and can also be played on rollable carpets. For outdoor games, this is usually on grass; however, it can also be played on cotula in New Zealand."}
{"title": "image", "content": "An image or picture is a visual representation. An image can be two-dimensional, such as a drawing, painting, or photograph, or three-dimensional, such as a carving or sculpture. Images may be displayed through other media, including a projection on a surface, activation of electronic signals, or digital displays; they can also be reproduced through mechanical means, such as photography, printmaking, or photocopying. Images can also be animated through digital or physical processes.\nIn the context of signal processing, an image is a distributed amplitude of color(s). In optics, the term image (or optical image) refers specifically to the reproduction of an object formed by light waves coming from the object.\nA volatile image exists or is perceived only for a short period. This may be a reflection of an object by a mirror, a projection of a camera obscura, or a scene displayed on a cathode-ray tube. A fixed image, also called a hard copy, is one that has been recorded on a material obje"}
{"title": "obstacle", "content": "An obstacle (also called a barrier, impediment, or stumbling block) is an object, thing, action or situation that causes an obstruction. A obstacle blocks or hinders our way forward. Different types of obstacles include physical, economic, biopsychosocial, cultural, political, technological and military."}
{"title": "oranges", "content": "The orange, also called sweet orange to distinguish it from the bitter orange (Citrus × aurantium), is the fruit of a tree in the family Rutaceae. Botanically, this is the hybrid Citrus × sinensis, between the pomelo (Citrus maxima) and the mandarin orange (Citrus reticulata). The chloroplast genome, and therefore the maternal line, is that of pomelo. There are many related hybrids including of mandarins and sweet orange. The sweet orange has had its full genome sequenced.\nThe orange originated in a region encompassing Southern China, Northeast India, and Myanmar; the earliest mention of the sweet orange was in Chinese literature in 314 BC. Orange trees are widely grown in tropical and subtropical areas for their sweet fruit. The fruit of the orange tree can be eaten fresh or processed for its juice or fragrant peel. In 2022, 76 million tonnes of oranges were grown worldwide, with Brazil producing 22% of the total, followed by India and China.\nOranges, variously understood, have featur"}
{"title": "classroom", "content": "A classroom, schoolroom or lecture room is a learning space in which both children and adults learn. Classrooms are found in educational institutions of all kinds, ranging from preschools to universities, and may also be found in other places where education or training is provided, such as corporations and religious and humanitarian organizations. The classroom provides a space where learning can take place uninterrupted by outside distractions."}
{"title": "camera", "content": "A camera is an instrument used to capture and store images and videos, either digitally via an electronic image sensor, or chemically via a light-sensitive material such as photographic film. As a pivotal technology in the fields of photography and videography, cameras have played a significant role in the progression of visual arts, media, entertainment, surveillance, and scientific research. The invention of the camera dates back to the 19th century and has since evolved with advancements in technology, leading to a vast array of types and models in the 21st century.\nCameras function through a combination of multiple mechanical components and principles. These include exposure control, which regulates the amount of light reaching the sensor or film; the lens, which focuses the light; the viewfinder, which allows the user to preview the scene; and the film or sensor, which captures the image.\nSeveral types of camera exist, each suited to specific uses and offering unique capabilities."}
{"title": "milkshake", "content": "A milkshake (sometimes simply called a shake) is a sweet beverage made by blending milk, ice cream, and flavorings or sweeteners such as butterscotch, caramel sauce, chocolate syrup, or fruit syrup into a thick, sweet, cold mixture. It may also be made using a base made from non-dairy products, including plant milks such as almond milk, coconut milk, or soy milk. Dry ingredients such as whole fruit, nuts, seeds, candy, or cookies may be incorporated.\nMilkshakes originated in the United States around the turn of the 20th century, and grew in popularity following the introduction of electric blenders in the subsequent two decades. They became a common part of youth popular culture, as ice cream shops were a culturally acceptable meeting place for youth, and milkshakes became symbolic of the innocence of youth."}
{"title": "bat", "content": "Bats are flying mammals of the order Chiroptera (). With their forelimbs adapted as wings, they are the only mammals capable of true and sustained flight. Bats are more agile in flight than most birds, flying with their very long spread-out digits covered with a thin membrane or patagium. The smallest bat, and arguably the smallest extant mammal, is Kitti's hog-nosed bat, which is 29–34 mm (1.1–1.3 in) in length, 150 mm (5.9 in) across the wings and 2–2.6 g (0.071–0.092 oz) in mass. The largest bats are the flying foxes, with the giant golden-crowned flying fox (Acerodon jubatus) reaching a weight of 1.6 kg (3.5 lb) and having a wingspan of 1.7 m (5 ft 7 in).\nThe second largest order of mammals after rodents, bats comprise about 20% of all classified mammal species worldwide, with over 1,400 species. These were traditionally divided into two suborders: the largely fruit-eating megabats, and the echolocating microbats. But more recent evidence has supported dividing the order into Yinpt"}
{"title": "stroller", "content": "Various methods of transporting children have been used in different cultures and times. These methods include baby carriages (prams in British English), infant car seats, portable bassinets (carrycots), strollers (pushchairs), slings, backpacks, baskets and bicycle carriers.\nThe large, heavy prams (short for perambulator), which had become popular during the Victorian era, were replaced by lighter designs during the latter half of the 1900s."}
{"title": "tie", "content": "Tie has two principal meanings:\n\nTie (draw), a finish to a competition with identical results, particularly sports\nNecktie, a long piece of cloth worn around the neck or shoulders\nTie or TIE may also refer to:"}
{"title": "dogs", "content": "The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers. The dog was the first species to be domesticated by humans, over 14,000 years ago and before the development of agriculture. Due to their long association with humans, dogs have gained the ability to thrive on a starch-rich diet that would be inadequate for other canids.\nDogs have been bred for desired behaviors, sensory capabilities, and physical attributes. Dog breeds vary widely in shape, size, and color. They have the same number of bones (with the exception of the tail), powerful jaws that house around 42 teeth, and well-developed senses of smell, hearing, and sight. Compared to humans, dogs possess a superior sense of smell and hearing, but inferior visual acuity. Dogs perform many roles for humans, such as hunting, herding, pulling loads, protection, c"}
{"title": "cage", "content": "A cage is an enclosure often made of mesh, bars, or wires, used to confine, contain or protect something or someone. A cage can serve many purposes, including keeping an animal or person in captivity, capturing an animal or person, and displaying an animal at a zoo."}
{"title": "umbrella", "content": "An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain. The term umbrella is traditionally used when protecting oneself from rain, while parasol is used when protecting oneself from sunlight, though the terms continue to be used interchangeably. Often the difference is the material used for the canopy; some parasols are not waterproof, and some umbrellas are transparent. Umbrella canopies may be made of fabric or flexible plastic. There are also combinations of parasol and umbrella that are called en-tout-cas (French for \"in any case\").\nGenerally speaking, parasols and umbrellas are small, handheld, personal use items. Golf umbrellas are the biggest hand-portable umbrellas available. There are two types of umbrellas: completely collapsible umbrellas, which can be folded up into a small enough bag because of the supporting metal pole's ability to retract, an"}
{"title": "stove", "content": "A stove or range is a device that generates heat inside or on top of the device, for -local heating or cooking. Stoves can be powered with many fuels, such as natural gas, electricity, gasoline, wood, and coal.\nDue to concerns about air pollution, efforts have been made to improve stove design. Pellet stoves are a type of clean-burning stove. Air-tight stoves are another type that burn the wood more completely and therefore, reduce the amount of the combustion by-products. Another method of reducing air pollution is through the addition of a device to clean the exhaust gas, for example, a filter or afterburner.\nResearch and development on safer and less emission releasing stoves is continuously evolving."}
{"title": "potatoes", "content": "The potato () is a starchy tuberous vegetable native to the Americas that is consumed as a staple food in many parts of the world. Potatoes are underground stem tubers of the plant Solanum tuberosum, a perennial in the nightshade family Solanaceae.\nWild potato species can be found from the southern United States to southern Chile. Genetic studies show that the cultivated potato has a single origin, in the area of present-day southern Peru and extreme northwestern Bolivia. Potatoes were domesticated there about 7,000–10,000 years ago from a species in the S. brevicaule complex. Many varieties of the potato are cultivated in the Andes region of South America, where the species is indigenous.\nThe Spanish introduced potatoes to Europe in the second half of the 16th century from the Americas. They are a staple food in many parts of the world and an integral part of much of the world's food supply. Following millennia of selective breeding, there are now over 5,000 different varieties of pot"}
{"title": "woman", "content": "A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause. More generally, sex differentiation of the female fetus is governed by the lack of a present, or functioning, SRY gene on either one of the respective sex chromosomes. Female anatomy is distinguished from male anatomy by the female reproductive system, which includes the ovaries, fallopian tubes, uterus, vagina, and vulva. An adult woman generally has a wider pelvis, broader hips, and larger breasts than an adult man. These characteristics facilitate childbirth and breastfeeding. Women typically have less facial and other body hair, have a higher body fat composition, and are on average shorter and less muscular than men.\nThroughout human history, traditional gender roles within "}
{"title": "hands", "content": "A hand is a prehensile, multi-fingered appendage located at the end of the forearm or forelimb of primates such as humans, chimpanzees, monkeys, and lemurs. A few other vertebrates such as the koala (which has two opposable thumbs on each \"hand\" and fingerprints extremely similar to human fingerprints) are often described as having \"hands\" instead of paws on their front limbs. The raccoon is usually described as having \"hands\" though opposable thumbs are lacking.\nSome evolutionary anatomists use the term hand to refer to the appendage of digits on the forelimb more generally—for example, in the context of whether the three digits of the bird hand involved the same homologous loss of two digits as in the dinosaur hand.\nThe human hand usually has five digits: four fingers plus one thumb; however, these are often referred to collectively as five fingers, whereby the thumb is included as one of the fingers. It has 27 bones, not including the sesamoid bone, the number of which varies among "}
{"title": "brush", "content": "A brush is a common tool with bristles, wire or other filaments. It generally consists of a handle or block to which filaments are affixed in either a parallel or perpendicular orientation, depending on the way the brush is to be gripped during use. The material of both the block and bristles or filaments is chosen to withstand hazards of its intended use, such as corrosive chemicals, heat or abrasion. It is used for cleaning, grooming hair, make up,   painting,  surface finishing and for many other purposes.   It is one of the most basic and versatile tools in use today, and the average household may contain several dozen varieties."}
{"title": "cups", "content": "A cup is a small container used to hold liquids for drinking, typically with a flattened hemispherical shape, and often with a capacity of about 6–16 US fluid ounces (177–473 ml).  Cups may be made of pottery (including porcelain), glass, metal, wood, stone, polystyrene, plastic, lacquerware, or other materials. Normally, a cup is brought in contact with the mouth for drinking, distinguishing it from other tableware and drinkware forms such as jugs; however, a straw and/or lid may also be used. They also often have handles, though a beaker has no handle or stem, and small bowl shapes are very common in Asia. \nCups of different styles may be used for different types of liquids or other foodstuffs (e.g. teacups and measuring cups), in different situations (e.g. at water stations or in ceremonies and rituals), or for decoration. \n\nThe history of cups goes back well into prehistory, initially mostly as handle-less beakers or bowls, and they have been found in most cultures across the world"}
{"title": "banana", "content": "A banana is an elongated, edible fruit – botanically a berry – produced by several kinds of large treelike herbaceous flowering plants in the genus Musa. In some countries, cooking bananas are called plantains, distinguishing them from dessert bananas. The fruit is variable in size, color and firmness, but is usually elongated and curved, with soft flesh rich in starch covered with a peel, which may have a variety of colors when ripe. It grows upward in clusters near the top of the plant. Almost all modern edible seedless (parthenocarp) cultivated bananas come from two wild species – Musa acuminata and Musa balbisiana, or hybrids of them.\nMusa species are native to tropical Indomalaya and Australia; they were probably domesticated in New Guinea. They are grown in 135 countries, primarily for their fruit, and to a lesser extent to make banana paper and textiles, while some are grown as ornamental plants. The world's largest producers of bananas in 2022 were India and China, which togeth"}
{"title": "hole", "content": "A hole is an opening in or through a particular medium, usually a solid body. Holes occur through natural and artificial processes, and may be useful for various purposes, or may represent a problem needing to be addressed in many fields of engineering. Depending on the material and the placement, a hole may be an indentation in a surface (such as a hole in the ground), or may pass completely through that surface (such as a hole created by a hole puncher in a piece of paper)."}
{"title": "deer", "content": "A deer (pl.: deer) or true deer is a hoofed ruminant ungulate of the family Cervidae (informally the deer family). Cervidae is divided into subfamilies Cervinae (which includes, among others, muntjac, elk (wapiti), red deer, and fallow deer) and Capreolinae (which includes, among others reindeer (caribou), white-tailed deer, roe deer, and moose). Male deer of almost all species (except the water deer), as well as female reindeer, grow and shed new antlers each year. These antlers are bony extensions of the skull and are often used for combat between males.\nThe musk deer (Moschidae) of Asia and chevrotains (Tragulidae) of tropical African and Asian forests are separate families that are also in the ruminant clade Ruminantia; they are not especially closely related to Cervidae.\nDeer appear in art from Paleolithic cave paintings onwards, and they have played a role in mythology, religion, and literature throughout history, as well as in heraldry, such as red deer that appear in the coat o"}
{"title": "rocks", "content": "In geology, rock (or stone) is any naturally occurring solid mass or aggregate of minerals or mineraloid matter. It is categorized by the minerals included, its chemical composition, and the way in which it is formed. Rocks form the Earth's outer solid layer, the crust, and most of its interior, except for the liquid outer core and pockets of magma in the asthenosphere. The study of rocks involves multiple subdisciplines of geology, including petrology and mineralogy. It may be limited to rocks found on Earth, or it may include planetary geology that studies the rocks of other celestial objects.\nRocks are usually grouped into three main groups: igneous rocks, sedimentary rocks and metamorphic rocks. Igneous rocks are formed when magma cools in the Earth's crust, or lava cools on the ground surface or the seabed. Sedimentary rocks are formed by diagenesis and lithification of sediments, which in turn are formed by the weathering, transport, and deposition of existing rocks. Metamorphic "}
{"title": "bride", "content": "A bride is a woman who is about to be married or who is a newlywed.\nWhen marrying, if the bride's future spouse is a man, he is usually referred to as the bridegroom or just groom.  In Western culture, a bride may be attended by a maid, bridesman and one or more bridesmaids.\nThe word \"bride\" has its roots in the Old English word bryd, which is shared with other Germanic languages. In Western countries, brides typically wear white wedding dresses, a tradition started by Queen Victoria. The white dress was once considered a symbol of luxury due to the difficulties in laundering delicate white clothing. Today, Western brides may wear white, cream, or ivory dresses, regardless of their number of marriages.\nIn non-Western countries, brides often wear national dress, with white wedding dresses being uncommon in Asian cultures as it symbolizes mourning and death. Red, on the other hand, represents vibrancy and health and is commonly worn by brides in many Asian cultures. Brides may also wear "}
{"title": "rope", "content": "A rope is a group of yarns, plies, fibres, or strands that are twisted or braided together into a larger and stronger form. Ropes have high tensile strength and can be used for dragging and lifting. Rope is thicker and stronger than similarly constructed cord, string, and twine."}
{"title": "itself", "content": "A reflexive pronoun is a pronoun that refers to another noun or pronoun (its antecedent) within the same sentence.\nIn the English language specifically, a reflexive pronoun will end in -self or -selves, and refer to a previously named noun or pronoun (myself, yourself, ourselves, themselves, etc.). English intensive pronouns, used for emphasis, take the same form.\nIn generative grammar, a reflexive pronoun is an anaphor that must be bound by its antecedent (see binding). In a general sense, it is a noun phrase that obligatorily gets its meaning from another noun phrase in the sentence. Different languages have different binding domains for reflexive pronouns, according to their structure."}
{"title": "pans", "content": "Cookware and bakeware is food preparation equipment, such as cooking pots, pans, baking sheets etc. used in kitchens. Cookware is used on a stove or range cooktop, while bakeware is used in an oven. Some utensils are considered both cookware and bakeware.\nThere is a great variety of cookware and bakeware in shape, material, and inside surface. Some materials conduct heat well; some retain heat well. Some surfaces are non-stick; some require seasoning.\nSome pots and their lids have handles or knobs made of low thermal conductance materials such as bakelite, plastic or wood, which make them easy to pick up without oven gloves.\nA good cooking pot design has an \"overcook edge\" which is what the lid lies on. The lid has a dripping edge that prevents condensation fluid from dripping off when handling the lid (taking it off and holding it 45°) or putting it down."}
{"title": "cows", "content": "Cattle (Bos taurus) are large, domesticated, bovid ungulates widely kept as livestock. They are prominent modern members of the subfamily Bovinae and the most widespread species of the genus Bos. Mature female cattle are called cows and mature male cattle are bulls. Young female cattle are called heifers, young male cattle are oxen or bullocks, and castrated male cattle are known as steers. \nCattle are commonly raised for meat, for dairy products, and for leather. As draft animals, they pull carts and farm implements. Cattle are considered sacred animals within Hinduism, and it is illegal to kill them in some Indian states. Small breeds such as the miniature Zebu are kept as pets.\nTaurine cattle are widely distributed across Europe and temperate areas of Asia, the Americas, and Australia. Zebus are found mainly in India and tropical areas of Asia, America, and Australia. Sanga cattle are found primarily in sub-Saharan Africa. These types, sometimes classified as separate species or sub"}
{"title": "mustang", "content": "The mustang is a free-roaming horse of the Western United States, descended from horses brought to the Americas by the Spanish conquistadors. Mustangs are often referred to as wild horses, but because they are descended from once-domesticated animals, they are actually feral horses. The original mustangs were Colonial Spanish horses, but many other breeds and types of horses contributed to the modern mustang, now resulting in varying phenotypes. Some free-roaming horses are relatively unchanged from the original Spanish stock, most strongly represented in the most isolated populations.\nIn 1971, the United States Congress recognized that \"wild free-roaming horses and burros are living symbols of the historic and pioneer spirit of the West, which continue to contribute to the diversity of life forms within the Nation and enrich the lives of the American people.\" The free-roaming horse population is managed and protected by the U.S. Bureau of Land Management (BLM).\nControversy surrounds t"}
{"title": "enclosure", "content": "Enclosure or inclosure is a term, used in English landownership, that refers to the appropriation of \"waste\" or \"common land\", enclosing it, and by doing so depriving commoners of their traditional rights of access and usage. Agreements to enclose land could be either through a formal or informal process. The process could normally be accomplished in three ways. First there was the creation of \"closes\", taken out of larger common fields by their owners. Secondly, there was enclosure by proprietors, owners who acted together, usually small farmers or squires, leading to the enclosure of whole parishes. Finally there were enclosures by acts of Parliament.\nThe stated justification for enclosure was to improve the efficiency of agriculture. However, there were other motives too, one example being that the value of the land enclosed would be substantially increased. There were social consequences to the policy, with many protests at the removal of rights from the common people. Enclosure ri"}
{"title": "girl", "content": "A girl is a young female human, usually a child or an adolescent.  While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture.  In cultures where women have or had a low social position, girls may be unwanted by their parents, and society may invest less in girls.  The difference in girls' and boys' upbringing ranges from slight to completely different.  Mixing of the sexes may vary by age, and from totally mixed to total sex segregation."}
{"title": "orange", "content": "Orange most often refers to:\n\nOrange (fruit), the fruit of the tree species  Citrus × sinensis\nOrange blossom, its fragrant flower\nOrange juice\nOrange (colour), the color of an orange fruit, occurs between red and yellow in the visible light spectrum\nSome other citrus or citrus-like fruit, see list of plants known as orange\nOrange (word), both a noun and an adjective in the English language\nOrange may also refer to:"}
{"title": "detour", "content": "A detour or (British English: diversion) is a (normally temporary) route taking traffic around an area of prohibited or reduced access, such as a construction site. Standard operating procedure for many roads departments is to route any detour over roads within the same jurisdiction as the road with the obstructed area.\nOn multi-lane highways (e.g., freeways, expressways, city streets, etc.), usually traffic shifts can replace a detour, as detours often congest turn lanes."}
