{"title": "time", "content": "Time is the continuous progression of existence that occurs in an apparently irreversible succession from the past, through the present, and into the future. It is a component quantity of various measurements used to sequence events, to compare the duration of events (or the intervals between them), and to quantify rates of change of quantities in material reality or in the conscious experience. Time is often referred to as a fourth dimension, along with three spatial dimensions.\nTime is one of the seven fundamental physical quantities in both the International System of Units (SI) and International System of Quantities. The SI base unit of time is the second, which is defined by measuring the electronic transition frequency of caesium atoms. General relativity is the primary framework for understanding how spacetime works. Through advances in both theoretical and experimental investigations of spacetime, it has been shown that time can be distorted and dilated, particularly at the edg"}
{"title": "view", "content": "View(s) may refer to:"}
{"title": "people", "content": "The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty. In contrast, a people is any plurality of persons considered as a whole. Used in politics and law, the term \"a people\" refers to the collective or community of an ethnic group or nation."}
{"title": "side", "content": "Side or Sides may refer to:"}
{"title": "lots", "content": "Lot, LOT, The Lot or similar may refer to:"}
{"title": "floor", "content": "A floor is the bottom surface of a room or vehicle. Floors vary from simple dirt in a cave to many layered surfaces made with modern technology. Floors may be stone, wood, bamboo, metal or any other material that can support the expected load.\nThe levels of a building are often referred to as floors, although sometimes referred to as storeys.\nFloors typically consist of a subfloor for support and a floor covering used to give a good walking surface. In modern buildings the subfloor often has electrical wiring, plumbing, and other services built in. As floors must meet many needs, some essential to safety, floors are built to strict building codes in some regions."}
{"title": "magnets", "content": "A magnet is a material or object that produces a magnetic field. This magnetic field is invisible but is responsible for the most notable property of a magnet: a force that pulls on other ferromagnetic materials, such as iron, steel, nickel, cobalt, etc. and attracts or repels other magnets.\nA permanent magnet is an object made from a material that is magnetized and creates its own persistent magnetic field. An everyday example is a refrigerator magnet used to hold notes on a refrigerator door. Materials that can be magnetized, which are also the ones that are strongly attracted to a magnet, are called ferromagnetic (or ferrimagnetic). These include the elements iron, nickel and cobalt and their alloys, some alloys of rare-earth metals, and some naturally occurring minerals such as lodestone. Although ferromagnetic (and ferrimagnetic) materials are the only ones attracted to a magnet strongly enough to be commonly considered magnetic, all other substances respond weakly to a magnetic f"}
{"title": "lid", "content": "A lid or cover is part of a container, and serves as the closure or seal, usually one that completely closes the object. Lids can be placed on small containers such as tubs as well as larger lids for open-head pails and drums."}
{"title": "that", "content": "That is an English language word used for several grammatical purposes. These include use as an adjective, conjunction, pronoun, adverb and intensifier; it has distance from the speaker, as opposed to words like this.\nThe word did not originally exist in Old English, and its concept was represented by þe. Once it came into being, it was spelt as þæt (among others, such as þet), taking the role of the modern that. It also took on the role of the modern word what, though this has since changed, and that has recently replaced some usage of the modern which.\nPronunciation of the word varies according to its role within a sentence, with a strong form,   and a weak form,  ."}
{"title": "exhibit", "content": "Exhibit may refer to:\n\nExhibit (legal), evidence in physical form brought before the court\nDemonstrative evidence, exhibits and other physical forms of evidence used in court to demonstrate, show, depict, inform or teach relevant information to the target audience\nExhibit (educational), an object or set of objects on show in a museum, gallery, archive or classroom, typically in a showcase, as part of an exhibition\nExhibit (web editing tool), a lightweight structured data publishing framework\nExhibit, a trade show display\nExhibit, a novel by Korean American novelist R. O. Kwon"}
{"title": "children", "content": "A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being. In English-speaking countries, the legal definition of child generally refers to a minor, in this case as a person younger than the local age of majority (there are exceptions such as, for example, the consume and purchase of alcoholic beverage even after said age of majority), regardless of their physical, mental and sexual development as biological adults. Children generally have fewer rights and responsibilities than adults. They are generally classed as unable to make serious decisions. \nChild may also describe a relationship with a parent (such as sons and daughters of any age) or, metaphorically, an authority figure, or signify group membership in a clan, tribe, or religion; it can also signify being strongly affected by a specific time, place, or circumstance, as in \"a child of nature\" or \"a"}
{"title": "tray", "content": "A tray is a shallow platform designed for the carrying of items. It can be fashioned from numerous materials, including silver, brass, sheet iron, paperboard, wood, melamine, and molded pulp. Trays range in cost from inexpensive molded pulp trays which are disposable and inexpensive melamine trays used in cafeterias, to mid-priced wooden trays used in a home, to expensive silver trays used in luxury hotels. Some examples have raised galleries, handles, and short feet for support.\nTrays are flat, but with raised edges to stop things from sliding off them. They are made in a range of shapes but are commonly found in oval or rectangular forms, sometimes with cutout or attached handles with which to carry them.\nA more elaborate device is the tray table, which is designed to accommodate a tray, or to serve as a tray itself. There are two primary kinds of tray tables. The TV tray table is typically a small table, which may have legs that fold to allow it to be carried like a tray. The airpla"}
{"title": "disc", "content": "Disc or disk may refer to:\n\nDisk (mathematics), a two dimensional shape, the interior of a circle\nDisk storage\nOptical disc\nFloppy disk"}
{"title": "rocks", "content": "In geology, rock (or stone) is any naturally occurring solid mass or aggregate of minerals or mineraloid matter. It is categorized by the minerals included, its chemical composition, and the way in which it is formed. Rocks form the Earth's outer solid layer, the crust, and most of its interior, except for the liquid outer core and pockets of magma in the asthenosphere. The study of rocks involves multiple subdisciplines of geology, including petrology and mineralogy. It may be limited to rocks found on Earth, or it may include planetary geology that studies the rocks of other celestial objects.\nRocks are usually grouped into three main groups: igneous rocks, sedimentary rocks and metamorphic rocks. Igneous rocks are formed when magma cools in the Earth's crust, or lava cools on the ground surface or the seabed. Sedimentary rocks are formed by diagenesis and lithification of sediments, which in turn are formed by the weathering, transport, and deposition of existing rocks. Metamorphic "}
{"title": "glasses", "content": "Glasses, also known as eyeglasses (American English), spectacles (Commonwealth English), or colloquially as specs, are vision eyewear with clear or tinted lenses mounted in a frame that holds them in front of a person's eyes, typically utilizing a bridge over the nose and hinged arms, known as temples or temple pieces, that rest over the ears for support.\nGlasses are typically used for vision correction, such as with reading glasses and glasses used for nearsightedness; however, without the specialized lenses, they are sometimes used for cosmetic purposes. \nSafety glasses are eye protection, a form of personal protective equipment (PPE) that are worn by workers around their eyes for protection. Safety glasses act as a shield to protect the eyes from any type of foreign debris that may cause irritation or injury; these glasses may have protection on the sides of the eyes as well as in the lenses. Some types of safety glasses are used to protect against visible and near-visible light or "}
{"title": "skateboard", "content": "A skateboard is a type of sports equipment used for skateboarding. It is usually made of a specially designed 7–8-ply maple plywood deck and has polyurethane wheels attached to the underside by a pair of skateboarding trucks.\nThe skateboard moves by pushing with one foot while the other foot remains balanced on the board, or by pumping one's legs in structures such as a bowl or half pipe. A skateboard can also be used by standing on the deck while on a downward slope and allowing gravity to propel the board and the rider. If the rider's leading foot is their left foot, they are said to ride \"regular\". Conversely, they are said to ride \"goofy\" if their leading foot is their right foot. \nThe two main types of skateboards are the longboard and shortboard. The shape of the board is also important: the skateboard must be concaved to perform tricks."}
{"title": "box", "content": "A box (plural: boxes) is a container with rigid sides used for the storage or transportation of its contents. Most boxes have flat, parallel, rectangular sides (typically rectangular prisms). Boxes can be very small (like a matchbox) or very large (like a shipping box for furniture) and can be used for a variety of purposes, from functional to decorative. \nBoxes may be made of a variety of materials, both durable (such as wood and metal) and non-durable (such as corrugated fiberboard and paperboard). Corrugated metal boxes are commonly used as shipping containers.\nBoxes may be closed and shut with flaps, doors, or a separate lid. They can be secured shut with adhesives, tapes, string, or more decorative or elaborately functional mechanisms, such as catches, clasps or locks."}
{"title": "mouse", "content": "A mouse (pl.: mice) is a small rodent. Characteristically, mice are known to have a pointed snout, small rounded ears, a body-length scaly tail, and a high breeding rate. The best known mouse species is the common house mouse (Mus musculus). Mice are also popular as pets. In some places, certain kinds of field mice are locally common. They are known to invade homes for food and shelter.\nMice are typically distinguished from rats by their size. Generally, when a muroid rodent is discovered, its common name includes the term mouse if it is smaller, or rat if it is larger. The common terms rat and mouse are not taxonomically specific. Typical mice are classified in the genus Mus, but the term mouse is not confined to members of Mus and can also apply to species from other genera such as the deer mouse (Peromyscus).\nDomestic mice sold as pets often differ substantially in size from the common house mouse. This is attributable to breeding and different conditions in the wild. The best-known"}
{"title": "refrigerator", "content": "A refrigerator, commonly shortened to fridge, is a commercial and home appliance consisting of a thermally insulated compartment and a heat pump (mechanical, electronic or chemical) that transfers heat from its inside to its external environment so that its inside is cooled to a temperature below the room temperature. Refrigeration is an essential food storage technique around the world. The low temperature reduces the reproduction rate of bacteria, so the refrigerator lowers the rate of spoilage. A refrigerator maintains a temperature a few degrees above the freezing point of water. The optimal temperature range for perishable food storage is 3 to 5 °C (37 to 41 °F). A freezer is a specialized refrigerator, or portion of a refrigerator, that maintains its contents’ temperature below the freezing point of water. The refrigerator replaced the icebox, which had been a common household appliance for almost a century and a half. The United States Food and Drug Administration recommends tha"}
{"title": "zebra", "content": "Zebras (US: , UK: ) (subgenus Hippotigris) are African equines with distinctive black-and-white striped coats. There are three living species: Grévy's zebra (Equus grevyi), the plains zebra (E. quagga), and the mountain zebra (E. zebra). Zebras share the genus Equus with horses and asses, the three groups being the only living members of the family Equidae. Zebra stripes come in different patterns, unique to each individual. Several theories have been proposed for the function of these patterns, with most evidence supporting them as a deterrent for biting flies. Zebras inhabit eastern and southern Africa and can be found in a variety of habitats such as savannahs, grasslands, woodlands, shrublands, and mountainous areas.\nZebras are primarily grazers and can subsist on lower-quality vegetation. They are preyed on mainly by lions, and typically flee when threatened but also bite and kick. Zebra species differ in social behaviour, with plains and mountain zebra living in stable harems con"}
{"title": "rock", "content": "Rock most often refers to:\n\nRock (geology), a naturally occurring solid aggregate of minerals or mineraloids\nRock music, a genre of popular music\nRock or Rocks may also refer to:"}
{"title": "orange", "content": "Orange most often refers to:\n\nOrange (fruit), the fruit of the tree species  Citrus × sinensis\nOrange blossom, its fragrant flower\nOrange juice\nOrange (colour), the color of an orange fruit, occurs between red and yellow in the visible light spectrum\nSome other citrus or citrus-like fruit, see list of plants known as orange\nOrange (word), both a noun and an adjective in the English language\nOrange may also refer to:"}
{"title": "wall", "content": "A wall is a structure and a surface that defines an area; carries a load; provides security, shelter, or soundproofing; or serves a decorative purpose. There are various types of walls, including border barriers between countries, brick walls, defensive walls in fortifications, and retaining walls that hold back dirt, stone, water, or noise. Walls can also be found in buildings, where they support roofs, floors, and ceilings, enclose spaces, and provide shelter and security.\nThe construction of walls can be categorized into framed walls and mass-walls. Framed walls transfer the load to the foundation through posts, columns, or studs and typically consist of structural elements, insulation, and finish elements. Mass-walls are made of solid materials such as masonry, concrete, adobe, or rammed earth. Walls may also house utilities like electrical wiring or plumbing and must conform to local building and fire codes.\nWalls have historically served defensive purposes, with the term \"wall\" o"}
{"title": "motor", "content": "An engine or motor is a machine designed to convert one or more forms of energy into mechanical energy.\nAvailable energy sources include potential energy (e.g. energy of the Earth's gravitational field as exploited in hydroelectric power generation), heat energy (e.g. geothermal), chemical energy, electric potential and nuclear energy (from nuclear fission or nuclear fusion). Many of these processes generate heat as an intermediate energy form; thus heat engines have special importance. Some natural processes, such as atmospheric convection cells convert environmental heat into motion (e.g. in the form of rising air currents). Mechanical energy is of particular importance in transportation, but also plays a role in many industrial processes such as cutting, grinding, crushing, and mixing.\nMechanical heat engines convert heat into work via various thermodynamic processes. The internal combustion engine is perhaps the most common example of a mechanical heat engine in which heat from the"}
{"title": "closeup", "content": "A close-up or closeup in filmmaking, television production, still photography, and the comic strip medium is a type of shot that tightly frames a person or object. Close-ups are one of the standard shots used regularly with medium and long shots (cinematic techniques). Close-ups display the most detail, but they do not include the broader scene. Moving toward or away from a close-up is a common type of zooming. A close up is taken from head to neck, giving the viewer a detailed view of the subject's face."}
{"title": "pool", "content": "Pool may refer to:"}
{"title": "field", "content": "Field may refer to:"}
{"title": "camera", "content": "A camera is an instrument used to capture and store images and videos, either digitally via an electronic image sensor, or chemically via a light-sensitive material such as photographic film. As a pivotal technology in the fields of photography and videography, cameras have played a significant role in the progression of visual arts, media, entertainment, surveillance, and scientific research. The invention of the camera dates back to the 19th century and has since evolved with advancements in technology, leading to a vast array of types and models in the 21st century.\nCameras function through a combination of multiple mechanical components and principles. These include exposure control, which regulates the amount of light reaching the sensor or film; the lens, which focuses the light; the viewfinder, which allows the user to preview the scene; and the film or sensor, which captures the image.\nSeveral types of camera exist, each suited to specific uses and offering unique capabilities."}
{"title": "cars", "content": "A car, or an automobile, is a motor vehicle with wheels. Most definitions of cars state that they run primarily on roads, seat one to eight people, have four wheels, and mainly transport people rather than cargo. There are around one billion cars in use worldwide.\nThe French inventor Nicolas-Joseph Cugnot built the first steam-powered road vehicle in 1769, while the Swiss inventor François Isaac de Rivaz designed and constructed the first internal combustion-powered automobile in 1808. The modern car—a practical, marketable automobile for everyday use—was invented in 1886, when the German inventor Carl Benz patented his Benz Patent-Motorwagen. Commercial cars became widely available during the 20th century. The 1901 Oldsmobile Curved Dash and the 1908 Ford Model T, both American cars, are widely considered the first mass-produced and mass-affordable cars, respectively. Cars were rapidly adopted in the US, where they replaced horse-drawn carriages. In Europe and other parts of the world"}
{"title": "rug", "content": "A carpet is a textile floor covering typically consisting of an upper layer of pile attached to a backing. The pile was traditionally made from wool, but since the 20th century synthetic fibres such as polypropylene, nylon, and polyester have often been used, as these fibres are less expensive than wool. The pile usually consists of twisted tufts that are typically heat-treated to maintain their structure. The term carpet is often used in a similar context to the term rug, but rugs are mostly considered to be smaller than a room and not attached to the floor.\n\nCarpets are used for a variety of purposes. These include insulating a person's feet from a cold tile or concrete floor, making a room more comfortable as a place to sit on the floor (e.g., when playing with children or as a prayer rug), reducing sound from walking (particularly in apartment buildings), and adding decoration or colour to a room. Carpets can be made in any colour by using differently dyed fibres. Carpets can have "}
{"title": "gate", "content": "A gate or gateway is a point of entry to or from a space enclosed by walls. The word is derived from Proto-Germanic *gatan, meaning an opening or passageway. Synonyms include yett (which comes from the same root word) and portal. The concept originally referred to the gap or hole in the wall or fence, rather than a barrier which closed it. Gates may prevent or control the entry or exit of individuals, or they may be merely decorative. The moving part or parts of a gateway may be considered \"doors\", as they are fixed at one side whilst opening and closing like one.\nA gate may have a latch that can be raised and lowered to both open a gate or prevent it from swinging. Gate operation can be either automated or manual. Locks are also used on gates to increase security. \nLarger gates can be used for a whole building, such as a castle or fortified town. Doors can also be considered gates when they are used to block entry as prevalent within a gatehouse."}
{"title": "surfboard", "content": "A surfboard is a narrow plank used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave. They were invented in ancient Hawaii, where they were known as papa heʻe nalu in the Hawaiian language, and were usually made of wood from local trees, such as koa. They were often over 460 cm (15 ft) in length and extremely heavy. Major advances over the years include the addition of one or more fins (skegs) on the bottom rear of the board to improve directional stability, and numerous improvements in materials and shape.\nModern surfboards are made of polyurethane or polystyrene foam. Unlike soft top surfboards, hard top surfboards are also covered with layers of fiberglass cloth, polyester or epoxy resin. The result is a light and strong surfboard that is buoyant and maneuverable. Recent developments in surfboard technology have included the use of carbon fiber and kevlar composites, as well as experimentation in b"}
{"title": "animals", "content": "Animals are multicellular, eukaryotic organisms in the biological kingdom Animalia (). With few exceptions, animals consume organic material, breathe oxygen, have myocytes and are able to move, can reproduce sexually, and grow from a hollow sphere of cells, the blastula, during embryonic development. Animals form a clade, meaning that they arose from a single common ancestor. Over 1.5 million living animal species have been described, of which around 1.05 million are insects, over 85,000 are molluscs, and around 65,000 are vertebrates. It has been estimated there are as many as 7.77 million animal species on Earth. Animal body lengths range from 8.5 μm (0.00033 in) to 33.6 m (110 ft). They have complex ecologies and interactions with each other and their environments, forming intricate food webs. The scientific study of animals is known as zoology, and the study of animal behaviour is known as ethology.\nThe animal kingdom is divided into five major clades, namely Porifera, Ctenophora, "}
{"title": "backseat", "content": "Backseat or back seat may refer to:\n\na car seat located at the rear of a vehicle\nBackseat (band), Danish pop / rock group\nBackseat (album), a 1986 album by Finnish hard rock band Peer Günt\n\"Backseat\" (song), a 2011 single by the New Boyz featuring The Cataracs and Dev\n\"Back Seat (of My Jeep)\",by LL Cool J, 1993\n\"Backseat\", a song by Charli XCX from the 2017 mixtape Pop 2\n\"Backseat\", a song by K.A.R.D's BM and Somin\n\"Back Seat (Wit No Sheets)\", a song by H-Town from the 1994 album Beggin' After Dark"}
{"title": "front", "content": "Front may refer to:"}
{"title": "giraffes", "content": "The giraffe is a large African hoofed mammal belonging to the genus Giraffa. It is the tallest living terrestrial animal and the largest ruminant on Earth. It is classified under the family Giraffidae, along with its closest extant relative, the okapi. Traditionally, giraffes have been thought of as one species, Giraffa camelopardalis, with nine subspecies. Most recently, researchers proposed dividing them into four extant species which can be distinguished by their fur coat patterns. Six valid extinct species of Giraffa are known from the fossil record.\nThe giraffe's distinguishing characteristics are its extremely long neck and legs, horn-like ossicones, and spotted coat patterns. Its scattered range extends from Chad in the north to South Africa in the south and from Niger in the west to Somalia in the east. Giraffes usually inhabit savannahs and woodlands. Their food source is leaves, fruits, and flowers of woody plants, primarily acacia species, which they browse at heights most o"}
{"title": "officers", "content": "An officer is a person who has a position of authority in a hierarchical organization. The term derives from Old French oficier \"officer, official\" (early 14c., Modern French officier), from Medieval Latin officiarius \"an officer,\" from Latin officium \"a service, a duty\" the late Latin from officiarius, meaning \"official.\""}
{"title": "tracks", "content": "Track or Tracks may refer to:"}
{"title": "hamburger", "content": "A hamburger (or simply a burger) consists of fillings—usually a patty of ground meat, typically beef—placed inside a sliced bun or bread roll. The patties are often served with cheese, lettuce, tomato, onion, pickles, bacon, or chilis with condiments such as ketchup, mustard, mayonnaise, relish or a \"special sauce\", often a variation of Thousand Island dressing, and are frequently placed on sesame seed buns. A hamburger patty topped with cheese is called a cheeseburger. Under some definitions, and in some cultures, a hamburger is considered a sandwich.\nHamburgers are typically associated with fast-food restaurants and diners but are also sold at other restaurants, including high-end establishments. There are many international and regional variations of hamburgers. Some of the largest multinational fast-food chains feature burgers as one of their core products: McDonald's Big Mac and Burger King's Whopper have become global icons of American culture."}
{"title": "sign", "content": "A sign is an object, quality, event, or entity whose presence or occurrence indicates the probable presence or occurrence of something else. A natural sign bears a causal relation to its object—for instance, thunder is a sign of storm, or medical symptoms a sign of disease. A conventional sign signifies by agreement, as a full stop signifies the end of a sentence; similarly the words and expressions of a language, as well as bodily gestures, can be regarded as signs, expressing particular meanings. The physical objects most commonly referred to as signs (notices, road signs, etc., collectively known as signage) generally inform or instruct using written text, symbols, pictures or a combination of these.\nThe philosophical study of signs and symbols is called semiotics; this includes the study of semiosis, which is the way in which signs (in the semiotic sense) operate."}
{"title": "airplane", "content": "An airplane (American English), or aeroplane (Commonwealth English), informally plane, is a fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller, or rocket engine. Airplanes come in a variety of sizes, shapes, and wing configurations. The broad spectrum of uses for airplanes includes recreation, transportation of goods and people, military, and research. Worldwide, commercial aviation transports more than four billion passengers annually on airliners and transports more than 200 billion tonne-kilometers of cargo annually, which is less than 1% of the world's cargo movement. Most airplanes are flown by a pilot on board the aircraft, but some are designed to be remotely or computer-controlled such as drones.\nThe Wright brothers invented and flew the first airplane in 1903, recognized as \"the first sustained and controlled heavier-than-air powered flight\". They built on the works of George Cayley dating from 1799, when he set forth the concept of the modern"}
{"title": "building", "content": "A building or edifice is an enclosed structure with a roof, walls and often windows, usually standing permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for numerous factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, prestige, and aesthetic reasons. To better understand the concept, see Nonbuilding structure for contrast.  \nBuildings serve several societal needs – occupancy, primarily as shelter from weather, security, living space, privacy, to store belongings, and to comfortably live and work. A building as a shelter represents a physical separation of the human habitat (a place of comfort and safety) from the outside (a place that may be harsh and harmful at times).\nbuildings have been objects or canvasses of much artistic expression. In recent years, interest in sustainable planning and building practices has become "}
{"title": "couple", "content": "Couple or couples may refer to:\n\nCouple, a set of two of items of a type\nCouple (mechanics), a pair of force which are equal in magnitude but opposite in direction and separated by a perpendicular distance so that their line of action do not coincide that cause a turning effect\nCouple (relationship), two people in an intimate relationship"}
{"title": "background", "content": "Background may refer to:"}
{"title": "fries", "content": "French fries, or simply fries, also known as chips, and finger chips (Indian English), are batonnet or julienne-cut deep-fried potatoes of disputed origin. They are prepared by cutting potatoes into even strips, drying them, and frying them, usually in a deep fryer. Pre-cut, blanched, and frozen russet potatoes are widely used, and sometimes baked in a regular or convection oven, such as an air fryer.\nFrench fries are served hot, either soft or crispy, and are generally eaten as part of lunch or dinner or by themselves as a snack, and they commonly appear on the menus of diners, fast food restaurants, pubs, and bars. They are typically salted and may be served with ketchup, vinegar, mayonnaise, tomato sauce, or other sauces. Fries can be topped more heavily, as in the dishes of poutine, loaded fries or chili cheese fries, and are occasionally made from sweet potatoes instead of potatoes."}
{"title": "pizza", "content": "Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples. In 2009, Neapolitan pizza was registered with the European Union as a traditional speciality guaranteed (TSG) dish. In 2017, the art of making Neapolitan pizza was included on UNESCO's list of intangible cultural heritage.\nPizza and its variants are among the most popular foods in the world. Pizza is sold at a variety of restaurants, including pizzerias (pizza specialty restaurants), Mediterranean restaurants, via delivery, and as street food. In Italy, pizza served in a restaurant is presented unsliced, and is eaten with the use of a kn"}
{"title": "toothbrush", "content": "A toothbrush is a special type of brush used to clean the teeth, gums, and tongue. It consists of a head of tightly clustered bristles, atop of which toothpaste can be applied, mounted on a handle which facilitates the cleaning of hard-to-reach areas of the mouth. They should be used in conjunction with something to clean between the teeth where the bristles of the toothbrush cannot reach - for example floss, tape, interdental brushes or toothpicks.\nThey are available with different bristle textures, sizes, and forms. Most dentists recommend using a soft toothbrush since hard-bristled toothbrushes can damage tooth enamel and irritate the gums.\nBecause many common and effective ingredients in toothpaste are harmful if swallowed in large doses, tooth paste should instead be spat out. The act of brushing teeth is most often done at a sink within the kitchen or bathroom, where the brush may be rinsed off afterwards to remove any debris remaining and then dried to reduce conditions ideal fo"}
{"title": "light", "content": "Light, visible light, or visible radiation is electromagnetic radiation that can be perceived by the human eye. Visible light spans the visible spectrum and is usually defined as having wavelengths in the range of 400–700 nanometres (nm), corresponding to frequencies of 750–420 terahertz. The visible band sits adjacent to the infrared (with longer wavelengths and lower frequencies) and the ultraviolet (with shorter wavelengths and higher frequencies), called collectively optical radiation.\nIn physics, the term \"light\" may refer more broadly to electromagnetic radiation of any wavelength, whether visible or not. In this sense, gamma rays, X-rays, microwaves and radio waves are also light. The primary properties of light are intensity, propagation direction, frequency or wavelength spectrum, and polarization. Its speed in vacuum, 299792458 m/s, is one of the fundamental constants of nature. All electromagnetic radiation exhibits some properties of both particles and waves. Single, massle"}
{"title": "animal", "content": "Animals are multicellular, eukaryotic organisms in the biological kingdom Animalia (). With few exceptions, animals consume organic material, breathe oxygen, have myocytes and are able to move, can reproduce sexually, and grow from a hollow sphere of cells, the blastula, during embryonic development. Animals form a clade, meaning that they arose from a single common ancestor. Over 1.5 million living animal species have been described, of which around 1.05 million are insects, over 85,000 are molluscs, and around 65,000 are vertebrates. It has been estimated there are as many as 7.77 million animal species on Earth. Animal body lengths range from 8.5 μm (0.00033 in) to 33.6 m (110 ft). They have complex ecologies and interactions with each other and their environments, forming intricate food webs. The scientific study of animals is known as zoology, and the study of animal behaviour is known as ethology.\nThe animal kingdom is divided into five major clades, namely Porifera, Ctenophora, "}
{"title": "water", "content": "Water is an inorganic compound with the chemical formula H2O. It is a transparent, tasteless, odorless, and nearly colorless chemical substance. It is the main constituent of Earth's hydrosphere and the fluids of all known living organisms (in which it acts as a solvent). It is vital for all known forms of life, despite not providing food energy or organic micronutrients. Its chemical formula, H2O, indicates that each of its molecules contains one oxygen and two hydrogen atoms, connected by covalent bonds. The hydrogen atoms are attached to the oxygen atom at an angle of 104.45°. In liquid form, H2O is also called \"water\" at standard temperature and pressure.\nBecause Earth's environment is relatively close to water's triple point, water exists on Earth as a solid, a liquid, and a gas. It forms precipitation in the form of rain and aerosols in the form of fog. Clouds consist of suspended droplets of water and ice, its solid state. When finely divided, crystalline ice may precipitate in "}
{"title": "car", "content": "A car, or an automobile, is a motor vehicle with wheels. Most definitions of cars state that they run primarily on roads, seat one to eight people, have four wheels, and mainly transport people rather than cargo. There are around one billion cars in use worldwide.\nThe French inventor Nicolas-Joseph Cugnot built the first steam-powered road vehicle in 1769, while the Swiss inventor François Isaac de Rivaz designed and constructed the first internal combustion-powered automobile in 1808. The modern car—a practical, marketable automobile for everyday use—was invented in 1886, when the German inventor Carl Benz patented his Benz Patent-Motorwagen. Commercial cars became widely available during the 20th century. The 1901 Oldsmobile Curved Dash and the 1908 Ford Model T, both American cars, are widely considered the first mass-produced and mass-affordable cars, respectively. Cars were rapidly adopted in the US, where they replaced horse-drawn carriages. In Europe and other parts of the world"}
{"title": "train", "content": "A train (from Old French trahiner, from Latin trahere, \"to pull, to draw\") is a series of connected vehicles that run along a railway track and transport people or freight. Trains are typically pulled or pushed by locomotives (often known simply as \"engines\"), though some are self-propelled, such as multiple units or railcars. Passengers and cargo are carried in railroad cars, also known as wagons or carriages. Trains are designed to a certain gauge, or distance between rails. Most trains operate on steel tracks with steel wheels, the low friction of which makes them more efficient than other forms of transport. Many countries use rail transport.\nTrains have their roots in wagonways, which used railway tracks and were powered by horses or pulled by cables. Following the invention of the steam locomotive in the United Kingdom in 1802, trains rapidly spread around the world, allowing freight and passengers to move over land faster and cheaper than ever possible before. Rapid transit and "}
{"title": "food", "content": "Food is any substance consumed by an organism for nutritional support. Food is usually of plant, animal, or fungal origin and contains essential nutrients such as carbohydrates, fats, proteins, vitamins, or minerals. The substance is ingested by an organism and assimilated by the organism's cells to provide energy, maintain life, or stimulate growth. Different species of animals have different feeding behaviours that satisfy the needs of their metabolisms and have evolved to fill a specific ecological niche within specific geographical contexts.\nOmnivorous humans are highly adaptable and have adapted to obtaining food in many different ecosystems. Humans generally use cooking to prepare food for consumption. The majority of the food energy required is supplied by the industrial food industry, which produces food through intensive agriculture and distributes it through complex food processing and food distribution systems. This system of conventional agriculture relies heavily on fossil"}
{"title": "cat", "content": "The cat (Felis catus), also referred to as the domestic cat or house cat, is a small domesticated carnivorous mammal. It is the only domesticated species of the family Felidae. Advances in archaeology and genetics have shown that the domestication of the cat occurred in the Near East around 7500 BC. It is commonly kept as a pet and working cat, but also ranges freely as a feral cat avoiding human contact. It is valued by humans for companionship and its ability to kill vermin. Its retractable claws are adapted to killing small prey species such as mice and rats. It has a strong, flexible body, quick reflexes, and sharp teeth, and its night vision and sense of smell are well developed. It is a social species, but a solitary hunter and a crepuscular predator.\nCat intelligence is evident in their ability to adapt, learn through observation, and solve problems. Research has shown they possess strong memories, exhibit neuroplasticity, and display cognitive skills comparable to those of a yo"}
{"title": "kite", "content": "A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag forces. A kite consists of wings, tethers and anchors. Kites often have a bridle and tail to guide the face of the kite so the wind can lift it. Some kite designs do not need a bridle; box kites can have a single attachment point. A kite may have fixed or moving anchors that can balance the kite. The name is derived from the kite, the hovering bird of prey.\nThere are several shapes of kites. \nThe lift that sustains the kite in flight is generated when air moves around the kite's surface, producing low pressure above and high pressure below the wings. The interaction with the wind also generates horizontal drag along the direction of the wind. The resultant force vector from the lift and drag force components is opposed by the tension of one or more of the lines or tethers to which the kite is attached. The anchor point of the kite line may be static or moving (e.g., the tow"}
{"title": "buses", "content": "A bus (contracted from omnibus, with variants multibus, motorbus, autobus, etc.) is a motor vehicle that carries significantly more passengers than an average car or van, but fewer than the average rail transport. It is most commonly used in public transport, but is also in use for charter purposes, or through private ownership. Although the average bus carries between 30 and 100 passengers, some buses have a capacity of up to 300 passengers. The most common type is the single-deck rigid bus, with double-decker and articulated buses carrying larger loads, and midibuses and minibuses carrying smaller loads. Coaches are used for longer-distance services. Many types of buses, such as city transit buses and inter-city coaches, charge a fare. Other types, such as elementary or secondary school buses or shuttle buses within a post-secondary education campus, are free. In many jurisdictions, bus drivers require a special large vehicle licence above and beyond a regular driving license.\nBuses "}
{"title": "player", "content": "Player may refer to:"}
{"title": "seat", "content": "A seat is a place to sit. The term may encompass additional features, such as back, armrest, head restraint but may also refer to concentrations of power in a wider sense (i.e \"seat (legal entity)\"). See disambiguation."}
{"title": "girl", "content": "A girl is a young female human, usually a child or an adolescent.  While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture.  In cultures where women have or had a low social position, girls may be unwanted by their parents, and society may invest less in girls.  The difference in girls' and boys' upbringing ranges from slight to completely different.  Mixing of the sexes may vary by age, and from totally mixed to total sex segregation."}
{"title": "men", "content": "A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. Sex differentiation of the male fetus is governed by the SRY gene on the Y chromosome. During puberty, hormones which stimulate androgen production result in the development of secondary sexual characteristics that result in even more differences between the sexes. These include greater muscle mass, greater height, the growth of facial hair and a lower body fat composition. Male anatomy is distinguished from female anatomy by the male reproductive system, which includes the testicles, sperm ducts, prostate gland and epididymides, and penis. Secondary sex characteristics include a narrower pelvis and hips, and smaller breasts and nipples.\nThroughout human history, traditional gender roles have often defined men's activities and opportunities. Men often face con"}
{"title": "sink", "content": "A sink (also known as basin in the UK) is a bowl-shaped plumbing fixture for washing hands, dishwashing, and other purposes. Sinks have a tap (faucet) that supplies hot and cold water and may include a spray feature to be used for faster rinsing. They also include a drain to remove used water; this drain may itself include a strainer and/or shut-off device and an overflow-prevention device. Sinks may also have an integrated soap dispenser. Many sinks, especially in kitchens, are installed adjacent to or inside a counter.\nWhen a sink becomes clogged, a person will often resort to using a chemical drain cleaner or a plunger, though most professional plumbers will remove the clog with a drain auger (often called a \"plumber's snake\")."}
{"title": "laptop", "content": "A laptop computer or notebook computer, also known as a laptop or notebook, is a small, portable personal computer (PC). Laptops typically have a clamshell form factor with a flat-panel screen on the inside of the upper lid and an alphanumeric keyboard and pointing device on the inside of the lower lid. Most of the computer's internal hardware is in the lower part, under the keyboard, although many modern laptops have a built-in webcam at the top of the screen, and some even feature a touchscreen display. In most cases, unlike tablet computers which run on mobile operating systems, laptops tend to run on desktop operating systems, which were originally developed for desktop computers.\nLaptops are used in a variety of settings, such as at work (especially on business trips), in education, for playing games, content creating, web browsing, for personal multimedia, and for general home computer use. They can run on both AC power and rechargable battery packs and can be folded shut for con"}
{"title": "broccoli", "content": "Broccoli (Brassica oleracea var. italica) is an edible green plant in the cabbage family (family Brassicaceae, genus Brassica) whose large flowering head, stalk and small associated leaves are eaten as a vegetable. Broccoli is classified in the Italica cultivar group of the species Brassica oleracea. Broccoli has large flower heads, or florets, usually dark green, arranged in a tree-like structure branching out from a thick stalk, which is usually light green. Leaves surround the mass of flower heads. Broccoli resembles cauliflower, a different but closely related cultivar group of the same Brassica species.\nIt can be eaten either raw or cooked. Broccoli is a particularly rich source of vitamin C and vitamin K. Contents of its characteristic sulfur-containing glucosinolate compounds, isothiocyanates and sulforaphane, are diminished by boiling but are better preserved by steaming, microwaving or stir-frying.\nRapini, sometimes called \"broccoli rabe\", is a distinct species from broccoli, "}
{"title": "branch", "content": "A branch, also called a ramus in botany, is a stem that grows off from another stem, or when structures like veins in leaves are divided into smaller veins."}
{"title": "piece", "content": "Piece or Pieces (not to be confused with peace) may refer to:"}
{"title": "grass", "content": "Poaceae ( poh-AY-see-e(y)e), also called Gramineae ( grə-MIN-ee-e(y)e), is a large and nearly ubiquitous family of monocotyledonous flowering plants commonly known as grasses. It includes the cereal grasses, bamboos, the grasses of natural grassland and species cultivated in lawns and pasture. The latter are commonly referred to collectively as grass.\nWith around 780 genera and around 12,000 species, the Poaceae is the fifth-largest plant family, following the Asteraceae, Orchidaceae, Fabaceae and Rubiaceae.\nThe Poaceae are the most economically important plant family, including staple foods from domesticated cereal crops such as maize, wheat, rice, oats, barley, and millet for people and as feed for meat-producing animals. They provide, through direct human consumption, just over one-half (51%) of all dietary energy; rice provides 20%, wheat supplies 20%, maize (corn) 5.5%, and other grains 6%. Some members of the Poaceae are used as building materials (bamboo, thatch, and straw); oth"}
{"title": "button", "content": "A button is a  fastener that joins two pieces of fabric together by slipping through a loop or by sliding through a buttonhole.\nIn modern clothing and fashion design, buttons are commonly made of plastic but also may be made of metal, wood, or seashell. Buttons can also be used on containers such as wallets and bags. Buttons may be sewn onto garments and similar items exclusively for purposes of ornamentation. In the applied arts and craft, a button can be an example of folk art, studio craft, or even a miniature work of art. In archaeology, a button can be a significant artifact."}
{"title": "body", "content": "Body may refer to:"}
{"title": "cheeses", "content": "Cheese is a type of dairy product produced in a range of flavors, textures, and forms by coagulation of the milk protein casein. It comprises proteins and fat from milk (usually the milk of cows, buffalo, goats or sheep). During production, milk is usually acidified and either the enzymes of rennet or bacterial enzymes with similar activity are added to cause the casein to coagulate. The solid curds are then separated from the liquid whey and pressed into finished cheese. Some cheeses have aromatic molds on the rind, the outer layer, or throughout.\nOver a thousand types of cheese exist, produced in various countries. Their styles, textures and flavors depend on the origin of the milk (including the animal's diet), whether they have been pasteurised, the butterfat content, the bacteria and mold, the processing, and how long they have been aged. Herbs, spices, or wood smoke may be used as flavoring agents.  Other added ingredients may include black pepper, garlic, chives or cranberries. "}
{"title": "device", "content": "A device is usually a constructed tool. Device may also refer to:"}
{"title": "donuts", "content": "A doughnut or donut () is a type of pastry made from leavened fried dough.: 275  It is popular in many countries and is prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors. Doughnut is the traditional spelling, while donut is the simplified version; the terms are used interchangeably.\nDoughnuts are usually deep fried from a flour dough, but other types of batters can also be used. Various toppings and flavors are used for different types, such as sugar, chocolate or maple glazing. Doughnuts may also include water, leavening, eggs, milk, sugar, oil, shortening, and natural or artificial flavors.\nThe two most common types are the ring doughnut and the filled doughnut, which is injected with fruit preserves (the jelly doughnut), cream, custard, or other sweet fillings. Small pieces of dough are sometimes cooked as doughnut holes. Once fried, doughnuts may be glazed with a sugar icing, spread "}
{"title": "lot", "content": "Lot, LOT, The Lot or similar may refer to:"}
{"title": "top", "content": "Top most commonly refers to:\n\nTop, a basic term of orientation, distinguished from bottom, front, back, and sides\nSpinning top, a ubiquitous traditional toy\nTop (clothing), clothing designed to be worn over the torso\nMountain top, a mountain peak located at some distance from the nearest point of higher elevation\nTop may also refer to:"}
{"title": "things", "content": "Things or The Things may refer to:"}
{"title": "meats", "content": "Meat is animal tissue, often muscle, that is eaten as food. Humans have hunted and farmed other animals for meat since prehistory. The Neolithic Revolution allowed the domestication of vertebrates, including chickens, sheep, goats, pigs, horses, and cattle, starting around 11,000 years ago. Since then, selective breeding has enabled farmers to produce meat with the qualities desired by producers and consumers.\nMeat is mainly composed of water, protein, and fat. Its quality is affected by many factors, including the genetics, health, and nutritional status of the animal involved. Without preservation, bacteria and fungi decompose and spoil unprocessed meat within hours or days. Meat is edible raw, but it is mostly eaten cooked, such as by stewing or roasting, or processed, such as by smoking or salting. \nThe consumption of meat (especially red and processed meat, as opposed to fish and poultry) increases the risk of certain negative health outcomes including cancer, coronary heart disea"}
{"title": "brush", "content": "A brush is a common tool with bristles, wire or other filaments. It generally consists of a handle or block to which filaments are affixed in either a parallel or perpendicular orientation, depending on the way the brush is to be gripped during use. The material of both the block and bristles or filaments is chosen to withstand hazards of its intended use, such as corrosive chemicals, heat or abrasion. It is used for cleaning, grooming hair, make up,   painting,  surface finishing and for many other purposes.   It is one of the most basic and versatile tools in use today, and the average household may contain several dozen varieties."}
{"title": "dog", "content": "The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers. The dog was the first species to be domesticated by humans, over 14,000 years ago and before the development of agriculture. Due to their long association with humans, dogs have gained the ability to thrive on a starch-rich diet that would be inadequate for other canids.\nDogs have been bred for desired behaviors, sensory capabilities, and physical attributes. Dog breeds vary widely in shape, size, and color. They have the same number of bones (with the exception of the tail), powerful jaws that house around 42 teeth, and well-developed senses of smell, hearing, and sight. Compared to humans, dogs possess a superior sense of smell and hearing, but inferior visual acuity. Dogs perform many roles for humans, such as hunting, herding, pulling loads, protection, c"}
{"title": "keyboard", "content": "Keyboard may refer to:"}
{"title": "kitchen", "content": "A kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment. A modern middle-class residential kitchen is typically equipped with a stove, a sink with hot and cold running water, a refrigerator, and worktops and kitchen cabinets arranged according to a modular design. Many households have a microwave oven, a dishwasher, and other electric appliances. The main functions of a kitchen are to store, prepare and cook food (and to complete related tasks such as dishwashing). The room or area may also be used for dining (or small meals such as breakfast), entertaining and laundry. The design and construction of kitchens is a huge market all over the world.\nCommercial kitchens are found in restaurants, cafeterias, hotels, hospitals, educational and workplace facilities, army barracks, and similar establishments. These kitchens are generally larger and equipped with bigger and more heavy-duty equipment than a residential kitchen. Fo"}
{"title": "wine", "content": "Wine is an alcoholic drink made from fermented fruit. Yeast consumes the sugar in the fruit and converts it to ethanol and carbon dioxide, releasing heat in the process. Wine is most often made from grapes, and the term \"wine\" generally refers to grape wine when used without any qualification. Even so, wine can be made from a variety of fruit crops, including plum, cherry, pomegranate, blueberry, currant, and elderberry. \nDifferent varieties of grapes and strains of yeasts are major factors in different styles of wine. These differences result from the complex interactions between the biochemical development of the grape, the reactions involved in fermentation, the grape's growing environment (terroir), and the wine production process. Many countries enact legal appellations intended to define styles and qualities of wine. These typically restrict the geographical origin and permitted varieties of grapes, as well as other aspects of wine production. \nWine has been produced for thousand"}
{"title": "cub", "content": "A cub is the young of certain large predatory animals, such as big cats and bears.\nCub or CUB may also refer to:"}
{"title": "person", "content": "A person (pl.: people or persons, depending on context) is a being who has certain capacities or attributes such as reason, morality, consciousness or self-consciousness, and being a part of a culturally established form of social relations such as kinship, ownership of property, or legal responsibility. The defining features of personhood and, consequently, what makes a person count as a person, differ widely among cultures and contexts.\nIn addition to the question of personhood, of what makes a being count as a person to begin with, there are further questions about personal identity and self: both about what makes any particular person that particular person instead of another, and about what makes a person at one time the same person as they were or will be at another time despite any intervening changes.\nThe plural form \"people\" is often used to refer to an entire nation or ethnic group (as in \"a people\"), and this was the original meaning of the word; it subsequently acquired its"}
{"title": "waffle", "content": "A waffle is a dish made from leavened batter or dough that is cooked between two plates that are patterned to give a characteristic size, shape, and surface impression. There are many variations based on the type of waffle iron and recipe used. Waffles are eaten throughout the world, particularly in Belgium, which has over a dozen regional varieties.  Waffles may be made fresh or simply heated after having been commercially cooked and frozen."}
{"title": "plate", "content": "Plate may refer to:"}
{"title": "oven", "content": "An oven is a tool that is used to expose materials to a hot environment. Ovens contain a hollow chamber and provide a means of heating the chamber in a controlled way. In use since antiquity, they have been used to accomplish a wide variety of tasks requiring controlled heating. Because they are used for a variety of purposes, there are many different types of ovens. These types differ depending on their intended purpose and based upon how they generate heat.\nOvens are often used for cooking, usually baking, sometimes broiling; they can be used to heat food to a desired temperature. Ovens are also used in the manufacturing of ceramics and pottery; these ovens are sometimes referred to as kilns. Metallurgical furnaces are ovens used in the manufacturing of metals, while glass furnaces are ovens used to produce glass.\nThere are many methods by which different types of ovens produce heat. Some ovens heat materials using the combustion of a fuel, such as wood, coal, or natural gas, while m"}
{"title": "bike", "content": "A bicycle, also called a pedal cycle, bike, push-bike or cycle, is a human-powered or motor-assisted, pedal-driven, single-track vehicle, with two wheels attached to a frame, one behind the other. A bicycle rider is called a cyclist, or bicyclist.\nBicycles were introduced in the 19th century in Europe. By the early 21st century there were more than 1 billion bicycles. There are many more bicycles than cars. Bicycles are the principal means of transport in many regions. They also provide a popular form of recreation, and have been adapted for use as children's toys. Bicycles are used for fitness, military and police applications, courier services, bicycle racing, and artistic cycling.\nThe basic shape and configuration of a typical upright or \"safety\" bicycle, has changed little since the first chain-driven model was developed around 1885. However, many details have been improved, especially since the advent of modern materials and computer-aided design. These have allowed for a prolifer"}
{"title": "tv", "content": "Television (TV) is a telecommunication medium for transmitting moving images and sound. Additionally, the term can refer to a physical television set rather than the medium of transmission. Television is a mass medium for advertising, entertainment, news, and sports. The medium is capable of more than \"radio broadcasting\", which refers to an audio signal sent to radio receivers.\nTelevision became available in crude experimental forms in the 1920s, but only after several years of further development was the new technology marketed to consumers. After World War II, an improved form of black-and-white television broadcasting became popular in the United Kingdom and the United States, and television sets became commonplace in homes, businesses, and institutions. During the 1950s, television was the primary medium for influencing public opinion. In the mid-1960s, color broadcasting was introduced in the U.S. and most other developed countries.\nThe availability of various types of archival s"}
{"title": "goat", "content": "The goat or domestic goat (Capra hircus) is a species of goat-antelope that is mostly kept as livestock. It was domesticated from the wild goat (C. aegagrus) of Southwest Asia and Eastern Europe. The goat is a member of the family Bovidae, meaning it is closely related to the sheep. It was one of the first animals to be domesticated, in Iran around 10,000 years ago.\nGoats have been used for milk, meat, wool, and skins across much of the world. Milk from goats is often turned into cheese. In 2022, there were more than 1.1 billion goats living in the world, of which 150 million were in India.\nGoats feature in mythology, folklore, and religion in many parts of the world, including in the classical myth of Amalthea, in the goats that pulled the chariot of the Norse god Thor, in the Scandinavian Yule goat, and in Hinduism's goat-headed Daksha. In Christianity and Satanism, the devil is sometimes depicted as a goat."}
{"title": "stroller", "content": "Various methods of transporting children have been used in different cultures and times. These methods include baby carriages (prams in British English), infant car seats, portable bassinets (carrycots), strollers (pushchairs), slings, backpacks, baskets and bicycle carriers.\nThe large, heavy prams (short for perambulator), which had become popular during the Victorian era, were replaced by lighter designs during the latter half of the 1900s."}
{"title": "bowl", "content": "A bowl is a typically round dish or container generally used for preparing, serving, storing, or consuming food. The interior of a bowl is characteristically shaped like a spherical cap, with the edges and the bottom, forming a seamless curve. This makes bowls especially suited for holding liquids and loose food, as the contents of the bowl are naturally concentrated in its center by the force of gravity. The exterior of a bowl is most often round, but can be of any shape, including rectangular.\nThe size of bowls varies from small bowls used to hold a single serving of food to large bowls, such as punch bowls or salad bowls, that are often used to hold or store more than one portion of food. There is some overlap between bowls, cups, and plates. Very small bowls, such as the tea bowl, are often called cups, while plates with especially deep wells are often called bowls.\nIn many cultures, bowls are the most common kind of vessel used for serving and eating food. Historically, small bowl"}
{"title": "dogs", "content": "The dog (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the gray wolf. Also called the domestic dog, it was selectively bred from a population of wolves during the Late Pleistocene by hunter-gatherers. The dog was the first species to be domesticated by humans, over 14,000 years ago and before the development of agriculture. Due to their long association with humans, dogs have gained the ability to thrive on a starch-rich diet that would be inadequate for other canids.\nDogs have been bred for desired behaviors, sensory capabilities, and physical attributes. Dog breeds vary widely in shape, size, and color. They have the same number of bones (with the exception of the tail), powerful jaws that house around 42 teeth, and well-developed senses of smell, hearing, and sight. Compared to humans, dogs possess a superior sense of smell and hearing, but inferior visual acuity. Dogs perform many roles for humans, such as hunting, herding, pulling loads, protection, c"}
{"title": "hair", "content": "Hair is a protein filament that grows from follicles found in the dermis. Hair is one of the defining characteristics of mammals.\nThe human body, apart from areas of glabrous skin, is covered in follicles which produce thick terminal and fine vellus hair. Most common interest in hair is focused on hair growth, hair types, and hair care, but hair is also an important biomaterial primarily composed of protein, notably alpha-keratin.\nAttitudes towards different forms of hair, such as hairstyles and hair removal, vary widely across different cultures and historical periods, but it is often used to indicate a person's personal beliefs or social position, such as their age, gender, or religion."}
{"title": "post", "content": "Post, POST, or posting may refer to:"}
{"title": "tub", "content": "Tub  may refer to:\n\nA tub (container):\na  round or oblong container with or without a lid:\na plant pot\na shallow, plastic or paper container, typically with a lid or closure\nTub (unit), a former quantity for sale or butter or cheese\nA bathtub, a plumbing fixture for bathing\nHot tub, a large bath or small pool designed to comfortably hold multiple persons\nQuarry tub, a type of railway or tramway wagon\nSlack tub, in blacksmithing, a quench\nTub boat, an unpowered cargo boat used on early canals\nTwin tub, a type of washing machine\nTub file, in computing, an early, primitive random access memory technology.\nTub Welch, a baseball player.\nTUB may refer to:\n\nTUB (gene)\nCitroën TUB, a light van\nTechnische Universität Berlin (Germany)\nTransports Urbains du Beauvaisis, local public transport operator in northern France\nTubuai – Mataura Airport (IATA airport code)\nTUBS or Tubs may refer to:\n\nTime unit box system, a system for notating events that happen over a time period.\nTokai University Boardin"}
{"title": "pads", "content": "Pads (also called leg guards) are a type of protective equipment used in a number of sports and serve to protect the legs from the impact of a hard ball, puck, or other object of play travelling at high speed which could otherwise cause injuries to the lower legs. These are used by batters in the sport of cricket, catchers in the sports of baseball and fastpitch softball, and by goaltenders in sports such as ice hockey, ringette, bandy, rinkball, field hockey, rink hockey and box lacrosse."}
{"title": "platter", "content": "Platter may refer to:\n\nPlatter (album), by Jock Cheese\nPlatter (dinner), a meal of several components served together on a platter or in a basket\nPlatter (dishware), large dish used for serving food\nPlatter (horse), American Champion racehorse\nPlatter, Oklahoma, U.S.\nHard disk drive platter, part of a computer hard drive\nA platter lift, a mechanized system for pulling skiers and snowboarders uphill\nThe Platters, an American vocal group\nPlatter, a part of a turntable\nPLATTER, an acronym for the Planning Tool for Trusted Electronic Repositories developed by Humanities Advanced Technology and Information Institute"}
{"title": "heads", "content": "A head is the part of an organism which usually includes the ears, brain, forehead, cheeks, chin, eyes, nose, and mouth, each of which aid in various sensory functions such as sight, hearing, smell, and taste. Some very simple animals may not have a head, but many bilaterally symmetric forms do, regardless of size. \nHeads develop in animals by an evolutionary trend known as cephalization. In bilaterally symmetrical animals, nervous tissue concentrate at the anterior region, forming structures responsible for information processing. Through biological evolution, sense organs and feeding structures also concentrate into the anterior region; these collectively form the head."}
{"title": "pineapples", "content": "The pineapple (Ananas comosus) is a tropical plant with an edible fruit; it is the most economically significant plant in the family Bromeliaceae.\nThe pineapple is indigenous to South America, where it has been cultivated for many centuries. The introduction of the pineapple plant to Europe in the 17th century made it a significant cultural icon of luxury. Since the 1820s, pineapple has been commercially grown in greenhouses and many tropical plantations.\nPineapples grow as a small shrub; the individual flowers of the unpollinated plant fuse to form a multiple fruit. The plant normally propagates from the offset produced at the top of the fruit or from a side shoot, and typically matures within a year."}
{"title": "vegetables", "content": "Vegetables are edible parts of plants that are consumed by humans or other animals as food. This original meaning is still commonly used, and is applied to plants collectively to refer to all edible plant matter, including flowers, fruits, stems, leaves, roots, and seeds. An alternative definition is applied somewhat arbitrarily, often by culinary and cultural tradition; it may include savoury fruits such as tomatoes and courgettes, flowers such as broccoli, and seeds such as pulses, but exclude foods derived from some plants that are fruits, flowers, nuts, and cereal grains.\nOriginally, vegetables were collected from the wild by hunter-gatherers and entered cultivation in several parts of the world, probably during the period 10,000 BC to 7,000 BC, when a new agricultural way of life developed. At first, plants that grew locally were cultivated, but as time went on, trade brought common and exotic crops from elsewhere to add to domestic types. Nowadays, most vegetables are grown all o"}
{"title": "helmet", "content": "A helmet is a form of protective gear worn to protect the head. More specifically, a helmet complements the skull in protecting the human brain. Ceremonial or symbolic helmets (e.g., a policeman's helmet in the United Kingdom) without protective function are sometimes worn. Soldiers wear combat helmets, often made from Kevlar or other lightweight synthetic fibers.\nThe word helmet is derived from helm, an Old English word for a protective head covering.\nHelmets are used for most sports (e.g., jockeys, American football, ice hockey, cricket, baseball, skiing, hurling and rock climbing); dangerous work activities such as construction, mining, riot police, military aviation, and in transportation (e.g. motorcycle helmets and bicycle helmets). Since the 1990s, most helmets are made from resin or plastic, which may be reinforced with fibers such as aramids."}
{"title": "bunch", "content": "Bunch may refer to:\n\nBunch (surname)\nBunch Davis (fl. 1906–1911), American baseball player in the Negro leagues\nBUNCH, nickname of five computer manufacturing companies, IBM's main competitors in the 1970s\nTussock (grass) or bunch grass, members of the family Poaceae\nBunch, Oklahoma, United States\nBunch Creek, Placer County, California, United States\nThe Bunch, a 1972 British folk rock group\nUSS Bunch (DE-694), a United States Navy destroyer escort\nHumpback whale, sometimes called a bunch"}
{"title": "trees", "content": "In botany, a tree is a perennial plant with an elongated stem, or trunk, usually supporting branches and leaves. In some usages, the definition of a tree may be narrower, e.g., including only woody plants with secondary growth, only plants that are usable as lumber, or only plants above a specified height. But wider definitions include taller palms, tree ferns, bananas, and bamboos. \nTrees are not a monophyletic taxonomic group but consist of a wide variety of plant species that have independently evolved a trunk and branches as a way to tower above other plants to compete for sunlight. The majority of tree species are angiosperms or hardwoods; of the rest, many are gymnosperms or softwoods. Trees tend to be long-lived, some trees reaching several thousand years old. Trees evolved around 400 million years ago, and it is estimated that there are around three trillion mature trees in the world currently.\nA tree typically has many secondary branches supported clear of the ground by the tr"}
{"title": "group", "content": "A group is a number of persons or things that are located, gathered, or classed together."}
{"title": "gear", "content": "A gear or gearwheel is a rotating machine part typically used to transmit rotational motion and/or torque by means of a series of teeth that engage with compatible teeth of another gear or other part.  The teeth can be integral saliences or cavities machined on the part, or separate pegs inserted into it.  In the latter case, the gear is usually called a cogwheel.  A cog may be one of those pegs or the whole gear.  Two or more meshing gears are called a gear train. \nThe smaller member of a pair of meshing gears is often called pinion.  Most commonly, gears and gear trains can be used to trade torque for rotational speed between two axles or other rotating parts and/or to change the axis of rotation and/or to invert the sense of rotation. A gear may also be used to transmit linear force and/or linear motion to a rack, a straight bar with a row of compatible teeth.  \n\nGears are among the most common mechanical parts.  They come in a great variety of shapes and materials, and are used for"}
{"title": "fruit", "content": "In botany, a fruit is the seed-bearing structure in flowering plants (angiosperms) that is formed from the ovary after flowering.\nFruits are the means by which angiosperms disseminate their seeds. Edible fruits in particular have long propagated using the movements of humans and other animals in a symbiotic relationship that is the means for seed dispersal for the one group and nutrition for the other; humans, and many other animals, have become dependent on fruits as a source of food. Consequently, fruits account for a substantial fraction of the world's agricultural output, and some (such as the apple and the pomegranate) have acquired extensive cultural and symbolic meanings.\nIn common language and culinary usage, fruit normally means the seed-associated fleshy structures (or produce) of plants that typically are sweet (or sour) and edible in the raw state, such as apples, bananas, grapes, lemons, oranges, and strawberries. In botanical usage, the term fruit also includes many struc"}
{"title": "liquid", "content": "Liquid is a state of matter with a definite volume but no fixed shape. Liquids adapt to the shape of their container and are nearly incompressible, maintaining their volume even under pressure. The density of a liquid is usually close to that of a solid, and much higher than that of a gas. Therefore, liquid and solid are classified as condensed matter. Meanwhile, since both liquids and gases can flow, they are categorized as fluids.\nA liquid is composed of atoms or molecules held together by intermolecular bonds of intermediate strength. These forces allow the particles to move around one another while remaining closely packed. In contrast, solids have particles that are tightly bound by strong intermolecular forces, limiting their movement to small vibrations in fixed positions. Gases, on the other hand, consist of widely spaced, freely moving particles with only weak intermolecular forces.\nAs temperature increases, the molecules in a liquid vibrate more intensely, causing the distanc"}
{"title": "street", "content": "A street is a public thoroughfare in a city, town or village, typically lined with buildings on one or both sides.  Streets often include pavements (sidewalks), pedestrian crossings, and sometimes amenities like streetlights or benches. A street can be as simple as a level patch of dirt, but is more often paved with a hard, durable surface such as tarmac, concrete, cobblestone or brick. It can be designed for both social activity and movement.\nOriginally, the word street simply meant a paved road (Latin: via strata). The word street is still sometimes used informally as a synonym for road, for example in connection with the ancient Watling Street, but city residents and urban planners draw a significant modern distinction: a road's main function is transportation, while streets facilitate public interaction. Examples of streets include pedestrian streets, alleys, and city-centre streets too crowded for motor vehicles to pass. Conversely, highways and motorways are types of roads, but f"}
{"title": "edge", "content": "Edge or EDGE may refer to:"}
{"title": "race", "content": "Race, RACE or The Race may refer to:\n\nRace (biology), an informal taxonomic classification within a species, generally within a sub-species\nRace (human categorization), classification of humans into groups based on physical traits, and/or social relations\nRacing, a competition of speed"}
{"title": "surfers", "content": "Surfing is a surface water sport in which an individual, a surfer (or two in tandem surfing), uses a board to ride on the forward section, or face, of a moving wave of water, which usually carries the surfer towards the shore. Waves suitable for surfing are primarily found on ocean shores, but can also be found as standing waves in the open ocean, in lakes, in rivers in the form of a tidal bore, or wave pools.\nSurfing includes all forms of wave-riding using a board, regardless of the stance. There are several types of boards. The Moche of Peru would often surf on reed craft, while the native peoples of the Pacific surfed waves on alaia, paipo, and other such watercraft. Ancient cultures often surfed on their belly and knees, while modern-day surfing is most often stand-up surfing, in which a surfer rides a wave while standing on a surfboard.\nAnother prominent form of surfing is body boarding, where a surfer rides the wave on a bodyboard, either lying on their belly, drop knee (one foot"}
{"title": "air", "content": "An atmosphere (from Ancient Greek  ἀτμός (atmós) 'vapour, steam' and  σφαῖρα (sphaîra) 'sphere') is a layer of gases that envelop an astronomical object, held in place by the gravity of the object. A planet retains an atmosphere when the gravity is great and the temperature of the atmosphere is low. A stellar atmosphere is the outer region of a star, which includes the layers above the opaque photosphere; stars of low temperature might have outer atmospheres containing compound molecules.\nThe atmosphere of Earth is composed of nitrogen (78%), oxygen (21%), argon (0.9%), carbon dioxide (0.04%) and trace gases. Most organisms use oxygen for respiration; lightning and bacteria perform nitrogen fixation which produces ammonia that is used to make nucleotides and amino acids; plants, algae, and cyanobacteria use carbon dioxide for photosynthesis. The layered composition of the atmosphere minimises the harmful effects of sunlight, ultraviolet radiation, solar wind, and cosmic rays and thus p"}
{"title": "glass", "content": "Glass is an amorphous (non-crystalline) solid. Because it is often transparent and chemically inert, glass has found widespread practical, technological, and decorative use in window panes, tableware, and optics. Some common objects made of glass are named after the material, e.g., a \"glass\" for drinking, \"glasses\" for vision correction, and a \"magnifying glass\".\nGlass is most often formed by rapid cooling (quenching) of the molten form. Some glasses such as volcanic glass are naturally occurring, and obsidian has been used to make arrowheads and knives since the Stone Age. Archaeological evidence suggests glassmaking dates back to at least 3600 BC in Mesopotamia, Egypt, or Syria. The earliest known glass objects were beads, perhaps created accidentally during metalworking or the production of faience, which is a form of pottery using lead glazes.\nDue to its ease of formability into any shape, glass has been traditionally used for vessels, such as bowls, vases, bottles, jars and drinki"}
{"title": "obstacle", "content": "An obstacle (also called a barrier, impediment, or stumbling block) is an object, thing, action or situation that causes an obstruction. A obstacle blocks or hinders our way forward. Different types of obstacles include physical, economic, biopsychosocial, cultural, political, technological and military."}
{"title": "window", "content": "A window is an opening in a wall, door, roof, or vehicle that allows the exchange of light and may also allow the passage of sound and sometimes air. Modern windows are usually glazed or covered in some other transparent or translucent material, a sash set in a frame in the opening; the sash and frame are also referred to as a window. Many glazed windows may be opened, to allow ventilation, or closed to exclude inclement weather. Windows may have a latch or similar mechanism to lock the window shut or to hold it open by various amounts.\nTypes include the eyebrow window, fixed windows, hexagonal windows, single-hung, and double-hung sash windows, horizontal sliding sash windows, casement windows, awning windows, hopper windows, tilt, and slide windows (often door-sized), tilt and turn windows, transom windows, sidelight windows, jalousie or louvered windows, clerestory windows, lancet windows, skylights, roof windows, roof lanterns, bay windows, oriel windows, thermal, or Diocletian, wi"}
{"title": "buttons", "content": "A button is a  fastener that joins two pieces of fabric together by slipping through a loop or by sliding through a buttonhole.\nIn modern clothing and fashion design, buttons are commonly made of plastic but also may be made of metal, wood, or seashell. Buttons can also be used on containers such as wallets and bags. Buttons may be sewn onto garments and similar items exclusively for purposes of ornamentation. In the applied arts and craft, a button can be an example of folk art, studio craft, or even a miniature work of art. In archaeology, a button can be a significant artifact."}
{"title": "girls", "content": "A girl is a young female human, usually a child or an adolescent.  While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture.  In cultures where women have or had a low social position, girls may be unwanted by their parents, and society may invest less in girls.  The difference in girls' and boys' upbringing ranges from slight to completely different.  Mixing of the sexes may vary by age, and from totally mixed to total sex segregation."}
{"title": "sky", "content": "The sky is an unobstructed view upward from the surface of the Earth. It includes the atmosphere and outer space. It may also be considered a place between the ground and outer space, thus distinct from outer space.\nIn the field of astronomy, the sky is also called the celestial sphere. This is an abstract sphere, concentric to the Earth, on which the Sun, Moon, planets, and stars appear to be drifting. The celestial sphere is conventionally divided into designated areas called constellations.\nUsually, the term sky informally refers to a perspective from the Earth's surface; however, the meaning and usage can vary. An observer on the surface of the Earth can see a small part of the sky, which resembles a dome (sometimes called the sky bowl) appearing flatter during the day than at night. In some cases, such as in discussing the weather, the sky refers to only the lower, denser layers of the atmosphere.\nThe daytime sky appears blue because air molecules scatter shorter wavelengths of su"}
{"title": "cream", "content": "Cream is a dairy product composed of the higher-fat layer skimmed from the top of milk before homogenization. In un-homogenized milk, the fat, which is less dense, eventually rises to the top. In the industrial production of cream, this process is accelerated by using centrifuges called \"separators\". In many countries, it is sold in several grades depending on the total butterfat content. It can be dried to a powder for shipment to distant markets, and contains high levels of saturated fat.\nCream skimmed from milk may be called \"sweet cream\" to distinguish it from cream skimmed from whey, a by-product of cheese-making. Whey cream has a lower fat content and tastes more salty, tangy, and \"cheesy\". In many countries partially fermented cream is also sold as: sour cream, crème fraîche, and so on.  Both forms have many culinary uses in both sweet and savoury dishes.\nCream produced by cattle (particularly Jersey cattle) grazing on natural pasture often contains some fat-soluble carotenoid p"}
{"title": "surfing", "content": "Surfing is a surface water sport in which an individual, a surfer (or two in tandem surfing), uses a board to ride on the forward section, or face, of a moving wave of water, which usually carries the surfer towards the shore. Waves suitable for surfing are primarily found on ocean shores, but can also be found as standing waves in the open ocean, in lakes, in rivers in the form of a tidal bore, or wave pools.\nSurfing includes all forms of wave-riding using a board, regardless of the stance. There are several types of boards. The Moche of Peru would often surf on reed craft, while the native peoples of the Pacific surfed waves on alaia, paipo, and other such watercraft. Ancient cultures often surfed on their belly and knees, while modern-day surfing is most often stand-up surfing, in which a surfer rides a wave while standing on a surfboard.\nAnother prominent form of surfing is body boarding, where a surfer rides the wave on a bodyboard, either lying on their belly, drop knee (one foot"}
{"title": "cows", "content": "Cattle (Bos taurus) are large, domesticated, bovid ungulates widely kept as livestock. They are prominent modern members of the subfamily Bovinae and the most widespread species of the genus Bos. Mature female cattle are called cows and mature male cattle are bulls. Young female cattle are called heifers, young male cattle are oxen or bullocks, and castrated male cattle are known as steers. \nCattle are commonly raised for meat, for dairy products, and for leather. As draft animals, they pull carts and farm implements. Cattle are considered sacred animals within Hinduism, and it is illegal to kill them in some Indian states. Small breeds such as the miniature Zebu are kept as pets.\nTaurine cattle are widely distributed across Europe and temperate areas of Asia, the Americas, and Australia. Zebus are found mainly in India and tropical areas of Asia, America, and Australia. Sanga cattle are found primarily in sub-Saharan Africa. These types, sometimes classified as separate species or sub"}
{"title": "course", "content": "Course may refer to:"}
{"title": "skiers", "content": "Skiing is the use of skis to glide on snow for basic transport, a recreational activity, or a competitive winter sport. Many types of competitive skiing events are recognized by the International Olympic Committee (IOC), and the International Ski and Snowboard Federation (FIS)."}
{"title": "stable", "content": "A stable is a building in which working animals are kept, especially horses or oxen.: 200 : 42  The building is usually divided into stalls, and may include storage for equipment and feed."}
{"title": "chair", "content": "A chair is a type of seat, typically designed for one person and consisting of one or more legs, a flat or slightly angled seat and a back-rest. It may be made of wood, metal, or synthetic materials, and may be padded or upholstered in various colors and fabrics.\nChairs vary in design. An armchair has armrests fixed to the seat; a recliner is upholstered and features a mechanism that lowers the chair's back and raises into place a footrest; a rocking chair has legs fixed to two long curved slats; and a wheelchair has wheels fixed to an axis under the seat."}
{"title": "woman", "content": "A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause. More generally, sex differentiation of the female fetus is governed by the lack of a present, or functioning, SRY gene on either one of the respective sex chromosomes. Female anatomy is distinguished from male anatomy by the female reproductive system, which includes the ovaries, fallopian tubes, uterus, vagina, and vulva. An adult woman generally has a wider pelvis, broader hips, and larger breasts than an adult man. These characteristics facilitate childbirth and breastfeeding. Women typically have less facial and other body hair, have a higher body fat composition, and are on average shorter and less muscular than men.\nThroughout human history, traditional gender roles within "}
{"title": "stove", "content": "A stove or range is a device that generates heat inside or on top of the device, for -local heating or cooking. Stoves can be powered with many fuels, such as natural gas, electricity, gasoline, wood, and coal.\nDue to concerns about air pollution, efforts have been made to improve stove design. Pellet stoves are a type of clean-burning stove. Air-tight stoves are another type that burn the wood more completely and therefore, reduce the amount of the combustion by-products. Another method of reducing air pollution is through the addition of a device to clean the exhaust gas, for example, a filter or afterburner.\nResearch and development on safer and less emission releasing stoves is continuously evolving."}
{"title": "crowd", "content": "A crowd is as a group of people that have gathered for a common purpose or intent. Examples are a demonstration, a sports event, or a looting (classified in sociology as an acting crowd). A crowd may also simply be made up of many people going about their business in a busy area.\nThe term \"the crowd\" may sometimes refer to the lower orders of people in general."}
{"title": "clock", "content": "A clock or chronometer is a device that measures and displays time. The clock is one of the oldest human inventions, meeting the need to measure intervals of time shorter than the natural units such as the day, the lunar month, and the year. Devices operating on several physical processes have been used over the millennia.\nSome predecessors to the modern clock may be considered \"clocks\" that are based on movement in nature: A sundial shows the time by displaying the position of a shadow on a flat surface. There is a range of duration timers, a well-known example being the hourglass. Water clocks, along with sundials, are possibly the oldest time-measuring instruments. A major advance occurred with the invention of the verge escapement, which made possible the first mechanical clocks around 1300 in Europe, which kept time with oscillating timekeepers like balance wheels.\nTraditionally, in horology (the study of timekeeping), the term clock was used for a striking clock, while a clock th"}
{"title": "wave", "content": "In physics, mathematics, engineering, and related fields, a wave is a propagating dynamic disturbance (change from equilibrium) of one or more quantities. Periodic waves oscillate repeatedly about an equilibrium (resting) value at some frequency. When the entire waveform moves in one direction, it is said to be a travelling wave; by contrast, a pair of superimposed periodic waves traveling in opposite directions makes a standing wave. In a standing wave, the amplitude of vibration has nulls at some positions where the wave amplitude appears smaller or even zero.\nThere are two types of waves that are most commonly studied in classical physics: mechanical waves and electromagnetic waves. In a mechanical wave, stress and strain fields oscillate about a mechanical equilibrium. A mechanical wave is a local deformation (strain) in some physical medium that propagates from particle to particle by creating local stresses that cause strain in neighboring particles too. For example, sound waves "}
{"title": "arms", "content": "Arms or ARMS may refer to:\n\nArm or arms, the upper limbs of the body\nArm, Arms, or ARMS may also refer to:"}
{"title": "table", "content": "Table may refer to:\n\nTable (database), how the table data arrangement is used within the databases\nTable (furniture), a piece of furniture with a flat surface and one or more legs\nTable (information), a data arrangement with rows and columns\nTable (landform), a flat area of land\nTable (parliamentary procedure)\nTable (sports), a ranking of the teams in a sports league\nTables (board game)\nMathematical table\nTables of the skull, a term for the flat bones\nTable, surface of the sound board (music) of a string instrument\nAl-Ma'ida, the fifth surah of the Qur'an, occasionally translated as “The Table”\nCalligra Tables, a spreadsheet application\nWater table"}
{"title": "bottle", "content": "A bottle is a narrow-necked container made of an impermeable material (such as glass, plastic or aluminium) in various shapes and sizes that stores and transports liquids. Its mouth, at the bottling line, can be sealed with an internal stopper, an external bottle cap, a closure, or induction sealing."}
{"title": "monitor", "content": "Monitor or monitor may refer to:"}
{"title": "counter", "content": "Counter may refer to:"}
{"title": "coat", "content": "A coat is typically an outer garment for the upper body, worn by any gender for warmth or fashion. Coats typically have long sleeves and are open down the front, and closing by means of buttons, zippers, hook-and-loop fasteners (AKA velcro), toggles, a belt, or a combination of some of these. Other possible features include collars, shoulder straps, and hoods."}
{"title": "room", "content": "In a building or a ship, a room is any enclosed space within a number of walls to which entry is possible only via a door or other dividing structure. The entrance connects it to either a passageway, another room, or the outdoors. The space is typically large enough for several people to move about. The size, fixtures, furnishings, and sometimes placement of the room within the building or ship (or sometimes a train) support the activity to be conducted in it."}
{"title": "bottom", "content": "Bottom may refer to:"}
{"title": "picture", "content": "An image or picture is a visual representation. An image can be two-dimensional, such as a drawing, painting, or photograph, or three-dimensional, such as a carving or sculpture. Images may be displayed through other media, including a projection on a surface, activation of electronic signals, or digital displays; they can also be reproduced through mechanical means, such as photography, printmaking, or photocopying. Images can also be animated through digital or physical processes.\nIn the context of signal processing, an image is a distributed amplitude of color(s). In optics, the term image (or optical image) refers specifically to the reproduction of an object formed by light waves coming from the object.\nA volatile image exists or is perceived only for a short period. This may be a reflection of an object by a mirror, a projection of a camera obscura, or a scene displayed on a cathode-ray tube. A fixed image, also called a hard copy, is one that has been recorded on a material obje"}
{"title": "giraffe", "content": "The giraffe is a large African hoofed mammal belonging to the genus Giraffa. It is the tallest living terrestrial animal and the largest ruminant on Earth. It is classified under the family Giraffidae, along with its closest extant relative, the okapi. Traditionally, giraffes have been thought of as one species, Giraffa camelopardalis, with nine subspecies. Most recently, researchers proposed dividing them into four extant species which can be distinguished by their fur coat patterns. Six valid extinct species of Giraffa are known from the fossil record.\nThe giraffe's distinguishing characteristics are its extremely long neck and legs, horn-like ossicones, and spotted coat patterns. Its scattered range extends from Chad in the north to South Africa in the south and from Niger in the west to Somalia in the east. Giraffes usually inhabit savannahs and woodlands. Their food source is leaves, fruits, and flowers of woody plants, primarily acacia species, which they browse at heights most o"}
{"title": "shoe", "content": "A shoe is an item of footwear intended to protect and comfort the human foot. Though the human foot can adapt to varied terrains and climate conditions, it is vulnerable, and shoes provide protection. Form was originally tied to function, but over time, shoes also became fashion items. Some shoes are worn as safety equipment, such as steel-toe boots, which are required footwear at industrial worksites.\nAdditionally, shoes have often evolved into many different designs; high heels, for instance, are most commonly worn by women during fancy occasions. Contemporary footwear varies vastly in style, complexity and cost. Basic sandals may consist of only a thin sole and simple strap and be sold for a low cost. High fashion shoes made by famous designers may be made of expensive materials, use complex construction and sell for large sums of money. Some shoes are designed for specific purposes, such as boots designed specifically for mountaineering or skiing, while others have more generalized"}
{"title": "horses", "content": "The horse (Equus ferus caballus) is a domesticated, one-toed, hoofed mammal. It belongs to the taxonomic family Equidae and is one of two extant subspecies of Equus ferus. The horse has evolved over the past 45 to 55 million years from a small multi-toed creature, Eohippus, into the large, single-toed animal of today. Humans began domesticating horses around 4000 BCE in Central Asia, and their domestication is believed to have been widespread by 3000 BCE. Horses in the subspecies caballus are domesticated, although some domesticated populations live in the wild as feral horses. These feral populations are not true wild horses, which are horses that have never been domesticated. There is an extensive, specialized vocabulary used to describe equine-related concepts, covering everything from anatomy to life stages, size, colors, markings, breeds, locomotion, and behavior.\nHorses are adapted to run, allowing them to quickly escape predators, and possess a good sense of balance and a strong"}
{"title": "bride", "content": "A bride is a woman who is about to be married or who is a newlywed.\nWhen marrying, if the bride's future spouse is a man, he is usually referred to as the bridegroom or just groom.  In Western culture, a bride may be attended by a maid, bridesman and one or more bridesmaids.\nThe word \"bride\" has its roots in the Old English word bryd, which is shared with other Germanic languages. In Western countries, brides typically wear white wedding dresses, a tradition started by Queen Victoria. The white dress was once considered a symbol of luxury due to the difficulties in laundering delicate white clothing. Today, Western brides may wear white, cream, or ivory dresses, regardless of their number of marriages.\nIn non-Western countries, brides often wear national dress, with white wedding dresses being uncommon in Asian cultures as it symbolizes mourning and death. Red, on the other hand, represents vibrancy and health and is commonly worn by brides in many Asian cultures. Brides may also wear "}
{"title": "sidewalk", "content": "A sidewalk (North American English),\n\n \npavement (British English, South African English), or footpath (Irish English, Indian English, Australian English, New Zealand English) is a path along the side of a road. Usually constructed of concrete, pavers, brick, stone, or asphalt, it is designed for pedestrians. A sidewalk is normally higher than the roadway, and separated from it by a curb. There may also be a planted strip between the sidewalk and the roadway and between the roadway and the adjacent land."}
{"title": "bathroom", "content": "A bathroom is a room in which people wash their bodies or parts thereof. It can contain one or more of the following plumbing fixtures: a shower, a bathtub, a bidet, and a sink (also known as a wash basin in the United Kingdom). A toilet is also frequently included. There are also specific toilet rooms, only containing a toilet (often accompanied by a sink), which in American English tend to be called \"bathrooms\", \"powder rooms\" or \"washrooms\", as euphemisms to conceal their actual purpose, while they in British English are known as just \"toilets\" or possibly \"cloakrooms\" - but also as \"lavatories\" when they are public.\nHistorically, bathing was often a collective activity, which took place in public baths. In some countries, the shared social aspect of cleansing the body is still important, for example with sento in Japan and, throughout the Islamic world, the hammam (also known in the West as a \"Turkish bath\")."}
{"title": "coffee", "content": "Coffee is a beverage brewed from roasted, ground coffee beans. Darkly colored, bitter, and slightly acidic, coffee has a stimulating effect on humans, primarily due to its caffeine content, but decaffeinated coffee is also commercially available.  There are also various coffee substitutes. Typically served hot, coffee has the highest sales in the world market for hot drinks.\nCoffee production begins when the seeds from coffee cherries (the Coffea plant's fruits) are separated to produce unroasted green coffee beans. The \"beans\" are roasted and then ground into fine particles. Coffee is brewed from the ground roasted beans, which are typically steeped in hot water before being filtered out. It is usually served hot, although chilled or iced coffee is common. Coffee can be prepared and presented in a variety of ways (e.g., espresso, French press, caffè latte, or already-brewed canned coffee). Sugar, sugar substitutes, milk, and cream are often added to mask the bitter taste or enhance th"}
{"title": "umbrella", "content": "An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain. The term umbrella is traditionally used when protecting oneself from rain, while parasol is used when protecting oneself from sunlight, though the terms continue to be used interchangeably. Often the difference is the material used for the canopy; some parasols are not waterproof, and some umbrellas are transparent. Umbrella canopies may be made of fabric or flexible plastic. There are also combinations of parasol and umbrella that are called en-tout-cas (French for \"in any case\").\nGenerally speaking, parasols and umbrellas are small, handheld, personal use items. Golf umbrellas are the biggest hand-portable umbrellas available. There are two types of umbrellas: completely collapsible umbrellas, which can be folded up into a small enough bag because of the supporting metal pole's ability to retract, an"}
{"title": "man", "content": "A man is an adult male human. Before adulthood, a male child or adolescent is referred to as a boy.\nLike most other male mammals, a man's genome usually inherits an X chromosome from the mother and a Y chromosome from the father. Sex differentiation of the male fetus is governed by the SRY gene on the Y chromosome. During puberty, hormones which stimulate androgen production result in the development of secondary sexual characteristics that result in even more differences between the sexes. These include greater muscle mass, greater height, the growth of facial hair and a lower body fat composition. Male anatomy is distinguished from female anatomy by the male reproductive system, which includes the testicles, sperm ducts, prostate gland and epididymides, and penis. Secondary sex characteristics include a narrower pelvis and hips, and smaller breasts and nipples.\nThroughout human history, traditional gender roles have often defined men's activities and opportunities. Men often face con"}
{"title": "her", "content": "Her is the objective and possessive form of the English-language feminine pronoun she. \nHer, HER or H.E.R. may also refer to:"}
{"title": "station", "content": "Station may refer to:"}
{"title": "pizzas", "content": "Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples. In 2009, Neapolitan pizza was registered with the European Union as a traditional speciality guaranteed (TSG) dish. In 2017, the art of making Neapolitan pizza was included on UNESCO's list of intangible cultural heritage.\nPizza and its variants are among the most popular foods in the world. Pizza is sold at a variety of restaurants, including pizzerias (pizza specialty restaurants), Mediterranean restaurants, via delivery, and as street food. In Italy, pizza served in a restaurant is presented unsliced, and is eaten with the use of a kn"}
{"title": "ocean", "content": "The ocean is the body of salt water that covers approximately 70.8% of Earth. The ocean is conventionally divided into large bodies of water, which are also referred to as oceans (the Pacific, Atlantic, Indian, Antarctic/Southern, and Arctic Ocean),  and are themselves mostly divided into seas, gulfs and subsequent bodies of water. The ocean contains 97% of Earth's water and is the primary component of Earth's hydrosphere, acting as a huge reservoir of heat for Earth's energy budget, as well as for its carbon cycle and water cycle, forming the basis for climate and weather patterns worldwide. The ocean is essential to life on Earth, harbouring most of Earth's animals and protist life, originating photosynthesis and therefore Earth's atmospheric oxygen, still supplying half of it.\nOcean scientists split the ocean into vertical and horizontal zones based on physical and biological conditions. Horizontally the ocean covers the oceanic crust, which it shapes. Where the ocean meets dry land"}
{"title": "acts", "content": "The Acts of the Apostles (Koinē Greek: Πράξεις Ἀποστόλων, Práxeis Apostólōn; Latin: Actūs Apostolōrum) is the fifth book of the New Testament; it tells of the founding of the Christian Church and the spread of its message to the Roman Empire.\nActs and the Gospel of Luke make up a two-part work, Luke–Acts, by the same anonymous author. Traditionally, the author is believed to be Luke the Evangelist, a doctor who travelled with Paul the Apostle. It is usually dated to around 80–90 AD, although some scholars suggest 110–120 AD.  Many modern scholars doubt the attribution to the physician Luke, and critical opinion on the subject was assessed to be roughly evenly divided near the end of the 20th century. Most scholars maintain that the author of Luke–Acts, whether named Luke or not, was a companion of Paul,  though objections include contradictions with the authentic Pauline letters. The first part, the Gospel of Luke, tells how God fulfilled his plan for the world's salvation through the "}
{"title": "truck", "content": "A truck or lorry is a motor vehicle designed to transport freight, carry specialized payloads, or perform other utilitarian work. Trucks vary greatly in size, power, and configuration, but the vast majority feature body-on-frame construction, with a cabin that is independent of the payload portion of the vehicle. Smaller varieties may be mechanically similar to some automobiles. Commercial trucks can be very large and powerful and may be configured to be mounted with specialized equipment, such as in the case of refuse trucks, fire trucks, concrete mixers, and suction excavators. In American English, a commercial vehicle without a trailer or other articulation is formally a \"straight truck\" while one designed specifically to pull a trailer is not a truck but a \"tractor\".\nThe majority of trucks currently in use are powered by diesel engines, although small- to medium-size trucks with gasoline engines exist in North America. Electrically powered trucks are more popular in China and Europ"}
{"title": "note", "content": "Note, notes, or NOTE may refer to:"}
{"title": "beach", "content": "A beach is a landform alongside a body of water which consists of loose particles. The particles composing a beach are typically made from rock, such as sand, gravel, shingle, pebbles, etc., or biological sources, such as mollusc shells or coralline algae. Sediments settle in different densities and structures, depending on the local wave action and weather, creating different textures, colors and gradients or layers of material.\nThough some beaches form on inland freshwater locations such as lakes and rivers, most beaches are in coastal areas where wave or current action deposits and reworks sediments. Erosion and changing of beach geologies happens through natural processes, like wave action and extreme weather events.  Where wind conditions are correct, beaches can be backed by coastal dunes which offer protection and regeneration for the beach.  However, these natural forces have become more extreme due to climate change, permanently altering beaches at very rapid rates. Some estim"}
{"title": "sandwich", "content": "A sandwich is a dish typically consisting variously of meat, cheese, sauces, and vegetables used as a filling between slices of bread, or placed atop a slice of bread; or, more generally, any dish in which bread serves as a container or wrapper for another food type, and allows it to be a finger food. The sandwich began as a portable, convenient food in the Western world, though over time it has become prevalent worldwide.\nThere has been social media debate over the precise definition of sandwich, specifically whether a hot dog or open sandwich can be categorized as such. Other items, like hamburgers and burritos, were also considered. In the United States, the Department of Agriculture (USDA) and the Food and Drug Administration (FDA) are the responsible agencies for protecting the definition of sandwich. The USDA uses the definition, \"at least 35% cooked meat and no more than 50% bread\" for closed sandwiches, and \"at least 50% cooked meat\" for open sandwiches. However, the same USDA "}
{"title": "horse", "content": "The horse (Equus ferus caballus) is a domesticated, one-toed, hoofed mammal. It belongs to the taxonomic family Equidae and is one of two extant subspecies of Equus ferus. The horse has evolved over the past 45 to 55 million years from a small multi-toed creature, Eohippus, into the large, single-toed animal of today. Humans began domesticating horses around 4000 BCE in Central Asia, and their domestication is believed to have been widespread by 3000 BCE. Horses in the subspecies caballus are domesticated, although some domesticated populations live in the wild as feral horses. These feral populations are not true wild horses, which are horses that have never been domesticated. There is an extensive, specialized vocabulary used to describe equine-related concepts, covering everything from anatomy to life stages, size, colors, markings, breeds, locomotion, and behavior.\nHorses are adapted to run, allowing them to quickly escape predators, and possess a good sense of balance and a strong"}
{"title": "shelf", "content": "Shelf (pl.: shelves) may refer to:\n\nShelf (storage), a flat horizontal surface used for display and storage"}
{"title": "cage", "content": "A cage is an enclosure often made of mesh, bars, or wires, used to confine, contain or protect something or someone. A cage can serve many purposes, including keeping an animal or person in captivity, capturing an animal or person, and displaying an animal at a zoo."}
{"title": "utensils", "content": "Utensil may refer to:\n\nKitchen utensil, one of the tools of cooking and baking – cookware and bakeware\nEating utensil, a tool for shaping and carrying food to the mouth\nA tool, serving a set purpose\nDragon Throne, also called the \"divine utensil\" – the rhetorical seat of power in the Empire of China (221 BC – 1912)\nRoyal Utensils, associated with the quintet of Royal Regalia in Thailand"}
{"title": "desk", "content": "A desk or bureau is a piece of furniture with a flat table-style work surface used in a school, office, home or the like for academic, professional or domestic activities such as reading, writing, or using equipment such as a computer. Desks often have one or more drawers, compartments, or pigeonholes to store items such as office supplies and papers. Desks are usually made of wood or metal, although materials such as glass are sometimes seen.\nSome desks have the form of a table, although usually only one side of a desk is suitable to sit at (there are some exceptions, such as a partners desk) Some desks do not have the form of a table, for instance, an armoire desk is a desk built within a large wardrobe-like cabinet, and a portable desk is light enough to be placed on a person's lap. Since many people lean on a desk while using it, a desk must be sturdy. In most cases, people sit at a desk, either on a separate chair or a built-in chair (e.g., in some school desks). Some people use s"}
{"title": "ear", "content": "In vertebrates, an ear is the organ that enables hearing and (in mammals) body balance using the vestibular system. In humans, the ear is described as having three parts:  the outer ear, the middle ear and the inner ear. The outer ear consists of the auricle and the ear canal. Since the outer ear is the only visible portion of the ear, the word \"ear\" often refers to the external part (auricle) alone. The middle ear includes the tympanic cavity and the three ossicles. The inner ear sits in the bony labyrinth, and contains structures which are key to several senses: the semicircular canals, which enable balance and eye tracking when moving; the utricle and saccule, which enable balance when stationary; and the cochlea, which enables hearing. The ear canal is cleaned via earwax, which naturally migrates to the auricle. \nThe ear develops from the first pharyngeal pouch and six small swellings that develop in the early embryo called otic placodes, which are derived from the ectoderm.\nThe ea"}
{"title": "computer", "content": "A computer is a machine that can be programmed to automatically carry out sequences of arithmetic or logical operations (computation). Modern digital electronic computers can perform generic sets of operations known as programs, which enable computers to perform a wide range of tasks. The term computer system may refer to a nominally complete computer that includes the hardware, operating system, software, and peripheral equipment needed and used for full operation; or to a group of computers that are linked and function together, such as a computer network or computer cluster.\nA broad range of industrial and consumer products use computers as control systems, including simple special-purpose devices like microwave ovens and remote controls, and factory devices like industrial robots. Computers are at the core of general-purpose devices such as personal computers and mobile devices such as smartphones. Computers power the Internet, which links billions of computers and users.\nEarly com"}
{"title": "itself", "content": "A reflexive pronoun is a pronoun that refers to another noun or pronoun (its antecedent) within the same sentence.\nIn the English language specifically, a reflexive pronoun will end in -self or -selves, and refer to a previously named noun or pronoun (myself, yourself, ourselves, themselves, etc.). English intensive pronouns, used for emphasis, take the same form.\nIn generative grammar, a reflexive pronoun is an anaphor that must be bound by its antecedent (see binding). In a general sense, it is a noun phrase that obligatorily gets its meaning from another noun phrase in the sentence. Different languages have different binding domains for reflexive pronouns, according to their structure."}
{"title": "area", "content": "Area is the measure of a region's size on a surface. The area of a plane region or plane area refers to the area of a shape or planar lamina, while surface area refers to the area of an open surface or the boundary of a three-dimensional object. Area can be understood as the amount of material with a given thickness that would be necessary to fashion a model of the shape, or the amount of paint necessary to cover the surface with a single coat. It is the two-dimensional analogue of the length of a curve (a one-dimensional concept) or the volume of a solid (a three-dimensional concept).\nTwo different regions may have the same area (as in squaring the circle); by synecdoche, \"area\" sometimes is used to refer to the region, as in a \"polygonal area\".\nThe area of a shape can be measured by comparing the shape to squares of a fixed size. In the International System of Units (SI), the standard unit of area is the square metre (written as m2), which is the area of a square whose sides are one "}
{"title": "white", "content": "White is the lightest color and is achromatic (having no chroma). It is the color of objects such as snow, chalk, and milk, and is the opposite of black. White objects fully (or almost fully) reflect and scatter all the visible wavelengths of light. White on television and computer screens is created by a mixture of red, blue, and green light. The color white can be given with white pigments, especially titanium dioxide.\nIn ancient Egypt and ancient Rome, priestesses wore white as a symbol of purity, and Romans wore white togas as symbols of citizenship. In the Middle Ages and Renaissance a white unicorn symbolized chastity, and a white lamb sacrifice and purity. It was the royal color of the kings of France as well as the flag of monarchist France from 1815 to 1830, and of the monarchist movement that opposed the Bolsheviks during the Russian Civil War (1917–1922). Greek temples and Roman temples were faced with white marble, and beginning in the 18th century, with the advent of neocl"}
{"title": "hole", "content": "A hole is an opening in or through a particular medium, usually a solid body. Holes occur through natural and artificial processes, and may be useful for various purposes, or may represent a problem needing to be addressed in many fields of engineering. Depending on the material and the placement, a hole may be an indentation in a surface (such as a hole in the ground), or may pass completely through that surface (such as a hole created by a hole puncher in a piece of paper)."}
{"title": "portrait", "content": "A portrait is a painting, photograph, sculpture, or other artistic representation of a person, in which the face is always predominant. In arts, a portrait may be represented as half body and even full body. If the subject in full body better represents personality and mood, this type of presentation may be chosen. The intent is to display the likeness, personality, and even the mood of the person. For this reason, in photography a portrait is generally not a snapshot, but a composed image of a person in a still position. A portrait often shows a person looking directly at the painter or photographer, to most successfully engage the subject with the viewer, but portrait may be represented as a profile (from aside) and 3/4."}
{"title": "forest", "content": "A forest is an ecosystem characterized by a dense community of trees. Hundreds of definitions of forest are used throughout the world, incorporating factors such as tree density, tree height, land use, legal standing, and ecological function. The United Nations' Food and Agriculture Organization (FAO) defines a forest as, \"Land spanning more than 0.5 hectares with trees higher than 5 meters and a canopy cover of more than 10 percent, or trees able to reach these thresholds in situ. It does not include land that is predominantly under agricultural or urban use.\" Using this definition, Global Forest Resources Assessment 2020 found that forests covered 4.06 billion hectares (10.0 billion acres; 40.6 million square kilometres; 15.7 million square miles), or approximately 31 percent of the world's land area in 2020.\nForests are the largest terrestrial ecosystems of Earth by area, and are found around the globe. 45 percent of forest land is in the tropical latitudes. The next largest share o"}
{"title": "skis", "content": "Skis are runners, attached to the user's feet, designed to glide over snow. Typically employed in pairs, skis are attached to ski boots with ski bindings, with either a free, lockable, or partially secured heel. For climbing slopes, ski skins can be affixed to the base of each ski to prevent them from sliding backwards. Originally used as a means of travel over snow, skis have become specialized for recreational and competitive alpine and cross-country skiing."}
{"title": "starbucks", "content": "Starbucks Corporation is an American multinational chain of coffeehouses and roastery reserves headquartered in Seattle, Washington. It was founded in 1971 by Jerry Baldwin, Zev Siegl, and Gordon Bowker at Seattle's Pike Place Market initially as a coffee bean wholesaler. Starbucks was converted into a coffee shop serving espresso-based drinks under the ownership of Howard Schultz, who was chief executive officer from 1986 to 2000 and led the aggressive expansion of the franchise across the West Coast of the United States.\nAs of November 2022, the company had 35,711 stores in 80 countries, 15,873 of which were located in the United States. Of Starbucks' U.S.-based stores, over 8,900 are company-operated, while the remainder are licensed. It is the world's largest coffeehouse chain. The company is ranked 120th on the Fortune 500 and 303rd on the Forbes Global 2000, as of 2022.\nThe rise of the second wave of coffee culture is generally attributed to Starbucks, which introduced a wider va"}
{"title": "zebras", "content": "Zebras (US: , UK: ) (subgenus Hippotigris) are African equines with distinctive black-and-white striped coats. There are three living species: Grévy's zebra (Equus grevyi), the plains zebra (E. quagga), and the mountain zebra (E. zebra). Zebras share the genus Equus with horses and asses, the three groups being the only living members of the family Equidae. Zebra stripes come in different patterns, unique to each individual. Several theories have been proposed for the function of these patterns, with most evidence supporting them as a deterrent for biting flies. Zebras inhabit eastern and southern Africa and can be found in a variety of habitats such as savannahs, grasslands, woodlands, shrublands, and mountainous areas.\nZebras are primarily grazers and can subsist on lower-quality vegetation. They are preyed on mainly by lions, and typically flee when threatened but also bite and kick. Zebra species differ in social behaviour, with plains and mountain zebra living in stable harems con"}
{"title": "blender", "content": "A blender (sometimes called a mixer (from Latin mixus, the PPP of miscere eng. to Mix) or liquidiser in British English) is a kitchen and laboratory appliance used to mix, crush, purée or emulsify food and other substances. A stationary blender consists of a blender container with a rotating metal or plastic  blade at the bottom, powered by an electric motor that is in the base. Some powerful models can also crush ice and other frozen foods. The newer immersion blender configuration has a motor on top connected by a shaft to a rotating blade at the bottom, which can be used with any container."}
{"title": "surfer", "content": "Surfing is a surface water sport in which an individual, a surfer (or two in tandem surfing), uses a board to ride on the forward section, or face, of a moving wave of water, which usually carries the surfer towards the shore. Waves suitable for surfing are primarily found on ocean shores, but can also be found as standing waves in the open ocean, in lakes, in rivers in the form of a tidal bore, or wave pools.\nSurfing includes all forms of wave-riding using a board, regardless of the stance. There are several types of boards. The Moche of Peru would often surf on reed craft, while the native peoples of the Pacific surfed waves on alaia, paipo, and other such watercraft. Ancient cultures often surfed on their belly and knees, while modern-day surfing is most often stand-up surfing, in which a surfer rides a wave while standing on a surfboard.\nAnother prominent form of surfing is body boarding, where a surfer rides the wave on a bodyboard, either lying on their belly, drop knee (one foot"}
{"title": "zone", "content": "Zone, Zones or The Zone may refer to:"}
{"title": "bed", "content": "A bed is a piece of furniture that is used as a place to sleep, rest, and relax.\nMost modern beds consist of a soft, cushioned mattress on a bed frame. The mattress rests either on a solid base, often wood slats, or a sprung base. Many beds include a box spring inner-sprung base, which is a large mattress-sized box containing wood and springs that provide additional support and suspension for the mattress. Beds are available in many sizes, ranging from infant-sized bassinets and cribs, to small beds for a single person or adult, to large queen and king-size beds designed for two people. While most beds are single mattresses on a fixed frame, there are other varieties, such as the murphy bed, which folds into a wall, the sofa bed, which folds out of a sofa, the trundle bed, which is stored under a low, twin-sized bed and can be rolled out to create a larger sleeping area, and the bunk bed, which provides two mattresses on two tiers as well as a ladder to access the upper tier. Temporary"}
{"title": "legs", "content": "A leg is a weight-bearing and locomotive anatomical structure, usually having a columnar shape. During locomotion, legs function as \"extensible struts\".  The combination of movements at all joints can be modeled as a single, linear element capable of changing length and rotating about an omnidirectional \"hip\" joint.\nAs an anatomical animal structure, it is used for locomotion. The distal end is often modified to distribute force (such as a foot). Most animals have an even number of legs.\nAs a component of furniture, it is used for the economy of materials needed to provide the support for the useful surface, such as the table top or chair seat."}
{"title": "pot", "content": "Pot may refer to:"}
{"title": "door", "content": "A door is a hinged or otherwise movable barrier that allows ingress (entry) into and egress (exit) from an enclosure. The created opening in the wall is a doorway or portal. A door's essential and primary purpose is to provide security by controlling access to the doorway (portal). Conventionally, it is a panel that fits into the doorway of a building, room, or vehicle. Doors are generally made of a material suited to the door's task. They are commonly attached by hinges, but can move by other means, such as slides or counterbalancing.\nThe door may be able to move in various ways (at angles away from the doorway/portal, by sliding on a plane parallel to the frame, by folding in angles on a parallel plane, or by spinning along an axis at the center of the frame) to allow or prevent ingress or egress. In most cases, a door's interior matches its exterior side. But in other cases (e.g., a vehicle door) the two sides are radically different.\nMany doors incorporate locking mechanisms to ens"}
{"title": "ball", "content": "A ball is a round object (usually spherical, but sometimes ovoid) with several uses. It is used in ball games, where the play of the game follows the state of the ball as it is hit, kicked or thrown by players. Balls can also be used for simpler activities, such as catch or juggling. Balls made from hard-wearing materials are used in engineering applications to provide very low friction bearings, known as ball bearings. Black-powder weapons use stone and metal balls as projectiles.\nAlthough many types of balls are today made from rubber, this form was unknown outside the Americas until after the voyages of Columbus. The Spanish were the first Europeans to see the bouncing rubber balls (although solid and not inflated) which were employed most notably in the Mesoamerican ballgame. Balls used in various sports in other parts of the world prior to Columbus were made from other materials such as animal bladders or skins, stuffed with various materials.\nAs balls are one of the most familiar"}
{"title": "tower", "content": "A tower is a tall structure, taller than it is wide, often by a significant factor. Towers are distinguished from masts by their lack of guy-wires and are therefore, along with tall buildings, self-supporting structures.\nTowers are specifically distinguished from buildings in that they are built not to be habitable but to serve other functions using the height of the tower. For example, the height of a clock tower improves the visibility of the clock, and the height of a tower in a fortified building such as a castle increases the visibility of the surroundings for defensive purposes. Towers may also be built for observation, leisure, or telecommunication purposes. A tower can stand alone or be supported by adjacent buildings, or it may be a feature on top of a larger structure or building."}
{"title": "boards", "content": "Board or Boards may refer to:"}
{"title": "dishwasher", "content": "A dishwasher is a machine that is used to clean dishware, cookware, and cutlery automatically. Unlike manual dishwashing, which relies on physical scrubbing to remove soiling, the mechanical dishwasher cleans by spraying hot water, typically between 45 and 75 °C (110 and 170 °F), at the dishes, with lower temperatures of water used for delicate items.\nA mix of water and dishwasher detergent is pumped to one or more rotating sprayers, cleaning the dishes with the cleaning mixture. The mixture is recirculated to save water and energy. Often there is a pre-rinse, which may or may not include detergent, and the water is then drained. This is followed by the main wash with fresh water and detergent. Once the wash is finished, the water is drained; more hot water enters the tub by means of an electromechanical solenoid valve, and the rinse cycle(s) begin. After the rinse process finishes, the water is drained again and the dishes are dried using one of several drying methods. Typically a rin"}
{"title": "rackett", "content": "The rackett, raggett, cervelas, or sausage bassoon is a Renaissance-era double reed wind instrument, introduced late in the sixteenth century and already superseded by bassoons at the end of the seventeenth century."}
{"title": "tricks", "content": "Trick(s) may refer to:"}
{"title": "hill", "content": "A hill is a landform that extends above the surrounding terrain. It often has a distinct summit, and is usually applied to peaks which are above elevation compared to the relative landmass, though not as prominent as mountains. Hills fall under the category of slope landforms."}
{"title": "bear", "content": "Bears are carnivoran mammals of the family Ursidae (). They are classified as caniforms, or doglike carnivorans.  Although only eight species of bears are extant, they are widespread, appearing in a wide variety of habitats throughout most of the Northern Hemisphere and partially in the Southern Hemisphere. Bears are found on the continents of North America, South America, and Eurasia. Common characteristics of modern bears include large bodies with stocky legs, long snouts, small rounded ears, shaggy hair, plantigrade paws with five nonretractile claws, and short tails.\nWhile the polar bear is mostly carnivorous, and the giant panda is mostly herbivorous, the remaining six species are omnivorous with varying diets. With the exception of courting individuals and mothers with their young, bears are typically solitary animals. They may be diurnal or nocturnal and have an excellent sense of smell. Despite their heavy build and awkward gait, they are adept runners, climbers, and swimmers. "}
{"title": "something", "content": "Something may refer to:"}
{"title": "bench", "content": "Bench, The Bench, Benched, or Benching may refer to:"}
{"title": "replica", "content": "A replica is an exact (usually 1:1 in scale) copy or remake of an object, made out of the same raw materials, whether a molecule, a work of art, or a commercial product. The term is also used for copies that closely resemble the original, without claiming to be identical. Copies or reproductions of documents, books, manuscripts, maps or art prints are called facsimiles. \nReplicas have been sometimes sold as originals, a type of fraud. Most replicas have more innocent purposes. Fragile originals need protection, while the public can examine a replica in a museum. Replicas are often manufactured and sold as souvenirs.\nNot all incorrectly attributed items are intentional forgeries. In the same way that a museum shop might sell a print of a painting or a replica of a vase, copies of statues, paintings, and other precious artifacts have been popular through the ages.\nHowever, replicas have often been used illegally for forgery and counterfeits, especially of money and coins, but also commer"}
{"title": "phone", "content": "A telephone, colloquially referred to as a phone, is a telecommunications device that enables two or more users to conduct a conversation when they are too far apart to be easily heard directly. A telephone converts sound, typically and most efficiently the human voice, into electronic signals that are transmitted via cables and other communication channels to another telephone which reproduces the sound to the receiving user. The term is derived from Ancient Greek: τῆλε, romanized: tēle, lit. 'far' and φωνή (phōnē, voice), together meaning distant voice.\nIn 1876, Alexander Graham Bell was the first to be granted a United States patent for a device that produced clearly intelligible replication of the human voice at a second device. This instrument was further developed by many others, and became rapidly indispensable in business, government, and in households.\nThe essential elements of a telephone are a microphone (transmitter) to speak into and an earphone (receiver) which reproduces"}
{"title": "cave", "content": "Caves or caverns are natural voids under the Earth's surface. Caves often form by the weathering of rock and often extend deep underground. Exogene caves are smaller openings that extend a relatively short distance underground (such as rock shelters). Caves which extend further underground than the opening is wide are called endogene caves.\nSpeleology is the science of exploration and study of all aspects of caves and the cave environment. Visiting or exploring caves for recreation may be called caving, potholing, or spelunking."}
{"title": "hydrant", "content": "A hydrant is an outlet from a fluid main often consisting of an upright pipe with a valve attached, from which fluid (e.g. water or fuel) can be tapped.\nDepending on the fluid involved, the term may refer to:\n\nFire hydrant for firefighting water supply\nFlushing hydrant for cleaning water mains\nHydrant network systems used to transport aviation fuel from an oil depot to an airport, to fuel aircraft\nSnowmaking hydrants, which use water and air\nStandpipe (street), a type of domestic or neighbourhood hydrant for dispensing water when supply is interrupted or absent"}
{"title": "it", "content": "It or IT may refer to:\n\nIt (pronoun), in English\nInformation technology"}
{"title": "case", "content": "Case or CASE may refer to:"}
{"title": "pie", "content": "A pie is a baked dish which is usually made of a pastry dough casing that contains a filling of various sweet or savoury ingredients. Sweet pies may be filled with fruit (as in an apple pie), nuts (pecan pie), fruit preserves (jam tart), brown sugar (sugar pie), sweetened vegetables (rhubarb pie), or with thicker fillings based on eggs and dairy (as in custard pie and cream pie). Savoury pies may be filled with meat (as in a steak pie or a Jamaican patty), eggs and cheese (such as quiches or British flans) or a mixture of meat and vegetables (pot pie).\nPies are defined by their crusts. A filled pie (also single-crust or bottom-crust), has pastry lining the baking dish, and the filling is placed on top of the pastry but left open. A top-crust pie has the filling in the bottom of the dish and is covered with a pastry or other covering before baking. A two-crust pie has the filling completely enclosed in the pastry shell. Shortcrust pastry is a typical kind of pastry used for pie crusts, "}
{"title": "chain", "content": "A chain is a serial assembly of connected pieces, called links, typically made of metal, with an overall character similar to that of a rope in that it is flexible and curved in compression but linear, rigid, and load-bearing in tension. A chain may consist of two or more links. Chains can be classified by their design, which can be dictated by their use:\n\nThose designed for lifting, such as when used with a hoist; for pulling; or for securing, such as with a bicycle lock, have links that are torus-shaped, which make the chain flexible in two dimensions (the fixed third dimension being a chain's length). Small chains serving as jewellery are a mostly decorative analogue of such types.\nThose designed for transferring power in machines have links designed to mesh with the teeth of the sprockets of the machine, and are flexible in only one dimension. They are known as roller chains, though there are also non-roller chains such as block chains.\nTwo distinct chains can be connected using a "}
{"title": "foreground", "content": "Foreground and background or background and foreground may refer to:\n\nBackground, foreground, sideground and postground intellectual property, distinct forms of intellectual property assets\nBackground subtraction, a technique in image processing and computer vision by which an image's foreground is extracted for further processing\nFigure–ground (perception), a humans' ability to separate foreground from background in visual images\nForeground-background, a scheduling algorithm that is used to control execution of multiple processes on a single processor\nForeground-background segmentation, a method for studying change blindness using photographs with distinct foreground and background scenery\nForeground detection, a concept in computer vision to detect changes in image sequences\nForeground and background in photography and cinematography, a principle important for\nDepth of field, the distance between the nearest and farthest objects in a scene that appear acceptably sharp in an image\nDee"}
{"title": "they", "content": "In Modern English, they is a third-person pronoun relating to a grammatical subject."}
