[
  {
    "image_path": "data/images/000000158227.jpg",
    "query": "Describe everything visible in the image.",
    "caption": "A child has a baseball helmet and a bat. A helmet is a form of protective gear worn to protect the head. More specifically, a helmet complements the skull in protecting the human brain. Bats are flying mammals of the order Chiroptera (). With their forelimbs adapted as wings, they are the only mammals capable of true and sustained flight. A child (pl. children) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty. The term may also refer to an unborn human being."
  },
  {
    "image_path": "data/images/000000557672.jpg",
    "query": "Tell me what's going on in the photo.",
    "caption": "A woman walking down a street holding an orange umbrella. An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain. A street is a public thoroughfare in a city, town or village, typically lined with buildings on one or both sides. Streets often include pavements (sidewalks), pedestrian crossings, and sometimes amenities like streetlights or benches. A woman is an adult female human. Before adulthood, a female child or adolescent is referred to as a girl.\nTypically, women are of the female sex and inherit a pair of X chromosomes, one from each parent, and women with functional uteruses are capable of pregnancy and giving birth from puberty until menopause."
  },
  {
    "image_path": "data/images/000000049761.jpg",
    "query": "What is happening in this image?",
    "caption": "Wild zebra and wildebeest grazing near a watering hole. Wildebeest ( WIL-dib-eest,  VIL-,), also called gnu ( NOO or  NEW), are antelopes of the genus Connochaetes and native to Eastern and Southern Africa. They belong to the family Bovidae, which includes true antelopes, cattle, goats, sheep, and other even-toed horned ungulates. Zebras (US: , UK: ) (subgenus Hippotigris) are African equines with distinctive black-and-white striped coats. There are three living species: Grévy's zebra (Equus grevyi), the plains zebra (E. A hole is an opening in or through a particular medium, usually a solid body. Holes occur through natural and artificial processes, and may be useful for various purposes, or may represent a problem needing to be addressed in many fields of engineering."
  },
  {
    "image_path": "data/images/000000005529.jpg",
    "query": "What can be seen here?",
    "caption": "A person with green skis skiing down a big hill. A hill is a landform that extends above the surrounding terrain. It often has a distinct summit, and is usually applied to peaks which are above elevation compared to the relative landmass, though not as prominent as mountains. A person (pl.: people or persons, depending on context) is a being who has certain capacities or attributes such as reason, morality, consciousness or self-consciousness, and being a part of a culturally established form of social relations such as kinship, ownership of property, or legal responsibility. The defining features of personhood and, consequently, what makes a person count as a person, differ widely among cultures and contexts.\nIn addition to the question of personhood, of what makes a being count as a person to begin with, there are further questions about personal identity and self: both about what makes any particular person that particular person instead of another, and about what makes a person at one time the same person as they were or will be at another time despite any intervening changes.\nThe plural form \"people\" is often used to refer to an entire nation or ethnic group (as in \"a people\"), and this was the original meaning of the word; it subsequently acquired its Skis are runners, attached to the user's feet, designed to glide over snow. Typically employed in pairs, skis are attached to ski boots with ski bindings, with either a free, lockable, or partially secured heel."
  },
  {
    "image_path": "data/images/000000011051.jpg",
    "query": "What can be seen here?",
    "caption": "Girl looks back as she fixes flower on boy's suit Flowers, also known as blooms and blossoms, are the reproductive structures of flowering plants (angiosperms). Typically, they are structured in four circular levels, called whorls, around the end of a stalk. A girl is a young female human, usually a child or an adolescent. While the term girl has other meanings, including young woman, daughter or girlfriend regardless of age, the first meaning is the most common one.\nThe treatment and status of girls in any society is usually closely related to the status of women in that culture. A suit, also called a lounge suit, business suit, dress suit, or formal suit, is a set of clothes comprising a suit jacket and trousers of identical textiles generally worn with a collared dress shirt, necktie, and dress shoes. A skirt suit is similar, but with a matching skirt instead of trousers."
  },
  {
    "image_path": "data/images/000000227491.jpg",
    "query": "Summarize the visual elements in this picture.",
    "caption": "A female skier sits down on a bench eating a bagel. Skiing is the use of skis to glide on snow for basic transport, a recreational activity, or a competitive winter sport. Many types of competitive skiing events are recognized by the International Olympic Committee (IOC), and the International Ski and Snowboard Federation (FIS). A bagel (Yiddish: בײגל, romanized: beygl; Polish: bajgiel [ˈbajɡʲɛl] ; also spelled beigel) is a bread roll originating in the Jewish communities of Poland. Bagels are traditionally made from yeasted wheat dough that is shaped by hand into a torus or ring, briefly boiled in water, and then baked."
  },
  {
    "image_path": "data/images/000000119641.jpg",
    "query": "Describe everything visible in the image.",
    "caption": "Many tourists riding on elephants in a river Tourism is travel for pleasure, and the commercial activity of providing and supporting such travel. UN Tourism defines tourism more generally, in terms which go \"beyond the common perception of tourism as being limited to holiday activity only\", as people \"travelling to and staying in places outside their usual environment for not more than one consecutive year for leisure and not less than 24 hours, business and other purposes\". A river is a natural stream of fresh water that flows on land or inside caves towards another body of water at a lower elevation, such as an ocean, lake, or another river. A river may run dry before reaching the end of its course if it runs out of water, or only flow during certain seasons. Elephants are the largest living land animals. Three living species are currently recognised: the African bush elephant (Loxodonta africana), the African forest elephant (L."
  },
  {
    "image_path": "data/images/000000344059.jpg",
    "query": "Summarize the visual elements in this picture.",
    "caption": "Two giraffes eat from a tall food post in their enclosure. The giraffe is a large African hoofed mammal belonging to the genus Giraffa. It is the tallest living terrestrial animal and the largest ruminant on Earth. Enclosure or inclosure is a term, used in English landownership, that refers to the appropriation of \"waste\" or \"common land\", enclosing it, and by doing so depriving commoners of their traditional rights of access and usage. Agreements to enclose land could be either through a formal or informal process."
  },
  {
    "image_path": "data/images/000000503855.jpg",
    "query": "Provide a description of this image.",
    "caption": "A park with yellow umbrellas on the grass and onlookers in the background. An umbrella or parasol is a folding canopy supported by wooden or metal ribs that is mounted on a wooden, metal, or plastic pole. It is usually designed to protect a person against rain. A park is an area of natural, semi-natural or planted space set aside for human enjoyment and recreation or for the protection of wildlife or natural habitats. Urban parks are green spaces set aside for recreation inside towns and cities. Poaceae ( poh-AY-see-e(y)e), also called Gramineae ( grə-MIN-ee-e(y)e), is a large and nearly ubiquitous family of monocotyledonous flowering plants commonly known as grasses. It includes the cereal grasses, bamboos, the grasses of natural grassland and species cultivated in lawns and pasture."
  },
  {
    "image_path": "data/images/000000376093.jpg",
    "query": "What is happening in this image?",
    "caption": "A group of young people eat pizzas and drink from pitchers. The term \"the people\" refers to the public or common mass of people of a polity. As such it is a concept of human rights law, international law as well as constitutional law, particularly used for claims of popular sovereignty. Pizza is an Italian, specifically Neapolitan, dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven.\nThe term pizza was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania. Raffaele Esposito is often credited for creating the modern pizza in Naples. In baseball, the pitcher is the player who throws (\"pitches\") the baseball from the pitcher's mound toward the catcher to begin each play, with the goal of retiring a batter, who attempts to either make contact with the pitched ball or draw a walk. In the numbering system used to record defensive plays, the pitcher is assigned the number 1. A group is a number of persons or things that are located, gathered, or classed together."
  }
]